[
  {
    "id": "f_ui2grDdRMwqOy-5yix0g",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751820862.609208,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751820999.636575
    },
    "result": {
      "title": "Master Claude Code in 14 Minutes (8 Steps)",
      "summary": "好的，這是一份根據您提供的 YouTube 影片轉錄文本，製作的深度分析與專業整理筆記。筆記嚴格遵循您要求的結構、格式與深度分析標準。\n\n---\n\n## **主要觀點與核心價值**\n\n這份筆記的核心價值在於將影片內容從一系列零散的「技巧」提升為一套**系統化、紀律化的 AI 輔助軟體開發哲學**。講者透過自身成功經驗（創建年收入 30 萬美元的 AI 應用），闡述的核心觀點是：**最大化 AI 編碼工具（如 Claude）效能的關鍵，不在於單純的提示詞技巧，而在於建立一個完整、嚴謹且包含人為監督的開發工作流程。**\n\n此方法的價值體現在以下幾個層面：\n\n1.  **從「被動使用者」到「主動架構師」的轉變**：影片倡導的並非將 Claude 視為一個神奇的黑盒子，輸入需求、等待結果。相反，它要求開發者扮演「系統架構師」與「專案經理」的角色。透過 `Claude.md` 規則檔案設定框架、利用「計畫模式」定義藍圖、透過 GitHub 進行版本控制，開發者始終掌握著專案的主導權，AI 則成為高效執行的夥伴，而非不可控的代理人。\n\n2.  **彌補當前 AI 編碼工具的內在缺陷**：講者敏銳地指出了當前 AI 編碼工具的幾個關鍵短板：缺乏內建的回溯機制（檢查點）、可能產生不安全的程式碼、以及上下文過長導致的「幻覺」與成本浪費。他提出的解決方案——利用 GitHub 作為手動檢查點、強制執行安全審查、戰術性地使用 `/clear` 指令——不僅是實用的技巧，更是對現階段 AI 技術局限性的深刻洞察與應對策略。\n\n3.  **建立「規劃-建構-安全-學習」的開發閉環**：影片中最具洞察力的觀點是其提出的四步開發循環。這超越了傳統的「規劃-建構」模式，加入了至關重要的 **安全（Security）** 和 **學習（Learn）** 兩個環節。這意味著每一次功能開發不僅是程式碼的產出，更是一次安全性的強化和開發者自身知識的積累。這個閉環確保了產出的程式碼不僅能用，而且安全、可維護，同時也加速了開發者（特別是新手）的成長曲線。\n\n4.  **重新定義生產力：將「等待時間」轉化為「創造時間」**：最後一個技巧看似是關於時間管理，實則觸及了人機協作的深層次問題。在與 AI 協作的過程中，必然存在大量的等待時間。講者提出將這段時間用於與另一個 AI 實例進行頭腦風暴，這是一種極具創意的解決方案。它不僅避免了「末日滾動 (doom scrolling)」帶來的精神內耗與效率低下，更將被動的等待轉化為主動的策略思考與創意發想，從而實現了生產力的指數級提升。\n\n總體而言，這份內容的價值不僅在於提供了 8 個具體的 Claude 使用技巧，更在於它為所有希望利用 AI 進行軟體開發的人（無論是專業工程師還是「憑感覺編碼 (vibe coder)」的新手）提供了一套可複製、可擴展、且注重品質與安全的工作方法論。\n\n---\n\n## **內容大綱**\n\n1.  **基礎設定：建立高效的 Claude 互動框架 (`Claude.md`)**\n2.  **策略規劃與執行：善用計畫模式與模型選擇**\n3.  **版本控制與回溯：以 GitHub 作為檢查點系統**\n4.  **多模態應用：利用圖像進行靈感獲取與錯誤修復**\n5.  **上下文管理與成本控制：`/clear` 的戰術性使用**\n6.  **安全審查：彌補 AI 在安全實踐中的不足**\n7.  **學習閉環：從 AI 的產出中學習與成長**\n8.  **生產力最大化：將 AI 等待時間轉化為創造價值時間**\n\n---\n\n## **關鍵術語與概念**\n\n-   **Claude Code**: 指的是整合在開發環境中（如 VS Code）的 Anthropic Claude 模型，作為一個強大的 AI 編碼助理。它不僅能編寫程式碼，還能理解專案的完整上下文。\n\n-   **`Claude.md` (規則檔案)**: 一個在專案根目錄下創建的 Markdown 檔案。Claude 在處理該專案的任何提示時，都會優先讀取此檔案中的指令。這相當於為 AI 設定了全域、持久的行為準則和工作框架。\n\n-   **計畫模式 (Plan Mode)**: Claude Code 的一種特殊互動模式（透過 `Shift + Tab` 兩次觸發）。在該模式下，AI 不會立即編寫程式碼，而是先根據用戶需求生成一份詳細的、分步驟的執行計畫，待用戶確認後再執行。\n\n-   **Opus & Sonnet**: Anthropic 提供的不同等級的 Claude 模型。**Opus** 是最強大、最昂貴的模型，適用於複雜的推理、規劃和策略制定。**Sonnet** 則在速度和成本之間取得了更好的平衡，適合執行已經規劃好的具體任務。\n\n-   **Vibe Coder**: 一個非正式術語，指那些可能沒有深厚計算機科學背景，更多依賴直覺、AI 工具和快速迭代來進行編碼的開發者。講者強調這類開發者尤其需要關注程式碼的安全性。\n\n-   **上下文視窗 (Context Window)**: 指 AI 在一次對話中能夠「記住」的資訊量（包含歷史對話、檔案內容等）。上下文視窗越大，AI 對專案的理解越全面，但同時也會增加處理成本（Token 消耗）和產生「幻覺」（不準確輸出）的風險。\n\n---\n\n## **重要引述與案例**\n\n> \"by forcing Claude code To break down everything it does into tiny little tasks and tiny little building blocks. You're ensuring it makes the best code possible.\"\n> (透過強迫 Claude 將其所做的每件事分解成微小的任務和微小的建構模塊，你正在確保它能產出最好的程式碼。)\n\n**分析**: 這句話揭示了講者工作流程的核心哲學：**任務分解是提升 AI 可靠性的關鍵**。大型、模糊的指令容易導致 AI 產生幻覺或走錯方向。而將複雜需求分解為一系列清晰、可驗證的小任務，不僅降低了單一步驟出錯的機率，也讓開發者能更容易地審查和驗證 AI 的每一步工作。`Claude.md` 中設定的規則正是為了將這種哲學自動化、系統化。\n\n> \"I start with planning to I do execution and then three is security checks, right? ... I'm adding a fourth now plan build security learn.\"\n> (我從規劃開始，然後執行，第三步是安全檢查，對吧？... 我現在加入了第四步：規劃、建構、安全、學習。)\n\n**分析**: 這是影片中最具價值的洞見，提出了一個超越傳統開發流程的**四步閉環模型**。它強調 AI 輔助開發不僅僅是程式碼的生成（規劃與建構），更是一個包含品質保證（安全）和能力提升（學習）的完整生態系統。這個模型將開發者的角色從一個單純的「指令下達者」提升為一個「品質控制者」和「持續學習者」，確保了專案的長期健康度和開發者自身的成長。\n\n> \"if you're Doom scrolling while Claude code works. You're seriously screwing up.\"\n> (如果 Claude 在工作時你卻在滑手機虛度光陰，那你真的搞砸了。)\n\n**分析**: 這句直白的警告點出了人機協作中的一個常見陷阱：**被動等待導致的生產力流失與精神內耗**。講者敏銳地意識到，AI 執行任務的等待時間是寶貴的資源。他提出的解決方案——利用這段時間與另一個 AI 進行頭腦風暴——不僅是時間管理技巧，更是一種心態上的轉變。它倡導將人機協作中的所有間隙都轉化為價值創造的機會，從而實現整體效率的最大化。\n\n---\n\n## **詳細內容分析**\n\n### **1. 基礎設定：建立高效的 Claude 互動框架 (`Claude.md`)**\n\n講者強調，一個精心設計的 `Claude.md` 規則檔案是高品質程式碼與糟糕程式碼的分水嶺。這份檔案的核心作用是為 Claude 設定一套**預設行為模式**，強制其以結構化、任務導向的方式進行思考和工作。講者提供的七條規則，其背後原理是將軟體工程中的**任務分解 (Task Decomposition)** 最佳實踐應用於與 AI 的互動中。\n\n-   **核心機制**: 規則要求 Claude 在執行任何操作前，先將任務分解為一系列步驟，並將這些步驟呈現給用戶以供審批。\n-   **技術細節**: 這些規則甚至會指示 Claude 創建一個專門的資料夾來記錄每次提示所對應的任務列表，這為後續的審查和追溯提供了極大的便利。\n-   **專業洞察**: 這種方法將開發者從一個被動的請求者，轉變為主動的審批者。它在人與 AI 之間建立了一個**確認-執行 (Acknowledge-Execute)** 的循環，極大地降低了因誤解指令而導致大規模重構的風險。講者聲稱，使用這套規則後，他幾個月內沒有遇到過任何 Bug，這證明了該方法的有效性。\n\n### **2. 策略規劃與執行：善用計畫模式與模型選擇**\n\n「計畫模式」被譽為 Claude 中最強大的工具，其精髓在於**將思考與執行分離**。講者提出了兩個關鍵的實踐技巧：\n\n1.  **過度使用計畫模式 (Overuse Plan Mode)**: 對於每一個微小的步驟，都應先進入計畫模式。雖然這看似增加了前期時間，但從長遠來看，它透過確保方向的正確性，避免了後期更大規模的返工，從而節省了大量時間。這是一種典型的「磨刀不誤砍柴工」的策略。\n2.  **策略性模型選擇 (Strategic Model Selection)**:\n    *   **規劃階段**: 使用最強大的 **Opus** 模型 (`/model opus`)。因為規劃需要深刻的理解、推理和創造力，Opus 的高品質輸出能確保計畫的周全與可行性。\n    *   **執行階段**: 使用更具成本效益的 **Sonnet** 模型 (`/model sonnet`)。一旦有了清晰、詳細的計畫，執行的複雜度就大大降低，Sonnet 足以勝任將計畫轉化為程式碼的工作。\n\n-   **影響分析**: 這種模型組合策略不僅保證了最終產出的品質，還能顯著**節省成本**，對於有預算限制的個人開發者或團隊來說至關重要。\n\n### **3. 版本控制與回溯：以 GitHub 作為檢查點系統**\n\n講者指出，與某些競品（如 Cursor）不同，Claude Code 目前缺乏內建的「檢查點」或「回溯」功能。一旦 AI 的修改出現問題，很難輕鬆地回到之前的狀態。為此，他提出了一個極其重要的工作流程整合：**將 GitHub 作為手動的檢查點系統**。\n\n-   **決策流程**:\n    *   **成功**: 如果 Claude 生成的程式碼運行正常、看起來不錯且高效，**立即**將其提交（commit）到 GitHub。講者甚至提到他一天會進行 20 次提交，這體現了**小步快跑、頻繁保存**的敏捷開發思想。\n    *   **失敗**: 如果 Claude 搞砸了，立即放棄當前的修改，從 GitHub 上一個可用的提交版本回溯（rewind/checkout），然後重新開始。\n-   **實踐建議**: 對於不熟悉 Git 的新手，講者建議直接請求 Claude 指導如何進行提交操作，這本身就是一個利用 AI 學習新技能的絕佳範例。\n\n### **4. 多模態應用：利用圖像進行靈感獲取與錯誤修復**\n\nClaude 的多模態能力（理解圖像）為編碼工作流帶來了新的可能性。講者分享了兩個核心應用場景：\n\n1.  **UI/UX 靈感獲取**: 當需要建構一個新的使用者介面時，可以直接對喜歡的應用程式進行螢幕截圖（在 Mac 上使用 `Command + Shift + 4`），然後將圖片拖入 Claude，並給出指令，如「根據這張截圖為我建構 UI」。AI 會分析圖片中的佈局、顏色和元件，並將其轉化為程式碼。\n2.  **視覺化錯誤修復 (Visual Bug Fixing)**: 當應用程式出現 UI 顯示錯誤或佈局混亂時，可以截取錯誤畫面的圖片，發送給 Claude 並要求其修復。這比用純文字描述一個視覺問題要**直觀和高效得多**。\n\n-   **專業洞察**: 這種方法將抽象的設計需求和具體的視覺問題轉化為 AI 可以直接處理的具體輸入，極大地提升了溝通效率，特別是在前端開發中。\n\n### **5. 安全審查：彌補 AI 在安全實踐中的不足**\n\n這是影片中最具責任感和前瞻性的建議之一。講者警告說，當前的 AI 模型尚未完全內化安全編碼的最佳實踐，這使得「憑感覺編碼 (vibe coder)」的開發者在無意中可能發布帶有嚴重安全漏洞的應用。\n\n-   **核心流程**: 在每次完成一個新功能後，都必須運行一次安全檢查。\n-   **關鍵提示詞**:\n    ```\n    Please check through all the code you just wrote and make sure it follows the security best practices. Make sure no sensitive information is in the front end and there are no vulnerabilities people can exploit.\n    (請檢查你剛寫的所有程式碼，確保它遵循安全最佳實踐。確保前端沒有任何敏感資訊，並且沒有可被利用的漏洞。)\n    ```\n-   **重點關注**: 這個提示詞特別強調了兩個最常見的安全問題：\n    1.  **敏感資訊洩漏**: 如 API 金鑰、密碼等不應出現在前端程式碼中。\n    2.  **常見漏洞**: 如 SQL 注入、跨站腳本等。\n-   **影響分析**: 將安全檢查制度化，是從「能用」的程式碼邁向「可靠」的產品的關鍵一步。對於任何計劃公開發布的應用程式來說，這一步驟**絕不可省略**。\n\n---\n\n## **實踐應用與建議**\n\n-   **建議1: 採用「規劃-建構-安全-學習」四步開發循環**\n    *   **實施方法**: 為你開發的每一個功能或模組，都嚴格遵循這個流程。在開始編寫任何程式碼前，使用「計畫模式」與 Opus 模型制定詳細計畫。計畫批准後，讓 Sonnet 模型執行。程式碼生成後，立即使用安全檢查提示詞進行審查。最後，使用學習提示詞讓 Claude 解釋它所做的工作，以加深你的理解。將這個循環內化為你的開發習慣。\n\n-   **建議2: 將 GitHub 整合為不可或缺的工作流程核心**\n    *   **實施方法**: 不要將 GitHub 視為專案完成後才使用的工具。養成**高頻率提交 (High-Frequency Commits)** 的習慣。每當 Claude 完成一個小任務且驗證無誤後，就立刻 `git commit`。這不僅是備份，更是你的專案時間軸和唯一的「撤銷」按鈕。為你的提交訊息寫下清晰的描述，例如「Feature: Add user login form UI」。\n\n-   **建議3: 掌握上下文與成本的動態管理**\n    *   **實施方法**: 養成在完成一個相對獨立的大任務後（例如，一個計畫檔案中的所有任務都已完成）使用 `/clear` 指令的習慣。這能確保下一個任務的對話是在一個乾淨的環境中開始，減少潛在的干擾和成本。同時，嚴格區分使用 Opus 和 Sonnet 的場景，將昂貴的 Opus 模型用在最需要智慧的「規劃」階段。\n\n---\n\n## **相關資源與延伸閱讀**\n\n-   **資源1: Anthropic 官方文件**\n    *   **說明與價值**: 深入了解 Claude 模型特性、`Claude.md` 規則檔案的詳細語法、以及不同模型（Opus, Sonnet, Haiku）的官方使用建議和定價。這是獲取第一手、最準確資訊的最佳來源。\n\n-   **資源2: GitHub Learning Lab**\n    *   **說明與價值**: 影片中提到，不熟悉 Git 的開發者應立即學習。GitHub Learning Lab 提供了免費的、互動式的課程，可以幫助初學者快速掌握 Git 和 GitHub 的基本操作，這是實施影片中「檢查點」策略的必備技能。\n\n-   **資源3: OWASP Top 10 (開放式 Web 應用程式安全專案)**\n    *   **說明與價值**: 影片強調了安全檢查的重要性。OWASP Top 10 是全球公認的、針對最關鍵 Web 應用程式安全風險的權威列表。開發者可以參考此列表，向 Claude 提出更具體的安全檢查要求，例如「請檢查程式碼是否存在 OWASP Top 10 中的注入漏洞」。\n\n---\n\n## **總結與未來展望**\n\n這段影片提供了一套極具價值的**AI 輔助開發方法論**，其核心思想是透過**建立結構化流程和引入嚴格的人為監督**，將 Claude 這樣強大的 AI 工具的潛力發揮到極致，同時有效規避其當前的技術局限性。講者提出的「規劃-建構-安全-學習」四步閉環，以及將 GitHub、多模態輸入和時間管理技巧無縫整合到工作流中，為所有開發者（尤其是新手）提供了一條通往高效、高品質、高安全性軟體開發的清晰路徑。\n\n**未來展望**:\n\n1.  **AI 工具的內建流程化**: 未來的 AI 編碼工具很可能會將影片中提到的這些「手動」最佳實踐內建為原生功能。例如，提供一鍵式的「檢查點」回溯、自動化的安全掃描與報告、以及整合式的「學習模組」，讓開發者能更流暢地實踐這套工作流程。\n\n2.  **開發者角色的演進**: 隨著 AI 承擔越來越多的底層編碼工作，人類開發者的角色將更加側重於**高階設計、策略規劃、系統性思考和最終品質的把關**。精通如何引導、管理和驗證 AI 的產出，將成為比編寫單行程式碼更重要的核心技能。\n\n3.  **結構化提示的普及**: `Claude.md` 所代表的「持久性指令」概念，可能會成為未來與 AI 協作的標準模式。開發者將花更多時間去定義專案級別的規則、約束和目標，而不是在每一次互動中重複相同的指令，這將大幅提升人機協作的效率和一致性。",
      "transcript": "Claude code is the most powerful AI coding tool ever made But what if I told you you're using it all wrong in this video? I'll cover the eight tricks. You need to know to become an absolute Claude code savage I promise you'll build ten times faster after watching this video the tricks I'm about to show you or how I personally launched my own $300,000 a year AI app called creator buddy stick with me and you can do the same. Let's get into it So if you haven't yet make sure the link below download Claude code to follow along with me if you're brand spanking new to it It is I promise you the best AI coding tool ever. It lives up to the hype now. Let's get into those eight pro tricks Having the right Claude rules file is gonna make the difference between absolutely terrible code and absolutely epic code So for those who don't know if you create a Claude dot MD file in your project Everything you put in that file will be read by Claude code Every time you send a prompt after working with Claude code for 12 hours a day for months now These are the best seven rules you can have Basically the way these seven rules work is they instruct Claude code to think in tasks? Everything Claude code does it will break into tasks run those tasks by you and make sure you approve of those step-by-step tasks They'll even create a folder that includes every single set of tasks It does for every prompt you give it so that you can look back to see everything Claude code did by forcing Claude code To break down everything it does into tiny little tasks and tiny little building blocks. You're ensuring it makes the best code possible I'm not kidding with these seven rules Claude code hasn't written me a single bug in months So make sure to pause the video Grab the rules from down below in the description and put them in your own Claude MD file if you haven't yet I promise you'll instantly get way better code The next trick I want to talk about is using plan mode correctly Plan mode if used correctly is the most powerful tool inside Claude because it'll make sure you get the results You're looking for every time Claude works So again for those who don't know to go into plan mode you just open up Claude code and you hit shift tab twice And that gets you to plan mode on from here What do you want to make sure you do before having Claude code do anything you want to go into plan mode? Describe exactly what you want Claude to do and then have Claude build that plan for you So for instance, I'm working on this AI automation app and I wanted to build out a to-do list in the app So I describe in detail exactly what I want to build out in plan mode I hit enter and the way Claude code is gonna work instead of writing any code It's gonna build out the plan. You probably already knew that but here's the two tricks You need to know one is you want to overuse plan mode? I found when I just fire from the hip and don't use plan mode It messes up more than it doesn't when I've combined my rule set I showed you earlier and combine that with plan mode before every step Claude code has been flawless for me No errors at all. So before you do anything you need to be using plan mode for every single micro step It might seem like it's taking up a lot of time But you're actually saving a ton of time in the long run And the second thing you want to know about plan mode is which models to use when it comes to plan mode You want to be using opus I use opus for plan mode and then I use sonnet for executing on that plan So what do you want to do is you want to hit slash? Model space and then whatever model you want to use so for planning do slash model opus then hit enter and then for Execution after you've built your plan you want to do slash model sonnet and what this will do is two things Make sure your planning is incredible But also save you a lot of money as long as your plans are really good You don't need opus to do the execution sonnet will do it really well So especially for those in the seventeen dollar a month plan or a hundred dollar a month plan This will allow you to get as many uses as you need throughout the entire month critical you use plan mode correctly The next trick you need to know about is saving your spot with checkpoints So the number one question I get about Claude code is how do I rewind if Claude code messes up? People are used to cursor when you're in cursor and you're using the cursor agent You can easily rewind by clicking on checkpoints in the agent, but that doesn't exist in Claude code You can't rewind to certain checkpoints So the key is using github correctly If you are constantly saving your code to github after every single step You'll be able to easily go back and rewind your code in case Claude ever messes up So here's my decision making tree with github, right? If if Claude writes code and it works and it looks good and it's efficient and all that I immediately commit that to github every single step I'm making like 20 commits a day if Claude messes up. I'll go back to my last commit So I'll rewind that last commit and start over again with Claude code This is how you make up for the lack of checkpoints like cursor agent has is by using github as your checkpoint system If you're a new programmer and you haven't worked github into your workflow yet Make sure you do that sign up for github and start committing your code immediately If you're not familiar with how to do that just ask Claude code to do it for you and it'll work it for you perfectly The next trick I want to teach you about is when to paste in images to Claude code so for those who don't know you actually Can bring in images to Claude code and Claude can see those images and write code based on it I like to use images in two instances one when I want to give Claude Inspiration and two when I'm fixing bugs for instance I'm building out this to-do list app right now and I want to take inspiration from tick tick Which is my favorite to-do list app so if you're on Mac You can hit command shift 4 and then it allows you to screenshot So you just drag it across your screen like that that saves an image and then all you need to do now is take that Image and bring it into Claude code. So what do you want to do? Then is take that screenshot drag it into Claude now, it's in there now You can do something like say hey Claude build me out the UI from the screenshot I just sent you so I said I want to add a to-do list to this app that looks like this I hit enter Claude will take the inspiration screenshot I sent it and start building that out inside the app and you can see right there It's reading the screenshot as we go The second way I like to use screenshots inside Claude code is fixing bugs So if Claude code builds out some code that doesn't look good or the app doesn't look right You can easily screenshot the app or screenshot the error put that in and say hey fix this error or make this look prettier So I use it for inspiration and fixing bad UI and bugs The next tip is very very critical Especially if you're not on the most expensive tier of Claude code and that is using slash clear I use slash clear so much for many different reasons a lot of people when talking to AI or talking to Claude They just keep giving commands for hours and hours and hours. You shouldn't be doing this You should be clearing your context as much as humanly possible. This does two things it reduces Hallucinations by reducing the amount of information you're sending to Claude and two it saves you cost if you have a large Context window and you've been typing for hours and hours and hours to Claude code It's sending all that context to Claude which is taking up a lot of tokens So if you're on the $17 a month plan or the $100 a month plan You can really eat through that quickly if you're not doing slash clear a lot Here's when you do slash clear anytime Claude finishes a decent sized task So for instance, if Claude has completed all the tasks in one of its task files that it wrote for you Then you want to do slash clear. So you want to be using slash clear a lot So a it reduces hallucinations in B. It saves you money The next trip is Hypercritical especially if you've never coded before and that is running security checks The number one issue vibe coders are having right now is that they're shipping insecure code It just isn't built into the AI's yet how to write code that is super secure or goes by security best practices So if you are building an app that you ever plan to ship to the internet one day and have other people use You need to make sure it's secure a lot of vibe coders are having their apps hacked and taken down Because of bad security practices. Here's what I try to remember for everything. I build in Claude code one I start with planning to I do execution and then three is security checks, right? So every time you build a new feature in your app, you're planning then you're building and then you're doing a security check So say Claude just finished building a feature into your app, right? It went through the entire plan and finish the plan You want to make sure every time Claude finishes a chunk of code or a feature? You run this security check that I'm about to show you here and keep in mind all these prompts Put down below as well. So here's the prompt you want to put in every single time Claude finishes a feature Please check through all the code you just wrote and make sure it follows the security best practices Make sure no sensitive information is in the front end and there are no vulnerabilities people can exploit if you run this prompt Every time you build a feature Claude will make sure you have very secure code The biggest mistake people make is they'll put secure information in the front end Whether it's API keys or passwords or things like that This will ensure that all your information is in the back end and you have no vulnerabilities people can exploit again If you're a brand new coder, you must must must do this a thousand times during your coding sessions It's impossible to do this too much again prompt down below. Make sure to pause and grab that and put that into your note file The seventh trick we're gonna get into that's critical to know if you're building a Claude code is earning the code that Claude's Actually building so I strongly believe people who have never written code before in their lives can use Claude code to build Incredible apps that generate them money But I also think it's important that you understand what Claude is building out Even if you've never coded before so I gave you three steps before that I do for every single feature Claude builds out, right? Plan build security while I'm adding a fourth now plan build security learn After every time Claude finishes a feature and make sure it's secure I go in and I give Claude this prompt Please explain the functionality and code you just built out in detail Walk me through what you changed and how it works Act like you're a senior engineer teaching me code and what this does is it helps you? Understand what Claude is building out even better You don't need to know how to code to use Claude code But the more you understand what Claude is building out the better your prompting will become right if you understand all the code And how the data flows through your app? You'll be able to give much better more detailed prompts to Claude on what it is You want it to build out and the better the prompts the better the results you're gonna get So if you want to improve your prompting and you want to improve what Claude builds out You need to make sure you understand what it's building So pause the video take this prompt from down below Save it and use it every time you've done your security check so you can learn what Claude built out It's the last tip I'm gonna give you and honestly This might be my favorite one of them all because it has made my time using Claude code So much more productive and so much better for my mental health is using the time wisely when Claude code is working Here's the challenge with Claude code is it's incredible. It's amazing It is the most powerful AI coding tool ever But it takes a lot of time to build code And I don't know about you when Claude is really working sometimes 15 20 30 minutes at a time I get distracted. I start doom scrolling and I'll find that maybe I watch a YouTube video for two hours While Claude code worked for 20 minutes. It has led to me spending my time so inefficient It's also just straight-up bad for your mental health to be doom scrolling for 80% of the time you're doing things So I came up with the solution So I went to Claude and I gave it this prompt about 30 minutes I went to Claude and I gave it this prompt and I swear to you this prompt has changed everything for me I told Claude when I am coding with AI there are long breaks in between me giving commands to the AI Typically, I spend that time doom scrolling which distracts me and puts me in a bad mental state I'd like to use that time to chat with you to generate new ideas and also reflect on my other ideas and business and content And now what I do as Claude code is working and building me code I come back to this chat and I just say hello to this chat. I say what Claude code is working on I say what I'm thinking about in this AI will just bounce ideas off me help me refocus Help me figure out what the next steps for Claude code should be and generally make that 80% of time Claude code is working way more productive way more efficient and put me in a way better mental state I swear to you. My productivity has gone up 4,000% since using this trick you just got to have discipline You just got to make sure every single time Claude code is completing a task you go to this chat You don't pick up your phone in doom scroll. You don't go to YouTube and watch endless videos You don't go to tick tock and watch brain rot all day. You got to be disciplined You got to make sure every time Claude code is working You come to this chat in this chat only and start bouncing ideas off the AI because this chat I swear to God I've come up with like 30 other ideas for apps that I'm now building out that will eventually start making me money if you're Doom scrolling while Claude code works. You're seriously screwing up I'll have the prompt for this down below as well If you take all the prompts I just gave you all the little tips and tricks and put them into your workflow immediately I promise you you'll build ten times faster and your apps will be ten times higher quality Let me know down there applies which these tricks were your favorite if you learned anything at all Make sure to subscribe make sure to turn on notifications All I do is make banger videos about AI and I'll see you in the next video\n\n",
      "model_used": "gemini-2.5-pro-preview-06-05",
      "processing_time": 137.0251181125641,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T00:54:22.609267",
    "updated_at": "2025-07-07T00:56:39.636665"
  },
  {
    "id": "4XQWKEUkIg9Vdm1r2mB_fQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751822196.0334852,
    "keep_audio": false,
    "model_type": "openai",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "摘要",
      "percentage": 100,
      "message": "生成摘要時發生錯誤: Error code: 400 - {'error': {'message': \"Unsupported parameter: 'max_tokens' is not supported with this model. Use 'max_completion_tokens' instead.\", 'type': 'invalid_request_error', 'param': 'max_tokens', 'code': 'unsupported_parameter'}}",
      "timestamp": 1751822240.077049
    },
    "result": {
      "status": "error",
      "message": "生成摘要時發生錯誤: Error code: 400 - {'error': {'message': \"Unsupported parameter: 'max_tokens' is not supported with this model. Use 'max_completion_tokens' instead.\", 'type': 'invalid_request_error', 'param': 'max_tokens', 'code': 'unsupported_parameter'}}",
      "processing_time": 44.041606187820435,
      "summary": null,
      "model_used": null
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T01:16:36.033498",
    "updated_at": "2025-07-07T01:17:20.077388"
  },
  {
    "id": "FENfJ8jyFYOFFuiUHu1wRg",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751822264.2719831,
    "keep_audio": false,
    "model_type": "openai",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751822327.233461
    },
    "result": {
      "title": "Master Claude Code in 14 Minutes (8 Steps)",
      "summary": "## **主要觀點與核心價值**\n\n影片的核心在於介紹如何高效使用Claude Code這款強大的AI編程工具，通過八個關鍵技巧來提升開發效率和代碼質量。講者分享了他個人成功的經驗，強調了Claude Code的潛力，並指出許多用戶在使用該工具時存在誤區。這些技巧不僅能幫助開發者避免常見錯誤，還能顯著提高開發速度和代碼的可靠性。講者特別強調了Claude Code的規則文件、計劃模式、GitHub的使用、圖像導入、清除命令等功能的正確使用方法，並提供了實際應用的建議。這些技巧的應用不僅能幫助開發者創建出色的應用程式，還能節省開發成本和時間。\n\n---\n\n## **內容大綱**\n\n1. Claude Code的規則文件設定\n2. 計劃模式的正確使用\n3. GitHub作為版本控制工具\n4. 圖像導入的應用場景\n5. 清除命令的使用策略\n6. 理解Claude Code生成的代碼\n7. 提升提示質量的重要性\n\n---\n\n## **關鍵術語與概念**\n\n- **Claude Code**: 一款強大的AI編程工具，能夠自動生成代碼並進行錯誤修復。\n- **規則文件（Claude.md）**: 用於指導Claude Code執行特定任務的配置文件。\n- **計劃模式（Plan Mode）**: 一種功能模式，幫助用戶在編碼前制定詳細計劃。\n- **GitHub**: 一個版本控制平台，用於管理和存儲代碼。\n- **清除命令（/clear）**: 用於重置Claude Code的上下文，以減少錯誤和節省資源。\n\n---\n\n## **重要引述與案例**\n\n> \"Having the right Claude rules file is going to make the difference between absolutely terrible code and absolutely epic code.\"\n\n**分析**: 此引述強調了Claude Code規則文件的重要性，指出其對代碼質量的直接影響。正確配置規則文件可以顯著提高代碼的可靠性和效率。\n\n> \"If you're constantly saving your code to GitHub after every single step, you'll be able to easily go back and rewind your code in case Claude ever messes up.\"\n\n**分析**: 這段話強調了GitHub在版本控制中的重要性，尤其是在使用Claude Code時，GitHub可以作為一種回溯機制，幫助開發者在出錯時快速恢復。\n\n---\n\n## **詳細內容分析**\n\n### **Claude Code的規則文件設定**\n\nClaude Code的規則文件（Claude.md）是用來指導AI如何分解任務並逐步執行的。這種設定能夠確保每個步驟都經過用戶的審核，從而減少錯誤的發生。這種方法的優勢在於它能夠將複雜的編程任務分解為更小的可管理部分，從而提高代碼的質量和可讀性。\n\n### **計劃模式的正確使用**\n\n計劃模式是Claude Code中一個強大的工具，允許用戶在編碼之前制定詳細的計劃。這種方法不僅能夠提高開發效率，還能確保每個步驟都符合用戶的需求。講者建議在每個微步驟之前都使用計劃模式，以避免出錯並節省時間。\n\n### **GitHub作為版本控制工具**\n\n使用GitHub進行版本控制是避免Claude Code錯誤的一種有效方法。通過在每個步驟後提交代碼，用戶可以輕鬆回溯到之前的版本，這對於沒有內建回溯功能的Claude Code尤為重要。這種方法不僅提高了開發的靈活性，還增加了代碼的安全性。\n\n### **圖像導入的應用場景**\n\nClaude Code允許用戶導入圖像作為靈感或錯誤修復的參考。這種功能特別適合於需要視覺參考的應用場景，如UI設計或錯誤調試。通過將圖像導入Claude Code，用戶可以更直觀地指導AI生成符合需求的代碼。\n\n### **清除命令的使用策略**\n\n清除命令（/clear）是管理Claude Code上下文的一種有效方法。通過定期清除上下文，用戶可以減少AI的錯誤率並節省資源。這在長時間的開發過程中特別重要，因為它能夠防止上下文過載導致的錯誤。\n\n---\n\n## **實踐應用與建議**\n\n- **建議1**: 定期更新Claude.md規則文件，以確保代碼質量。\n- **建議2**: 在每個開發步驟中使用計劃模式，避免錯誤發生。\n- **建議3**: 使用GitHub進行版本控制，確保代碼的安全性和可回溯性。\n\n---\n\n## **相關資源與延伸閱讀**\n\n- **Claude Code官方文檔**: 提供詳細的功能介紹和使用指南。\n- **GitHub使用指南**: 幫助新手快速掌握版本控制的基本操作。\n- **AI編程工具比較**: 分析不同AI工具的優勢和劣勢，幫助選擇合適的工具。\n\n---\n\n## **總結與未來展望**\n\nClaude Code作為一款先進的AI編程工具，為開發者提供了強大的功能和靈活的操作方式。通過正確使用規則文件、計劃模式和GitHub等工具，開發者可以顯著提高開發效率和代碼質量。未來，隨著AI技術的進一步發展，Claude Code有望在更多領域中發揮作用，成為開發者不可或缺的助手。隨著AI技術的進步，這類工具將在更廣泛的應用場景中發揮更大的作用，並可能引領編程方式的革新。",
      "transcript": "Claude code is the most powerful AI coding tool ever made. But what if I told you you're using it all wrong? In this video, I'll cover the eight tricks you need to know to become an absolute Claude code savage. I promise you'll build 10 times faster after watching this video. The tricks I'm about to show you are how I personally launched my own $300,000 a year AI app called Creator Buddy. Stick with me and you can do the same. Let's get into it. So if you haven't yet, make sure at the link below, download Claude code to follow along with me. If you're brand spanking new to it, it is, I promise you, the best AI coding tool ever. It lives up to the hype. Now let's get into those eight pro tricks. Having the right Claude rules file is going to make the difference between absolutely terrible code and absolutely epic code. So for those who don't know, if you create a Claude.md file in your project, everything you put in that file will be read by Claude code every time you send a prompt. After working with Claude code for 12 hours a day for months now, these are the best seven rules you can have. Basically the way these seven rules work is they instruct Claude code to think in tasks. Everything Claude code does, it will break into tasks, run those tasks by you, and make sure you approve those step-by-step tasks. They'll even create a folder that includes every single set of tasks it does for every prompt you give it, so that you can look back to see everything Claude code did. By forcing Claude code to break down everything it does into tiny little tasks and tiny little building blocks, you're ensuring it makes the best code possible. I'm not kidding, with these seven rules, Claude code hasn't written me a single bug in months. So make sure to pause the video, grab the rules from down below in the description, and put them in your own Claude.md file if you haven't yet. I promise you'll instantly get way better code. The next trick I want to talk about is using plan mode correctly. Plan mode, if used correctly, is the most powerful tool inside Claude, because it'll make sure you get the results you're looking for every time Claude works. So again, for those who don't know, to go into plan mode, you just open up Claude code and you hit shift tab twice, and that gets you to plan mode on. From here, what you want to make sure you do before having Claude code do anything, you want to go into plan mode, describe exactly what you want Claude to do, and then have Claude build that plan for you. So for instance, I'm working on this AI automation app, and I want it to build out a to-do list in the app. So I describe in detail exactly what I want to build out in plan mode, I hit enter, and the way Claude code is going to work, instead of writing any code, it's going to build out the plan. You probably already knew that, but here's the two tricks you need to know. One is you want to overuse plan mode. I've found when I just fire from the hip and don't use plan mode, it messes up more than it doesn't. When I've combined my rule set I showed you earlier, and combine that with plan mode before every step, Claude code has been flawless for me, no errors at all. So before you do anything, you need to be using plan mode for every single micro step. It might seem like it's taking up a lot of time, but you're actually saving a ton of time in the long run. And the second thing you want to know about plan mode is which models to use. When it comes to plan mode, you want to be using Opus. I use Opus for plan mode, and then I use Sonnet for executing on that plan. So what you want to do is you want to hit slash model space, and then whatever model you want to use. So for planning, do slash model Opus, then hit enter. And then for execution, after you've built your plan, you want to do slash model Sonnet. And what this will do is two things, make sure your planning is incredible, but also save you a lot of money. As long as your plans are really good, you don't need Opus to do the execution. Sonnet will do it really well. So especially for those in the $17 a month plan or $100 a month plan, this will allow you to get as many uses as you need throughout the entire month. Critical use plan mode correctly. The next trick you need to know about is saving your spot with checkpoints. So the number one question I get about Claude code is how do I rewind if Claude code messes up? People are used to cursor. When you're in cursor and you're using the cursor agent, you can easily rewind by clicking on checkpoints in the agent. But that doesn't exist in Claude code. You can't rewind to certain checkpoints. So the key is using GitHub correctly. If you are constantly saving your code to GitHub after every single step, you'll be able to easily go back and rewind your code in case Claude ever messes up. So here's my decision-making tree with GitHub, right? If Claude writes code and it works and it looks good and it's efficient and all that, I immediately commit that to GitHub every single step. I'm making like 20 commits a day. If Claude messes up, I'll go back to my last commit. So I'll rewind to that last commit and start over again with Claude code. This is how you make up for the lack of checkpoints like cursor agent has is by using GitHub as your checkpoint system. If you're a new programmer and you haven't worked GitHub into your workflow yet, make sure you do that. Sign up for GitHub and start committing your code immediately. If you're not familiar with how to do that, just ask Claude code to do it for you and it'll work it for you perfectly. The next trick I wanna teach you about is when to paste in images to Claude code. So for those who don't know, you actually can bring in images to Claude code and Claude can see those images and write code based on it. I like to use images in two instances. One, when I wanna give Claude inspiration and two, when I'm fixing bugs. For instance, I'm building out this to-do list app right now and I want to take inspiration from TickTick, which is my favorite to-do list app. So if you're on Mac, you can hit command shift four and then it allows you to screenshot. So you just drag it across your screen like that. That saves an image. And then all you need to do now is take that image and bring it into Claude code. So what do you wanna do then is take that screenshot, drag it into Claude. Now it's in there. Now you can do something like say, hey, Claude builds me out the UI from the screenshot I just sent you. So I said, I wanna add a to-do list to this app that looks like this. I hit enter, Claude will take the inspiration screenshot I sent it and start building that out inside the app. And you can see right there, it's reading the screenshot as we go. The second way I like to use screenshots inside Claude code is fixing bugs. So if Claude code builds out some code that doesn't look good or the app doesn't look right, you can easily screenshot the app or screenshot the error, put that in and say, hey, fix this error or make this look prettier. So I use it for inspiration and fixing bad UI and bugs. The next tip is very, very critical, especially if you're not on the most expensive tier of Claude code. And that is using slash clear. I use slash clear so much for many different reasons. A lot of people when talking to AI or talking to Claude, they just keep giving commands for hours and hours and hours. You shouldn't be doing this. You should be clearing your context as much as humanly possible. This does two things. It reduces hallucinations by reducing the amount of information you're sending to Claude and two, it saves you cost. If you have a large context window and you've been typing for hours and hours and hours to Claude code, it's sending all that context to Claude, which is taking up a lot of tokens. So if you're on the $17 a month plan or the $100 a month plan, you can really eat through that quickly if you're not doing slash clear a lot. Here's when you do slash clear. Anytime Claude finishes a decent size task. So for instance, if Claude has completed all the tasks in one of its task files that it wrote for you, then you wanna do slash clear. So you wanna be using slash clear a lot. So A, it reduces hallucinations and B, it saves you money. The next trick we're gonna get into that's critical to know if you're building with Claude code is learning the code that Claude's actually building. So I strongly believe people who have never written code before in their lives can use Claude code to build incredible apps that generate them money. But I also think it's important that you understand what Claude is building out even better. You don't need to know how to code to use Claude code, but the more you understand what Claude is building out, the better your prompting will become, right? If you understand all the code and how the data flows through your app, you'll be able to give much better, more detailed prompts to Claude on what it is you want it to build out. And the better the prompts, the better the results you're gonna get. So if you wanna improve your prompting and you wanna improve what Claude builds out, you need to make sure you understand what it's building. So pause the video, take this prompt from down below, save it and use it every time you've done your security check so you can learn what Claude built out. So the last tip I'm gonna give you, and honestly,\n\n",
      "model_used": "gpt-4o",
      "processing_time": 62.958749294281006,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T01:17:44.272000",
    "updated_at": "2025-07-07T01:18:47.233680"
  },
  {
    "id": "a0CIUB91rzJMebFgoKmbIw",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751822975.2433112,
    "keep_audio": false,
    "model_type": "openai",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "摘要",
      "percentage": 100,
      "message": "生成摘要時發生錯誤: Error code: 400 - {'error': {'message': \"Unsupported parameter: 'max_tokens' is not supported with this model. Use 'max_completion_tokens' instead.\", 'type': 'invalid_request_error', 'param': 'max_tokens', 'code': 'unsupported_parameter'}}",
      "timestamp": 1751823021.301735
    },
    "result": {
      "status": "error",
      "message": "生成摘要時發生錯誤: Error code: 400 - {'error': {'message': \"Unsupported parameter: 'max_tokens' is not supported with this model. Use 'max_completion_tokens' instead.\", 'type': 'invalid_request_error', 'param': 'max_tokens', 'code': 'unsupported_parameter'}}",
      "processing_time": 46.05386710166931,
      "summary": null,
      "model_used": null
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T01:29:35.243383",
    "updated_at": "2025-07-07T01:30:21.302078"
  },
  {
    "id": "RDp_YpoYCfW4dFPyBP4spQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751823375.814673,
    "keep_audio": false,
    "model_type": "openai",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751823461.150072
    },
    "result": {
      "title": "Master Claude Code in 14 Minutes (8 Steps)",
      "summary": "## **主要觀點與核心價值**\n\nClaude Code 作為當前最強大的 AI 編程工具，其潛力不僅在於自動生成程式碼，更在於透過**結構化的指令與工作流程**，協助開發者將複雜任務拆解為可管理的微步驟，進而大幅提升生產效率與程式碼品質。影片中作者基於自身透過 Claude Code 年入 30 萬美元的實戰經驗，提出「八大必學技巧」，其中核心價值可歸納為以下幾點：\n\n1. **規則驅動的品質保證**：透過在專案根目錄中建立 `Claude.md` 規則檔，明確告訴 AI「思考任務拆解」、「生成任務清單」、「分段審核」等指令，將複雜邏輯內化為系統化流程，以持續產出低 Bug 的高品質程式碼。\n\n2. **前置計畫驅動的效能提升**：Plan Mode（計畫模式）並非單純的功能開關，而是要求開發者在每個微步驟之前，先撰寫**細緻需求與步驟拆解**，藉助 Opus 建立鎖定目標的周詳計畫，再由 Sonnet 精準執行。此「先計畫、後執行」的模式雖看似多花時間，實則可避免重工並節省長期成本。\n\n3. **版本管理取代重做**：Claude Code 缺少類似 Cursor Agent 的內建檢查點功能，影片建議使用 GitHub 作為**外部檢查點系統**，在每完成一小段任務即提交(commit)，若 AI 發生錯誤可立即回滾，確保開發流程的可追溯性與安全性。\n\n4. **視覺與文字的混合互動**：利用截圖或設計稿作為**視覺參考**，一方面作為 UI/UX 靈感來源，另一方面能精確指出錯誤位置並請 AI 協助修正。此手法突破文字描述的局限，讓 AI 更直觀地理解設計意圖。\n\n5. **上下文管理與成本優化**：透過 `slash clear` 清除聊天上下文，可有效降低 AI 幻覺率並節省 Token 使用量，避免因長期累積內容而導致的回應不一致或過度計費。\n\n6. **安全檢測作為必備步驟**：AI 自動生成的程式碼往往未考慮安全漏洞，為了保護上線後的服務與使用者資料，影片強調在每次功能開發後都要啟動**安全檢測流程**，針對常見漏洞、加密機制與權限控管進行驗證，確保最終產品符合業界安全標準。\n\n整體而言，這些技巧並非單純「教你按什麼按鈕」的教學，而是一整套**規範化工作流程**，把 AI 視為「可交互、可管理的虛擬團隊成員」，強調「計畫—執行—審核—版本控管—安全」的閉環方式。如此一來，不僅能快速打出正確率高的程式碼，也為未來團隊協作、跨專案複用、持續維運打下堅實基礎。未來，隨著 AI 模型能力進一步提升，這套流程極有可能成為 AI 輔助開發的行業標準，並推動更精細化的「自動化 DevOps」與「AI 代碼品保」解決方案。\n\n\n\n---\n## **內容大綱**\n1. 強化預設設定：使用 `Claude.md` 進行規則定制  \n2. 精準規劃：Plan Mode 的深入應用與模型切換  \n3. 版本檢查點：利用 GitHub 實現回滾管理  \n4. 視覺交互：圖像輸入在 UI 參考與錯誤修正中的運用  \n5. 上下文管理：Slash Clear 減少幻覺並節省成本  \n6. 安全機制：每次功能完成後的安全檢測流程\n\n---\n## **關鍵術語與概念**\n- **Claude.md**：存放在專案根目錄的純文字規則檔，定義 AI 行為準則，如分步審核、任務拆解等，可以長期穩定影響 Claude Code 的回應品質。  \n- **Plan Mode**：Claude Code 的「計畫模式」，在執行程式碼生成前，先輸入需求並生成詳細計畫，確保每一步都符合預期，降低後續返工風險。  \n- **Opus & Sonnet**：Claude Code 提供的兩種 AI 模型，Opus 專注於計畫模式中的邏輯拆解與規劃，Sonnet 擅長具體程式碼實現與執行。  \n- **Slash Clear (/clear)**：清除當前對話上下文的指令，常用於大段任務完成後，能有效降低 AI 幻覺率、減少計算資源與 Token 消耗。  \n- **安全檢測**：在每次新功能開發結束後，針對程式碼的安全漏洞、授權驗證、加密傳輸等方面進行自動化審查與測試，確保可投入生產環境。\n\n---\n## **重要引述與案例**\n> \"Claude Code is the most powerful AI coding tool ever made, but what if I told you you're using it all wrong?\"  \n**分析**：影片開場強調大多數使用者未充分發揮工具潛力，點出「使用方式」比「工具本身」更關鍵。隨後將焦點放在流程與方法論，為後續八大技巧奠定基調。\n\n> \"By forcing Claude Code to break down everything it does into tiny little tasks ... you’re ensuring it makes the best code possible.\"  \n**分析**：此段揭示了「任務拆解」的核心原理——透過細小步驟減少 AI 模型一次性輸出錯漏風險，並透過使用者審核確保每個環節無誤。也是整體流程中最具破壞性創新的概念。\n\n---\n## **詳細內容分析**\n\n### **第一部分：強化預設設定 – 使用 Claude.md 進行規則定制**  \n建立 `Claude.md` 規則檔是影片中最基本卻也最關鍵的一步。透過以下七大指令，使用者可鎖定 AI 行為：  \n- 任務拆解(task decomposition)  \n- 逐步審核(step-by-step approval)  \n- 自動建立任務夾(task folders)  \n-…等。  \n\n在技術細節上，`Claude.md` 檔案一經加入專案根目錄，Claude Code 便會在每次對話開始前自動載入，無需手動重複設定。這種**全域且持久**的設定方式，可確保多個功能或模組之間的規則一致性，減少「提醒忘記帶入指令」而導致的錯誤。從實務應用角度來看，開發者只要在專案初始化時就放入經過實戰驗證的規則集，之後無論新加入成員或切換專案，均可複製套用，實現流程標準化。\n\n### **第二部分：精準規劃 – Plan Mode 的深入應用與模型切換**  \n影片中提到，真正讓 Claude Code 發揮威力的關鍵是「過度使用」Plan Mode，並搭配 **Opus**（計畫）與 **Sonnet**（執行）兩種模型。首先，按 Shift+Tab×2 進入 Plan Mode，完整撰寫需求、拆解步驟，並讓 AI 先生成「任務清單」。此舉可避免「直接寫碼 → 結構不清」的常見問題。接著手動切換至 Sonnet 模式，讓其根據計畫執行程式碼生成。  \n\n實務案例：作者開發待辦清單功能時，先用 Opus 產出五個子任務（建立 UI 元件、後端儲存、API 設計、錯誤處理、測試），確認後再用 Sonnet 分別執行。整體流程減少了超過 70% 的返工次數，並節省模型運行費用。\n\n### **第三部分：版本檢查點 – 利用 GitHub 實現回滾管理**  \nClaude Code 本身不支援內建「時間軸檢查點」，易造成錯誤難以追溯。影片建議將每完成一小步就 **commit 到 GitHub**，並撰寫清晰的 commit message，如 “feat: 增加待辦清單 UI 結構”。如此一來，若 AI 生成的程式碼有缺陷，可立即回到前一個穩定版本並繼續操作。  \n\n透過這種方式，將「AI 對話紀錄」與「程式碼版本」分層管理，形成「對話–程式碼–版本」三維度追蹤。對團隊協作而言，其他成員也可查看歷史 commit 及對應的 AI 任務檔，迅速了解專案進度並參與審核。\n\n### **第四部分：視覺交互 – 圖像輸入在 UI 參考與錯誤修正中的運用**  \n文字描述無法完全傳達 UI 細節，因此影片示範透過螢幕截圖 (macOS Command-Shift-4) 或設計稿，直接拖入 Claude Code 聊天視窗，讓 AI「看見」畫面後再生成程式碼。  \n\n- **靈感來源**：將 TickTick 等現成產品的畫面作為範本，請 AI 重現相似佈局。  \n- **錯誤修正**：將出現錯誤的 UI 畫面或錯誤訊息截圖，要求 Claude 分析並提出修復建議。  \n\n此舉讓文字與視覺結合，減少溝通歧義並加快迭代速度，特別適用於前端開發或需要精細介面調整的專案。\n\n### **第五部分：上下文管理 – Slash Clear 減少幻覺並節省成本**  \n長時間累積對話上下文會讓 Claude Code 一直攜帶過去所有信息，導致生成內容品質下降（幻覺）且 Token 消耗增多。影片建議在每完成一個**任務檔（task file）**後，立即輸入 `/clear`，清除上下文，以獲得**精簡且正確**的後續回應。  \n\n- **減少幻覺**：新的指令不受先前雜訊干擾。  \n- **降低成本**：減少無謂的 Token 傳送，特別對於 $17 或 $100 美元訂閱方案的使用者尤為重要。\n\n### **第六部分：安全機制 – 每次功能完成後的安全檢測流程**  \nAI 生成程式碼常忽略安全性，易造成漏洞。影片提出「計畫→執行→安全檢測」三步驟管線：  \n1. Feature Plan：列出可能的安全風險（SQL 注入、XSS、權限繞過等）。  \n2. Code Generation：由 Sonnet 完成程式碼。  \n3. Security Audit：使用 Claude Code 或專門工具（如 OWASP ZAP）掃描程式碼，並請 Claude 分析安全漏洞、建議改進。  \n\n這套流程能在開發初期即辨識並修補安全缺陷，降低上線後被攻擊的風險，保障產品與使用者資料安全。\n\n---\n## **實踐應用與建議**\n- 建議1：在團隊專案初始化階段即規劃並建立共享的 `Claude.md` 規則庫，並透過 Git 進行版本管理，確保所有成員使用一致的 AI 行為規範。  \n- 建議2：將 Plan Mode 規劃結果以文件形式輸出，作為 Sprint Backlog 或 Issue 追蹤來源，結合敏捷開發流程，提升跨職能團隊協作效率。  \n- 建議3：設計自動化 Pipeline，在 CI/CD 流程中整合安全檢測步驟，結合 OWASP、Snyk 等工具，並在 AI 生成程式碼階段同時呼叫安全審查，打造「AI + DevSecOps」的協作模式。\n\n---\n## **相關資源與延伸閱讀**\n- **Claude 官方文檔**：深入了解 Plan Mode、模型切換與參數設定，官方示範和最佳實踐。  \n- **GitHub Actions 教程**：學習如何自動化 commit、回滾與 CI/CD 流程，建立穩定可靠的版本管理體系。  \n- **OWASP Top 10**：掌握常見 Web 安全風險並配合 AI 安全檢測，確保開發出符合業界標準的安全程式碼。\n\n---\n## **總結與未來展望**\n\n影片透過「規則驅動—計畫驅動—版本管理—視覺互動—上下文管理—安全檢測」的六大核心流程，提出了一套完整的 Claude Code 開發方法論，強調**系統化、可複用、可追溯**。這不僅讓開發者能在短時間內生成高品質程式碼、快速迭代，也為團隊協作與專案管理建立了嚴謹標準。  \n\n未來，隨著 AI 模型不斷進化，類似的工作流程將可能融入更多自動化工具，例如自動化測試、性能優化、甚至是持續監控與預警系統，形成覆蓋整個 DevOps 生命週期的「AI 代碼生產鏈」。同時，如何在自動化與安全之間取得平衡、如何進一步降低人為審核成本，將成為下一波技術與管理創新的焦點，並推動整個軟體開發行業邁向「AI 原生」時代。",
      "transcript": "Claude Code is the most powerful AI coding tool ever made, but what if I told you you're using it all wrong? In this video, I'll cover the eight tricks you need to know to become an absolute Claude Code savage. I promise you'll build 10 times faster after watching this video. The tricks I'm about to show you are how I personally launched my own $300,000 a year AI app called CreatorBuddy. Stick with me and you can do the same. Let's get into it. So if you haven't yet, make sure at the link below, download Claude Code to follow along with me. If you're brand spanking new to it, it is, I promise you, the best AI coding tool ever. It lives up to the hype. Now let's get into those eight pro tricks. Having the right Claude rules file is gonna make the difference between absolutely terrible code and absolutely epic code. So for those who don't know, if you create a Claude.md file in your project, everything you put in that file will be read by Claude Code every time you send a prompt. After working with Claude Code for 12 hours a day for months now, these are the best seven rules you can have. Basically, the way these seven rules work is they instruct Claude Code to think in tasks. Everything Claude Code does, it will break into tasks, run those tasks by you, and make sure you approve those step-by-step tasks. They'll even create a folder that includes every single set of tasks it does for every prompt you give it so that you can look back to see everything Claude Code did. By forcing Claude Code to break down everything it does into tiny little tasks and tiny little building blocks, you're ensuring it makes the best code possible. I'm not kidding, with these seven rules, Claude Code hasn't written me a single bug in months. So make sure to pause the video, grab the rules from down below in the description, and put them in your own Claude MD file if you haven't yet. I promise you'll instantly get way better code. The next trick I wanna talk about is using plan mode correctly. Plan mode, if used correctly, is the most powerful tool inside Claude, because it'll make sure you get the results you're looking for every time Claude works. So again, for those who don't know, to go into plan mode, you just open up Claude Code, and you hit shift tab twice, and that gets you to plan mode on. From here, what you wanna make sure you do before having Claude Code do anything, you wanna go into plan mode, describe exactly what you want Claude to do, and then have Claude build that plan for you. So for instance, I'm working on this AI automation app, and I wanted to build out a to-do list in the app. So I describe in detail exactly what I wanna build out in plan mode, I hit enter, and the way Claude Code is gonna work, instead of writing any code, it's gonna build out the plan. You've probably already knew that, but here's the two tricks you need to know. One is you want to overuse plan mode. I've found when I just fire from the hip and don't use plan mode, it messes up more than it doesn't. When I've combined my rule set I showed you earlier and combine that with plan mode before every step, Claude Code has been flawless for me, no errors at all. So before you do anything, you need to be using plan mode for every single micro step. It might seem like it's taking up a lot of time, but you're actually saving a ton of time in the long run. And the second thing you wanna know about plan mode is which models to use. When it comes to plan mode, you want to be using Opus. I use Opus for plan mode, and then I use Sonnet for executing on that plan. So what you wanna do is you wanna hit slash model space, and then whatever model you wanna use. So for planning, do slash model Opus, then hit enter. And then for execution, after you've built your plan, you wanna do slash model Sonnet. And what this will do is two things. Make sure your planning is incredible, but also save you a lot of money. As long as your plans are really good, you don't need Opus to do the execution. Sonnet will do it really well. So especially for those on the $17 a month plan or $100 a month plan, this will allow you to get as many uses as you need throughout the entire month. Critical you use plan mode correctly. The next trick you need to know about is saving your spot with checkpoints. So the number one question I get about Claude Code is how do I rewind if Claude Code messes up? People are used to Cursor. When you're in Cursor and you're using the Cursor agent, you can easily rewind by clicking on checkpoints in the agent, but that doesn't exist in Claude Code. You can't rewind to certain checkpoints. So the key is using GitHub correctly. If you are constantly saving your code to GitHub after every single step, you'll be able to easily go back and rewind your code in case Claude ever messes up. So here's my decision-making tree with GitHub, right? If Claude writes code and it works and it looks good and it's efficient and all that, I immediately commit that to GitHub, every single step. I'm making like 20 commits a day. If Claude messes up, I'll go back to my last commit. So I'll rewind to that last commit and start over again with Claude Code. This is how you make up for the lack of checkpoints like Cursor Agent has is by using GitHub as your checkpoint system. If you're a new programmer and you haven't worked GitHub into your workflow yet, make sure you do that. Sign up for GitHub and start committing your code immediately. If you're not familiar with how to do that, just ask Claude Code to do it for you and it'll work it for you perfectly. The next trick I wanna teach you about is when to paste in images to Claude Code. So for those who don't know, you actually can bring in images to Claude Code and Claude can see those images and write code based on it. I like to use images in two instances. One, when I wanna give Claude inspiration and two, when I'm fixing bugs. For instance, I'm building out this to-do list app right now and I want to take inspiration from TickTick, which is my favorite to-do list app. So if you're on Mac, you can hit Command-Shift-4 and then it allows you to screenshot. So you just drag it across your screen like that. That saves an image and then all you need to do now is take that image and bring it into Claude Code. So what do you wanna do then is take that screenshot, drag it into Claude, now it's in there. Now you can do something like say, hey, Claude, build me out the UI from the screenshot I just sent you. So I said, I wanna add a to-do list to this app that looks like this. I hit Enter, Claude will take the inspiration screenshot I sent it and start building that out inside the app. And you can see right there, it's reading the screenshot as we go. The second way I like to use screenshots inside Claude Code is fixing bugs. So if Claude Code builds out some code that doesn't look good or the app doesn't look right, you can easily screenshot the app or screenshot the error, put that in and say, hey, fix this error or make this look prettier. So I use it for inspiration and fixing bad UI and bugs. The next tip is very, very critical, especially if you're not on the most expensive tier of Claude Code, and that is using slash clear. I use slash clear so much for many different reasons. A lot of people when talking to AI or talking to Claude, they just keep giving commands for hours and hours and hours. You shouldn't be doing this, you should be clearing your context as much as humanly possible. This does two things. It reduces hallucinations by reducing the amount of information you're sending to Claude, and two, it saves you cost. If you have a large context window and you've been typing for hours and hours and hours to Claude Code, it's sending all that context to Claude, which is taking up a lot of tokens. So if you're on the $17 a month plan or the $100 a month plan, you can really eat through that quickly if you're not doing slash clear a lot. Here's when you do slash clear. Anytime Claude finishes a decent size task. So for instance, if Claude has completed all the tasks in one of its task files that it wrote for you, then you wanna do slash clear. So you wanna be using slash clear a lot. So A, it reduces hallucinations, and B, it saves you money. The next trick you need to know about is running security checks. The number one issue vibe coders are having right now is that they're shipping insecure code. It just isn't built into the AIs yet. How to write code that is super secure or goes by security best practices. So if you are building an app that you ever plan to ship to the internet one day and have other people use, you need to make sure it's secure. A lot of vibe coders are having their apps hacked and taken down because of bad security practices. Here's what I try to remember for everything I build in Claude code. One, I start with planning. Two, I do execution. And then three is security checks, right? So every time you build a new feature in your app, you're planning, then you're building, and then you're doing a security check. So say Claude just finished building a feature into your app, right? It went through the entire plan and finished the plan. You wanna make sure every time Claude finishes a chunk of code or a feature, you run this security check that I'm about to show you here. And keep in mind, all these prompts I'll put down\n\n",
      "model_used": "o4-mini",
      "processing_time": 85.33168196678162,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T01:36:15.814710",
    "updated_at": "2025-07-07T01:37:41.150175"
  },
  {
    "id": "qkW-WdGukeuGjluWsPYFEw",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=cjW6ofe7AY4",
    "timestamp": 1751825142.297486,
    "keep_audio": false,
    "model_type": "openai",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751825213.637698
    },
    "result": {
      "title": "Master Claude Code in 14 Minutes (8 Steps)",
      "summary": "## **主要觀點與核心價值**\n\n本影片以「Master Claude Code in 14 Minutes (8 Steps)」為題，揭示如何透過八個實用技巧，徹底優化並加速使用 Claude Code 的開發流程。作者從自身以 Claude Code 年入 30 萬美元的 AI 應用「Creator Buddy」經驗出發，強調**系統化規則檔**（Claude.md）、**計畫模式**（Plan Mode）、**模型切換**、**版本控制檢查點**、**截圖輔助**、**上下文清除**與**程式碼學習**等關鍵方法，能讓使用者以更可靠、可重複且高效的方式生成無錯程式。  \n核心價值在於：  \n- 徹底解構 AI 輔助程式開發的最佳實踐，打造「**微任務拆解**」與「**步驟審核**」機制，降低錯誤率，確保每行程式碼皆經過審核。  \n- 強化**流程可控**與**版本追蹤**，藉由 GitHub 作為虛擬檢查點，讓開發者能隨時回溯並修正偏差。  \n- 運用**多模組策略**與**截圖輸入**，同時兼顧規劃精準度與執行成本，節省金流並提升生產效率。  \n- 督促開發者深入理解 AI 所生成的程式，透過「反向學習」強化今後的提示品質，並為未來 AI 生態演進培養專業度。  \n整體而言，本影片提供了從技術細節到實務操作的全方位策略，對於渴望在 AI 編碼領域建立系統化方法論的開發者，具有高度參考價值與啟發意義。\n\n---\n## **內容大綱**\n1. 設定 Claude.md 規則檔  \n2. 正確使用計畫模式（Plan Mode）  \n3. 模型切換：Opus 與 Sonnet  \n4. 使用 GitHub 作為檢查點  \n5. 截圖輔助：UI 靈感與除錯  \n6. 透過 /clear 清除上下文  \n7. 精進程式碼理解與反向學習  \n\n---\n## **關鍵術語與概念**\n- **Claude.md**：放置在專案根目錄的純文字規則檔，內含一套指令與流程，供 Claude Code 每次執行 Prompt 時自動讀取並套用。  \n- **計畫模式（Plan Mode）**：Claude Code 的分段規劃功能，讓 AI 在正式撰寫程式前先生成詳細步驟，以確保開發方向與成果可控。  \n- **模型切換（Opus/Sonnet）**：在 Plan Mode 使用高階模型 Opus 進行規劃，再以輕量模型 Sonnet 執行編碼，平衡成本與效能。  \n- **檢查點（Checkpoint）**：藉由 GitHub Commit 取代 AI 開發環境的回溯機制，確保每一微小改動皆有版本紀錄，可隨時回滾。  \n- **上下文清除（/clear）**：清除 Claude Code 的對話歷史和 Token 使用，降低幻覺率（hallucination）並節省費用。\n\n---\n## **重要引述與案例**\n> \"Claude Code is the most powerful AI coding tool ever made. But what if I told you you're using it all wrong?\"  \n**分析**：作者一開始便反轉既有印象，指出「強大不代表易用」，強調若不搭配系統化流程與規則，使用者將無法充分發揮工具效能，甚至導致錯誤頻傳。\n\n> \"By forcing Claude Code to break down everything it does into tiny little tasks and tiny little building blocks, you're ensuring it makes the best code possible.\"  \n**分析**：此段落凸顯了「微任務拆解」的核心原理。將複雜需求拆成最小可執行單元，不僅可透過人工審核把關，也能進一步追蹤與調整，提高可靠度並降低偵錯成本。\n\n---\n## **詳細內容分析**\n\n### **設定 Claude.md 規則檔**\n作者建議在專案根目錄創建 `Claude.md` 文件，內含七大核心規則，命令 Claude Code 將每次輸入分解為微任務並逐步呈現執行結果。這種做法類似把 AI 預設心智模型「重設」為任務導向，並強迫每個步驟都經過使用者批准。技術細節包括：自動生成任務資料夾、記錄每次 Prompt 的輸出、要求人工逐項確認。此方式有效降低合併錯誤、重複程式碼或邏輯漏洞，並強化可追溯性。\n\n### **正確使用計畫模式（Plan Mode）**\nPlan Mode 提供「先規劃後執行」的工作流程，避免 AI 即刻輸出不符合需求的程式。使用方法為：在編輯視窗按 Shift+Tab 兩次進入計劃狀態，描述欲實現功能後，Claude 生成步驟清單。作者建議**過度使用計畫模式**，在每個微步驟前都先規劃，雖初期看似耗時，但長遠可節約大量錯誤排查時間，顯著提升開發效率。\n\n### **模型切換：Opus 與 Sonnet**\n影片指出不同模型專精不同任務：Opus 在「計劃」階段具備更強的語言理解與邏輯拆解能力，而 Sonnet 則在「執行」編碼時更為輕量且經濟。實作細節：  \n```  \n/ model Opus   # 計畫階段  \n/ model Sonnet # 編碼階段  \n```  \n此二階段切換策略兼顧執行品質與成本管理，特別適合月費 $17 或 $100 的方案，用戶能在不額外升級的情況下享有最佳性價比。\n\n### **使用 GitHub 作為檢查點**\n因 Claude Code 尚未原生提供類似 Cursor 檢查點的回滾機制，作者建議將每次成功生成的程式碼「即刻 Commit 到 GitHub」，且每日進行 20 次以上提交。若之後 AI 輸出失誤，只需回到最近一次正常版本，即可迅速恢復並重新執行。此策略將版本控制從單一 IDE 延伸至協作平台，提升容錯率與追蹤歷程的便利性。\n\n### **截圖輔助：UI 靈感與除錯**\nClaude Code 支援將圖片拉入對話介面。作者在兩個應用場景中特別說明：  \n1. **UI 靈感**：截圖競品（TickTick）介面，並要求 Claude 根據視覺樣式建構前端。  \n2. **錯誤除錯**：截取執行畫面或錯誤訊息，讓 AI 分析並修正樣式或程式邏輯。  \n此方法將「視覺範本」與「錯誤現場」直接提供給 AI，縮短溝通成本並提升修正準確度。\n\n### **透過 /clear 清除上下文**\n持續的對話會累積大量上下文與 Token 使用，導致幻覺率上升、成本劇增。使用 `/clear` 可在每完成一個較大任務集後清空現有對話歷史，降低 AI 干擾並節省流量費用。作者建議在 Claude 完成每份任務檔案後立即執行此命令，以保持模型最佳運作狀態。\n\n### **精進程式碼理解與反向學習**\n即便不熟悉程式的初學者，也能利用 Claude Code 產出完整應用，但唯有深入了解其輸出結構與資料流動，才能不斷優化提示語。影片中提供專用 Prompt，引導使用者每次完成任務後請 Claude 解釋程式細節，透過「反向學習」加深對程式結構的認識，進而提升未來 Prompt 精度與開發效率。\n\n---\n## **實踐應用與建議**\n- **建議1**：立即在現有專案新增 `Claude.md`，並導入推薦七大規則，將 AI 輸出標準化。  \n- **建議2**：每日開發時將計畫模式與模型切換（Opus→Sonnet）結合，強制性在每步驟規劃後再執行程式。  \n- **建議3**：與團隊建立 GitHub Commit 規範，每完成一個子任務就提交一次，以便隨時回溯並保護重要里程碑。\n\n---\n## **相關資源與延伸閱讀**\n- **Claude 官方文件**：詳細說明計畫模式與模型切換指令。  \n- **GitHub Flow 教學**：介紹分支管理與檢查點提交最佳實踐。  \n- **Prompt Engineering 入門**：涵蓋如何撰寫高效 Prompt 以提升 AI 編碼品質。\n\n---\n## **總結與未來展望**\n本影片從實務操作角度，結合 Claude Code 的各種功能，提供了一套「系統化」、「可追溯」且「經濟高效」的 AI 編碼流程。透過規則檔、計畫模式、模型切換、版本控制、截圖輔助、上下文清除與反向學習，使用者能大幅降低錯誤率、節省成本，同時在不斷迭代中提升提示與程式理解能力。未來，隨著 AI 模型進一步強化多模組協同與原生回溯機制，這套方法論可望演變為標準化開發框架，驅動更多開發者在 AI 助力下加速創新。",
      "transcript": "Claude Code is the most powerful AI coding tool ever made. But what if I told you you're using it all wrong? In this video, I'll cover the eight tricks you need to know to become an absolute Claude Code savage. I promise you'll build 10 times faster after watching this video. The tricks I'm about to show you are how I personally launched my own $300,000 a year AI app called Creator Buddy. Stick with me and you can do the same. Let's get into it. So if you haven't yet, make sure at the link below, download Claude Code to follow along with me. If you're brand spanking new to it, it is, I promise you, the best AI coding tool ever. It lives up to the hype. Now let's get into those eight pro tricks. Having the right Claude rules file is going to make the difference between absolutely terrible code and absolutely epic code. So for those who don't know, if you create a Claude.md file in your project, everything you put in that file will be read by Claude Code every time you send a prompt. After working with Claude Code for 12 hours a day for months now, these are the best seven rules you can have. Basically the way these seven rules work is they instruct Claude Code to think in tasks. Everything Claude Code does, it will break into tasks, run those tasks by you, and make sure you approve those step-by-step tasks. They'll even create a folder that includes every single set of tasks it does for every prompt you give it, so that you can look back to see everything Claude Code did. By forcing Claude Code to break down everything it does into tiny little tasks and tiny little building blocks, you're ensuring it makes the best code possible. I'm not kidding, with these seven rules, Claude Code hasn't written me a single bug in months. So make sure to pause the video, grab the rules from down below in the description, and put them in your own Claude.md file if you haven't yet. I promise you'll instantly get way better code. The next trick I want to talk about is using plan mode correctly. Plan mode, if used correctly, is the most powerful tool inside Claude, because it'll make sure you get the results you're looking for every time Claude works. So again, for those who don't know, to go into plan mode, you just open up Claude Code and you hit shift tab twice, and that gets you to plan mode on. From here, what you want to make sure you do before having Claude Code do anything, you want to go into plan mode, describe exactly what you want Claude to do, and then have Claude build that plan for you. So for instance, I'm working on this AI automation app, and I wanted to build out a to-do list in the app. So I describe in detail exactly what I want to build out in plan mode. I hit enter, and the way Claude Code is going to work, instead of writing any code, it's going to build out the plan. You probably already knew that, but here's the two tricks you need to know. One is you want to overuse plan mode. I've found when I just fire from the hip and don't use plan mode, it messes up more than it doesn't. When I've combined my rule set I showed you earlier, and combine that with plan mode before every step, Claude Code has been flawless for me, no errors at all. So before you do anything, you need to be using plan mode for every single micro step. It might seem like it's taking up a lot of time, but you're actually saving a ton of time in the long run. And the second thing you want to know about plan mode is which models to use. When it comes to plan mode, you want to be using Opus. I use Opus for plan mode, and then I use Sonnet for executing on that plan. So what you want to do is you want to hit slash model, space, and then whatever model you want to use. So for planning, do slash model Opus, then hit enter. And then for execution, after you've built your plan, you want to do slash model Sonnet. And what this will do is two things, make sure your planning is incredible, but also save you a lot of money. As long as your plans are really good, you don't need Opus to do the execution. Sonnet will do it really well. So especially for those on the $17 a month plan or $100 a month plan, this will allow you to get as many uses as you need throughout the entire month. Critical you use plan mode correctly. The next trick you need to know about is saving your spot with checkpoints. So the number one question I get about Claude Code is how do I rewind if Claude Code messes up? People are used to cursor. When you're in cursor and you're using the cursor agent, you can easily rewind by clicking on checkpoints in the agent. But that doesn't exist in Claude Code. You can't rewind to certain checkpoints. So the key is using GitHub correctly. If you are constantly saving your code to GitHub after every single step, you'll be able to easily go back and rewind your code in case Claude ever messes up. So here's my decision-making tree with GitHub, right? If Claude writes code and it works and it looks good and it's efficient and all that, I immediately commit that to GitHub. Every single step. I'm making like 20 commits a day. If Claude messes up, I'll go back to my last commit. So I'll rewind to that last commit and start over again with Claude Code. This is how you make up for the lack of checkpoints like cursor agent has is by using GitHub as your checkpoint system. If you're a new programmer and you haven't worked GitHub into your workflow yet, make sure you do that. Sign up for GitHub and start committing your code immediately. If you're not familiar with how to do that, just ask Claude Code to do it for you and it'll work it for you perfectly. The next trick I want to teach you about is when to paste in images to Claude Code. So for those who don't know, you actually can bring in images to Claude Code and Claude can see those images and write code based on it. I like to use images in two instances. One, when I want to give Claude inspiration and two, when I'm fixing bugs. For instance, I'm building out this to-do list app right now and I want to take inspiration from TickTick, which is my favorite to-do list app. So if you're on Mac, you can hit Command Shift 4 and then it allows you to screenshot. So you just drag it across your screen like that. That saves an image and then all you need to do now is take that image and bring it into Claude Code. So what do you want to do then is take that screenshot, drag it into Claude. Now it's in there. Now you can do something like say, hey Claude, build me out the UI from the screenshot I just sent you. So I said, I want to add a to-do list to this app that looks like this. I hit enter. Claude will take the inspiration screenshot I sent it and start building that out inside the app. And you can see right there, it's reading the screenshot as we go. The second way I like to use screenshots inside Claude Code is fixing bugs. So if Claude Code builds out some code that doesn't look good or the app doesn't look right, you can easily screenshot the app or screenshot the error, put that in and say, hey, fix this error or make this look prettier. So I use it for inspiration and fixing bad UI and bugs. The next tip is very, very critical, especially if you're not on the most expensive tier of Claude Code, and that is using slash clear. I use slash clear so much for many different reasons. A lot of people when talking to AI or talking to Claude, they just keep giving commands for hours and hours and hours. You shouldn't be doing this. You should be clearing your context as much as humanly possible. This does two things. It reduces hallucinations by reducing the amount of information you're sending to Claude and two, it saves you cost. If you have a large context window and you've been typing for hours and hours and hours to Claude Code, it's sending all that context to Claude, which is taking up a lot of tokens. So if you're on the $17 a month plan or the $100 a month plan, you can really eat through that quickly if you're not doing slash clear a lot. Here's when you do slash clear. Anytime Claude finishes a decent sized task. So for instance, if Claude has completed all the tasks in one of its task files that it wrote for you, then you want to do slash clear. So you want to be using slash clear a lot. So A, it reduces hallucinations and B, it saves you money. The next trick we're gonna get into that's critical to know if you're building with Claude Code is earning the code that Claude's actually building. So I strongly believe people who have never written code before in their lives can use Claude Code to build incredible apps that generate them money. But I also think it's important that you understand what Claude is building out even better. You don't need to know how to code to use Claude Code, but the more you understand what Claude is building out, the better your prompting will become, right? If you understand all the code and how the data flows through your app, you'll be able to give much better, more detailed prompts to Claude on what it is you want it to build out. And the better the prompts, the better the results you're gonna get. So if you wanna improve your prompting and you wanna improve what Claude builds out, you need to make sure you understand what it's building. So pause the video, take this prompt from down below, save it and use it every time you've done your security check so you can learn what Claude built out. This last tip I'm\n\n",
      "model_used": "o4-mini",
      "processing_time": 71.33837008476257,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T02:05:42.297513",
    "updated_at": "2025-07-07T02:06:53.637901"
  },
  {
    "id": "K6XacUD0I24XER6rNcmVeA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=3PdorDOn6xI",
    "timestamp": 1751825457.692267,
    "keep_audio": false,
    "model_type": "auto",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751825528.839354
    },
    "result": {
      "title": "This Claude Code Workflow Changes EVERYTHING",
      "summary": "## **主要觀點與核心價值**\n\n影片的核心在於展示如何利用ClaudeCode這一強大的AI工具來加速應用程式的開發過程。講者介紹了一個創新的工作流程，通過結合ClaudeCode作為資深開發者與多個AI代理作為實習生，來協同完成開發任務。這種方法不僅提升了開發速度，還大大增加了生產力。核心價值在於利用AI技術的協同效應，將開發過程模組化、分工化，從而實現更高效的軟體開發。這一流程的創新之處在於將AI視為不同角色的開發者，從而模擬出一個完整的開發團隊，這不僅降低了人力成本，也為開發者提供了一種全新的工作方式。\n\n---\n\n## **內容大綱**\n1. **ClaudeCode作為資深開發者**\n2. **AI代理實習生的角色與功能**\n3. **應用程式的開發過程**\n4. **安全性與行銷的AI支持**\n5. **CEO角色的引入與管理**\n\n---\n\n## **關鍵術語與概念**\n- **ClaudeCode**: 一種強大的AI編碼工具，能夠作為資深開發者來完成主要的開發任務。\n- **Cursor**: 一個開發環境，支持ClaudeCode的運行，並能夠管理多個AI代理。\n- **AI代理**: 自動化的AI角色，模擬實習生來完成特定的開發任務。\n- **3JS**: 一個JavaScript的3D框架，用於構建3D世界。\n- **OpenAI API**: 提供AI功能的接口，用於實現與虛擬角色的互動。\n\n---\n\n## **重要引述與案例**\n> \"ClaudeCode is the most powerful AI coding tool ever made.\"\n\n**分析**: 這句話強調了ClaudeCode的強大功能，作為影片的開場，設置了觀眾對於工具能力的高期待，並引出後續的工作流程展示。\n\n> \"We're going to utilize brand new functionality inside Cursor to start spinning up intern agents.\"\n\n**分析**: 此引述揭示了工作流程的核心創新，即利用Cursor環境來管理多個AI代理，這種方法突破了傳統的單一AI工具使用方式，實現了多任務並行處理。\n\n---\n\n## **詳細內容分析**\n\n### **ClaudeCode作為資深開發者**\nClaudeCode在這個工作流程中被設計為資深開發者，負責應用程式的主要架構和核心功能的開發。這一角色的設置使得開發者能夠專注於高層次的設計和決策，而將具體的編碼工作交給AI來完成。這種方法不僅提高了開發效率，還確保了代碼的質量和一致性。\n\n### **AI代理實習生的角色與功能**\nAI代理被設計為實習生，負責完成小型且具體的任務，如3D裝飾、模型選擇器的設置等。這些代理的引入使得開發過程可以被細分為多個獨立的任務，並行處理，從而大幅度提高了開發速度。這種分工方式模擬了真實的開發團隊運作模式。\n\n### **應用程式的開發過程**\n影片中展示的應用程式是一個3D世界，使用3JS框架構建，並集成了OpenAI API以實現與虛擬角色的互動。這一過程展示了如何利用ClaudeCode和AI代理來快速構建一個具有複雜功能的應用程式，並強調了AI在開發過程中的協同作用。\n\n### **安全性與行銷的AI支持**\n在開發過程中，安全性和行銷也是不可忽視的部分。影片中設置了專門的AI代理來負責這些領域，確保應用程式的安全性和市場推廣策略的有效性。這種全方位的AI支持展示了AI技術在不同領域的應用潛力。\n\n### **CEO角色的引入與管理**\n最後，影片介紹了如何引入一個超智能的CEO角色，負責管理整個開發過程中的AI代理。這一角色的設置模擬了企業管理層的決策功能，通過協調不同的AI代理來實現整體目標，這種方法進一步提升了開發效率和管理水平。\n\n---\n\n## **實踐應用與建議**\n- **建議1**: 在開發大型應用程式時，考慮使用AI工具來分擔部分開發任務，從而提高效率。\n- **建議2**: 利用AI代理來完成重複性和小型任務，讓開發者能夠專注於更具創造性的工作。\n- **建議3**: 在開發過程中引入AI管理角色，協調不同AI工具的運作，以實現更高效的團隊合作。\n\n---\n\n## **相關資源與延伸閱讀**\n- **ClaudeCode官方文檔**: 提供詳細的功能介紹和使用指南。\n- **Cursor開發環境**: 支持多AI代理的開發環境，適合進行複雜應用的開發。\n- **3JS框架指南**: 介紹如何使用3JS來構建3D應用程式的資源。\n\n---\n\n## **總結與未來展望**\n影片展示了一種創新的AI協同開發流程，通過將ClaudeCode作為資深開發者和多個AI代理作為實習生，實現了高效的應用程式開發。這種方法不僅提高了開發速度，還展示了AI技術在軟體開發中的巨大潛力。未來，隨著AI技術的進一步發展，這種協同開發模式可能會成為主流，為軟體開發帶來更多的創新和變革。開發者應該積極探索和應用這些新技術，以保持競爭力並推動行業進步。",
      "transcript": "Everyone knows ClaudeCode is the most powerful AI coding tool ever made, but what if I told you there's a secret workflow I discovered that will help you build money printing apps ten times faster? In this video, I'm going to go over that workflow step by step, and if you stick with me until the end, I personally guarantee you, you'll be building significantly faster with ClaudeCode. Let's get into it. So this right here is the gist of the top secret workflow I'm going to be showing you in this video. Basically what we're going to be doing is spinning up a bunch of AI agents with ClaudeCode that are going to be working with us to build our apps significantly faster than if you were just using ClaudeCode. The first thing I'm going to do is show you how we're going to use ClaudeCode as a senior developer for our app. Then I'm going to show you how we're going to spin up a bunch of interns to do small little tasks for us while ClaudeCode is working. And as all those developers are going and building for us, I'm going to show you how we'll spin up a ultra smart CEO that's going to be running our business for us and orchestrating all the AI agents as we go. I promise every step of this is about to blow your mind. So let's start with our senior developer who will be building the main part of our app for us. What we're going to do is we're going to open up ClaudeCode inside a cursor. Cursor is free. Make sure to get that. And then ClaudeCode. I'll also have the link down below if you don't have that yet, which you're crazy if you don't have that yet. We're going to open this up in cursor. So once you have your terminal open in cursor, make sure you type in Claude after you've gotten ClaudeCode installed. That will open up ClaudeCode and we're good to start going with our senior developer. So ClaudeCode in this workflow is going to be our senior developer that will be scaffolding out our app. So we start here before we start hiring our interns to do little tiny tasks. So let's start building out our app with ClaudeCode. What we're going to build in this video is a 3D world where we'll have AR avatars we can talk to. So as our senior developer, ClaudeCode will go scaffold out our app, build out all the main functionality, and then we'll move on to our interns after to start building on top of that. So here's the prompt I put in to build this app. Feel free to build this app along with me. And the best way to learn is to build along. I want to build a 3D room with 3JS. 3JS is a really nice 3D framework for JavaScript that helps you build 3D worlds very easily. In this 3D room will be an avatar we can talk to. This avatar will be powered by the OpenAI API so that we can chat with it and ask it questions. Please just build the room, the avatar, and the AI functionality so we can talk to the avatar. Right, so we're just going to have our developer to start building out the app for us. Then we're going to go into the interns and the CEO. So I hit enter on that. Any main functionality, any main coding, any big features we build out will all be done with our senior developer, which is Claude Code. Because Claude Code is by far the smartest coding AI out there, it's going to be the best at building out really big functionality like what we just gave it here. I did this all in planning mode so that we can quickly read over the plan, but it looks like they're going to set up the app, they're going to build the front end structure, the back end structure, as well as all the 3D and chat functionality. Read that over, looks good to me, and let's hit enter. And that's going to start building out with our senior developer. So Claude Code works, now I'm going to show you the next part of our workflow, which is going to be our army of AI agent interns that are going to tackle all our other tasks for us. So our senior dev who I just introduced you to is going to do any sort of main functionality we want in this app. But now what we're going to do is we're going to utilize brand new functionality inside Cursor to start spinning up intern agents that are going to do work for us while our developer works. These interns are going to be amazing at setting up small pieces of functionality in our app. So we can have an intern go and start putting decorations in our 3D room, we can have an intern go and start putting in small features like model pickers so we can have our avatars use different AI models, we're going to spin an intern up that's going to go and do marketing research for us and write us tweets for our announcement video, we're going to have a security intern that I'll show you how to spin up that's going to go and make sure our app's secure. We're going to have a whole army of AI agent interns supporting our senior dev. This is going to unlock productivity you've never had before when building with AI. And real quick before we spin up our interns, in order to get our interns working we need to have our code on Git. It's a requirement of background agents in Cursor to have your code on Git, so real quick I'm going to show you how to get this code on there. Feel free to go to github.com real quick and set up an account if you haven't already. Then once you've set that up make sure to create a new repository, I'm going to call this 3D avatar. We're going to make this private and then I'm going to create the repository. Now we have a URL for our GitHub, all we got to do is press copy on that. Once we have that URL all we have to do is go back to our senior developer and say please push this to GitHub. And then we paste in the URL that we just got from the other screen. You hit enter on that and our senior dev will go and push this code to GitHub so we can start spinning up our AI intern agents. Make sure to just hit yes along the way as it's going. Alright so we have our code on GitHub, our senior developer is working to set up our application. Now let's spin up those interns so we can have a bunch of employees working on our app at the same time. And this is going to write code faster than you've ever seen before. So here's how we spin up our interns that will be supporting the senior dev. You're going to open up your cursor sidebar. That's why it's really important you open up Clawed Code and Cursor is because you can unlock all this other functionality inside Cursor. So inside our AI agent side panel in Cursor is this little cloud icon here at the top. These are your background agents. These are going to be the interns that are going to work for us and support our senior dev. So I'm going to show you how to set up four AI agent interns, but you can set up as many or as few as you want. So I'm going to set up two interns to build out functionality for us and I'm going to set up two interns. One will be our security intern. The other is going to be our marketing intern. So let's start building out some feature interns first. So let's build out these interns. First one I'm going to have build out 3D decorations in our 3D space. So I said, I want you to build out 3D decorations in our space. Please put chairs and plants in our space. So you hit enter on the command and our background agent, our interns going to get to work. You see this there, the interns working. So it's building out the code for us. Let's spin up a couple more interns. So I'm going to do another one. I want you to put a model picker on the screen so I can change the AI model of the avatar. Boom. That interns going. We now have two interns working for us. Now let's spin up a third intern. These next two are critical. I always like to have a marketing and a security intern going just to make sure our app is secure. There's no holes that when we ship this to production, it can get hacked. And also just to come up with ideas for marketing. So we're going to say, I want you to be our security intern. Please check our app for best security practices. Boom. Spin up another. Now we have three AI agent interns going for us. And then lastly, let's do our marketing intern. You're our marketing intern. Please build a marketing plan and write some tweets. Boom. Hit enter on that. Four AI agent interns going. So just to recap what we've got going on so far in our workflow, we have Claude Code, our senior dev, building out our 3D environment. And now we have four AI agent interns who are building out small functionality for us. Two are building out features. One is checking on security, which is really, really important. And the other is building us a marketing plan all at the same time. What you were doing before, if you're just using Claude Code or just using Cursor, is you were handholding one AI the entire time, building one single path. Now we have an army of agents working for us and building out our app simultaneously, which is way faster. But we're not even done yet. We still have another stage of our workflow to go, which is our CEO. I'm going to show you how to spin up a CEO in a second and how we're going to use it. But before we get to the final part of our top secret workflow, let's check in on our senior dev real quick, see how they're doing and see if they finish setting up our app. Looks like our senior developer finished their work. One small thing we'll have to do here is add our OpenAI API key to our .env file so that our AI functionality is\n\n",
      "model_used": "gpt-4o",
      "processing_time": 71.14300584793091,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T02:10:57.692288",
    "updated_at": "2025-07-07T02:12:08.839581"
  },
  {
    "id": "a9KSclxhEnrsVMPWUuK3rw",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=3PdorDOn6xI",
    "timestamp": 1751825911.799608,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751826007.003902
    },
    "result": {
      "title": "This Claude Code Workflow Changes EVERYTHING",
      "summary": "# **深度分析：Claude Code 多代理人協作開發工作流**\n\n---\n## **主要觀點與核心價值**\n\n這段影片揭示了一種顛覆性的AI輔助軟體開發工作流，其核心價值在於將單一AI工具的使用模式，升級為**多代理人（Multi-Agent）協同作業的智慧團隊模式**。講者聲稱這種方法能將應用程式的開發速度提升十倍，並稱之為「印鈔機應用程式」的加速器，這不僅僅是誇大其詞，而是基於效率和規模化的潛在效益。\n\n傳統上，開發者與AI編碼工具（如Claude Code）的互動模式多為一對一的指令與回應，開發者需要手動引導AI完成每一個步驟。然而，此工作流引入了「AI代理人團隊」的概念，模擬真實世界中的開發團隊架構：一位**資深開發者（Senior Developer）**負責核心架構與主要功能，多位**實習生（Interns）**平行處理次要或特定任務，以及一位**執行長（CEO）**負責高層次的協調與策略規劃。這種分工合作的模式，極大地提升了開發的並行性與效率。\n\n其背後的原理是將複雜的軟體開發專案分解為多個可同時進行的子任務，並將這些子任務分配給不同的AI代理人。例如，當「資深開發者」Claude Code在建構應用程式的核心骨架時，多個「實習生」AI可以同時進行介面美化、安全審查、市場分析甚至社群媒體內容撰寫等非核心但必要的任務。這不僅減少了開發者的手動干預，更重要的是，它**將開發流程從線性轉變為高度並行**。\n\n此工作流的專業洞察在於其對**軟體工程原則的AI化應用**。它模仿了敏捷開發（Agile Development）中團隊協作、任務分解和並行處理的精髓，但將執行者從人類轉變為AI。這意味著：\n1.  **效率的指數級提升**：AI代理人不受疲勞限制，可以24/7不間斷工作，且任務切換成本極低。\n2.  **專業分工的自動化**：透過為不同AI代理人設定特定角色（如安全、行銷），可以確保各個專業領域的需求在開發初期就被考量和滿足。\n3.  **開發者角色轉變**：人類開發者從「執行者」轉變為「管理者」和「策略制定者」，負責定義高層次目標、審核AI產出並進行最終整合。這使得開發者能將更多精力投入到創新和複雜問題解決上。\n4.  **降低開發門檻**：對於缺乏完整開發團隊或特定領域專業知識的個人開發者或小型團隊，這種模式提供了一種低成本、高效率的解決方案，使他們能夠快速迭代和推出產品。\n\n此工作流對未來軟體開發的影響是深遠的。它預示著AI將不再僅僅是輔助工具，而是成為開發團隊中不可或缺的「成員」。未來，我們可能會看到更複雜、更智能的AI代理人協作框架，能夠自主地進行需求分析、架構設計、程式碼編寫、測試、部署乃至營運維護。這將徹底改變軟體開發的生態系統，加速創新週期，並可能催生出更多由AI驅動的「印鈔機應用程式」。\n\n---\n## **內容大綱**\n\n1.  **AI協作開發新範式：多代理人工作流概述**\n2.  **Claude Code作為資深開發者：應用骨架與核心功能建構**\n3.  **AI實習生團隊：平行任務處理與功能擴展**\n4.  **Git整合與協作基礎：確保多代理人同步作業**\n5.  **AI CEO：智慧協調與業務策略制定**\n\n---\n## **關鍵術語與概念**\n\n-   **Claude Code**: Anthropic公司開發的強大AI編碼工具，以其卓越的程式碼生成、理解和除錯能力而聞名。在此工作流中被賦予「資深開發者」的角色。\n-   **Cursor**: 一款基於VS Code的AI原生程式碼編輯器，內建了對AI編碼工具的深度整合，並提供了「背景代理人（Background Agents）」等功能，是實現多代理人工作流的關鍵平台。\n-   **AI Agent (AI代理人)**: 指的是具有特定目標、能夠自主執行任務並與環境互動的AI實體。在此工作流中，不同的AI代理人被賦予了資深開發者、實習生（功能、安全、行銷）和CEO等角色。\n-   **3JS**: 一個輕量級的JavaScript 3D函式庫，用於在網頁瀏覽器中顯示互動式3D電腦圖形。影片中用於建構3D房間和AR虛擬人偶。\n-   **OpenAI API**: OpenAI提供的應用程式介面，允許開發者將其強大的AI模型（如GPT系列）整合到自己的應用中，影片中用於驅動虛擬人偶的對話功能。\n-   **Git/GitHub**: Git是一個分散式版本控制系統，用於追蹤程式碼的變更；GitHub是一個基於Git的網路代管服務，用於專案協作和版本管理。在此工作流中，Git是啟用Cursor背景代理人功能的前提，確保所有AI代理人能在共享的程式碼庫上協同工作。\n\n---\n## **重要引述與案例**\n\n> \"Everyone knows Claude code is the most powerful AI coding tool ever made. But what if I told you there's a secret workflow I discovered that will help you build money printing apps 10 times faster?\"\n**分析**: 這段引述是影片的開場白，旨在立即抓住觀眾的注意力，並強調其所揭示的工作流的獨特性和潛在的巨大價值。它設定了影片的基調，將Claude Code定位為頂級AI編碼工具，並承諾透過一個「秘密工作流」實現「十倍速」的「印鈔機應用程式」開發。這不僅是一個誇張的行銷語句，也暗示了該工作流的核心效益：極大地提升開發效率，從而加速產品上市和商業變現。\n\n> \"Basically what we're going to be doing is spinning up a bunch of AI agents with Claude code that are going to be working with us to build our apps significantly faster than if you were just using Claude code.\"\n**分析**: 這句話直接點明了影片的核心概念——「生成大量AI代理人」。它解釋了為何此工作流比單純使用Claude Code更高效：透過多個AI代理人的協同作業，實現了任務的並行處理和專業分工。這是一個從單點工具使用到「AI團隊」協作模式的轉變，是整個工作流的基石。它強調了AI代理人作為「協作者」而非單純「工具」的角色，預示著未來人機協作的新範式。\n\n> \"So Claude code in this workflow is going to be our senior developer that will be scaffolding out our app. So we start here before we start hiring our interns to do little tiny tasks.\"\n**分析**: 此引述明確定義了Claude Code在多代理人工作流中的首要角色——「資深開發者」。它負責應用程式的「骨架建構（scaffolding）」和核心功能的實現。這凸顯了Claude Code在處理複雜、高層次開發任務方面的優勢。同時，它也為後續引入「實習生」AI代理人奠定了基礎，強調了任務的層次性和分工的邏輯性：先有核心架構，再由實習生填充細節和輔助功能。\n\n> \"We're going to have a whole army of AI agent interns supporting our senior dev. This is going to unlock productivity you've never had before when building with AI.\"\n**分析**: 這段話生動地描繪了「AI實習生大軍」的概念，強調了其對生產力提升的巨大潛力。它不僅僅是增加AI的數量，更是透過平行處理和專業分工，解決了單一AI無法同時處理多個任務的瓶頸。實習生可以處理各種小型、輔助性或專業性的任務（如安全檢查、市場研究、UI裝飾），從而讓資深開發者專注於核心邏輯。這句話是整個工作流效率提升的關鍵承諾。\n\n---\n## **詳細內容分析**\n\n### **AI協作開發新範式：多代理人工作流概述**\n\n影片的核心主張是透過建立一個**多AI代理人（Multi-Agent AI）**的協作開發團隊，來顯著加速應用程式的開發進程。這與傳統的單一AI工具互動模式形成鮮明對比。在傳統模式下，開發者需要手動向AI發出指令，等待回應，然後再發出下一個指令，這是一個線性的、串行的過程。而此處提出的工作流則模擬了真實軟體開發團隊的層級結構和分工合作，將開發任務分解並分配給不同角色的AI代理人，實現了**並行處理**。\n\n這個「秘密工作流」的核心理念是將AI從單純的「工具」提升為「團隊成員」。講者將其比喻為一個由「資深開發者」、「實習生」和「執行長」組成的智慧團隊。這種模式的優勢在於：\n1.  **任務並行化**：不同的AI代理人可以同時執行各自的任務，例如，當資深開發者在建構核心功能時，實習生可以同時進行介面美化、安全檢查或市場調研。\n2.  **專業化分工**：每個AI代理人被賦予特定的角色和職責，使其能夠專注於特定領域的任務，從而提高專業性和效率。例如，有專門負責安全檢查的實習生，確保應用程式的安全性。\n3.  **減少人工干預**：一旦任務被分配，AI代理人可以在後台自主運行，減少了人類開發者頻繁的指令輸入和上下文切換。\n\n這種範式轉變不僅僅是技術上的創新，更是對軟體開發流程的**組織性優化**。它將軟體工程中的分工、協作和並行處理原則，透過AI技術實現了自動化和規模化，從而有望實現講者所稱的「十倍速」開發效率。\n\n### **Claude Code作為資深開發者：應用骨架與核心功能建構**\n\n在此多代理人工作流中，**Claude Code**被賦予了最關鍵的「**資深開發者（Senior Developer）**」角色。其主要職責是**應用程式的骨架建構（scaffolding）**和**核心功能的實現**。講者強調，Claude Code之所以能勝任此職，是因為它是目前「最聰明的AI編碼工具」，擅長處理複雜和大規模的程式碼生成任務。\n\n具體操作上，開發者首先在**Cursor**編輯器中啟動Claude Code。Cursor作為一個AI原生的程式碼編輯器，提供了與Claude Code深度整合的環境。開發者向Claude Code提供一個高層次的專案需求描述，例如影片中所示範的：「我想要用3JS建立一個3D房間，裡面有一個可以對話的虛擬人偶，對話功能由OpenAI API驅動。請只建立房間、虛擬人偶和AI對話功能。」\n\nClaude Code在接收到這個指令後，會進入「**規劃模式（planning mode）**」，自動分析需求並生成一個詳細的開發計畫，包括設定應用程式、建立前端結構、後端結構以及3D和聊天功能。開發者審閱並確認計畫後，Claude Code便會開始自動生成程式碼，建構應用程式的核心架構和主要功能。\n\n這個階段的重點是利用Claude Code的強大能力，快速搭建起專案的基礎框架，並實現最核心的業務邏輯。這為後續「實習生」AI代理人填充細節和擴展功能奠定了堅實的基礎。資深開發者的角色確保了專案的整體結構合理性和核心功能的完整性，避免了在細節上過早投入，從而提高了開發效率。\n\n### **AI實習生團隊：平行任務處理與功能擴展**\n\n在資深開發者（Claude Code）忙於建構應用程式核心功能時，此工作流的第二個關鍵環節是啟動一個「**AI實習生（AI Agent Interns）**」團隊。這些實習生AI代理人利用Cursor編輯器中「**背景代理人（Background Agents）**」的新功能，能夠在後台並行地處理各種小型、輔助性或專業性的任務。\n\n講者示範了如何啟動四個不同類型的實習生：\n1.  **功能實習生（Feature Interns）**：\n    *   **3D裝飾實習生**：負責在3D房間中添加裝飾元素，如椅子和植物。這類任務通常是視覺層面或非核心業務邏輯的補充。\n    *   **模型選擇器實習生**：負責在螢幕上添加一個功能，允許使用者切換虛擬人偶所使用的AI模型。這是一個小型但實用的功能擴展。\n2.  **安全實習生（Security Intern）**：這是一個至關重要的角色。其任務是檢查應用程式的程式碼，確保其遵循最佳安全實踐，防止潛在的漏洞和攻擊。這體現了在開發早期就將安全性納入考量的專業洞察。\n3.  **行銷實習生（Marketing Intern）**：負責制定行銷計畫並撰寫推文，為應用程式的發布做準備。這展示了AI代理人不僅限於程式碼編寫，還能處理業務和營運相關的任務。\n\n這些實習生AI代理人能夠在資深開發者工作的同時，獨立地執行各自的任務，極大地提高了開發的並行性和整體效率。它們處理的任務通常是較為獨立、粒度較小但數量繁多的工作，這些工作如果由資深開發者或人類開發者手動完成，將會耗費大量時間並打斷主線開發流程。透過實習生團隊，開發者可以實現前所未有的生產力提升，因為多個「員工」正在同時為應用程式的不同方面貢獻力量。\n\n### **Git整合與協作基礎：確保多代理人同步作業**\n\n為了讓Cursor中的「背景代理人」（即AI實習生）能夠正常工作並與「資深開發者」協同作業，一個關鍵的技術前提是**將專案程式碼推送到Git版本控制系統上**。講者明確指出，這是Cursor背景代理人功能的「要求」。\n\nGit（以及其網路代管服務如GitHub）在此工作流中扮演著至關重要的角色：\n1.  **版本控制與同步**：Git確保所有AI代理人（以及人類開發者）都在同一個程式碼基礎上工作。當資深開發者生成核心程式碼時，這些程式碼會被推送到GitHub倉庫。隨後，實習生代理人可以從該倉庫拉取最新程式碼，在其基礎上進行修改或添加新功能。\n2.  **協作基礎**：Git提供了一個共享的程式碼庫，使得多個實體（無論是人類還是AI代理人）能夠並行地對專案進行修改，並透過分支、合併等機制管理這些修改，避免衝突。\n3.  **狀態管理**：透過Git，可以追蹤所有程式碼的變更歷史，這對於除錯、回溯和專案管理都非常重要。\n\n影片中展示了將程式碼推送到GitHub的具體步驟：\n1.  在GitHub上建立一個新的程式碼倉庫（Repository），並獲取其URL。\n2.  回到Cursor中的資深開發者介面，發出指令：「請將此推送到GitHub」，並貼上GitHub倉庫的URL。\n3.  資深開發者會自動執行Git命令，將本地程式碼推送到遠端GitHub倉庫。\n\n這個步驟是啟用AI實習生團隊的必要前置條件。它確保了所有AI代理人都能在一個受控且同步的環境中工作，避免了程式碼混亂和版本衝突，為高效的多代理人協作提供了堅實的技術基礎。這也反映了現代軟體開發中版本控制的重要性，即使在AI主導的開發流程中也同樣不可或缺。\n\n### **AI CEO：智慧協調與業務策略制定**\n\n影片在介紹完資深開發者和實習生團隊後，提出了工作流的第三個也是最高層次的AI代理人角色——「**AI CEO**」。儘管影片轉錄文本中並未詳細展示如何設定或實際運用這個CEO代理人，但講者明確闡述了其**預期職責**：「將為我們經營業務並協調所有AI代理人。」\n\n這個概念的引入，將AI協作開發的層次從單純的程式碼編寫和功能實現，提升到了**專案管理、業務策略和團隊協調**的高度。AI CEO的角色可能包括：\n1.  **高層次專案管理**：監控整個開發進程，確保各個AI代理人（資深開發者和實習生）的工作進度符合整體專案目標和時間表。\n2.  **任務分配與優化**：根據專案的即時需求和AI代理人的能力，動態地分配或重新分配任務，確保資源的最佳利用。\n3.  **業務策略制定**：結合市場數據、用戶回饋和專案進度，為應用程式的發展方向提供策略性建議，例如決定下一個要開發的功能、調整行銷策略等。\n4.  **衝突解決與協調**：在多個AI代理人之間出現潛在衝突（例如程式碼衝突或任務重疊）時，進行協調和決策。\n5.  **整體業務運營**：如講者所言，它將「經營我們的業務」，這可能意味著它能夠處理從開發到部署、行銷乃至用戶支援的整個產品生命週期中的高層次決策。\n\nAI CEO的概念代表了AI在軟體開發中從「執行層」向「管理層」和「決策層」的躍升。它預示著未來AI不僅能寫程式，還能理解業務、管理團隊、制定策略，甚至可能自主地驅動整個產品的開發和迭代。雖然影片中未詳盡展示其操作，但其提出的願景是將AI協作提升到一個全新的戰略高度，實現更為自主和全面的AI驅動開發。\n\n---\n## **實踐應用與建議**\n\n-   **建議1: 明確定義資深開發者的初始任務**\n    *   **詳細說明**: 在啟動Claude Code作為資深開發者時，務必提供清晰、具體且高層次的專案需求。避免一開始就陷入細節，讓資深開發者專注於應用程式的核心架構和主要功能骨架的搭建。例如，影片中要求建立「3D房間、虛擬人偶和AI對話功能」，而非立即要求房間的裝飾細節。這樣能確保基礎穩固，為後續實習生工作提供清晰的上下文。\n    *   **實施方法**: 使用簡潔明瞭的自然語言描述核心功能，並利用Claude Code的「規劃模式」來審閱其生成的開發計畫，確保其理解與預期一致。\n\n-   **建議2: 善用AI實習生進行平行任務處理與專業分工**\n    *   **詳細說明**: AI實習生是提升效率的關鍵。將專案中所有可以並行處理的、粒度較小的、或需要特定專業知識的任務分解出來，分配給不同的實習生代理人。這包括功能擴展（如UI元素、小型互動）、非功能性需求（如安全審查、性能優化）以及業務相關任務（如市場研究、內容生成）。\n    *   **實施方法**: 根據專案需求，靈活設定多個背景代理人。例如，除了功能開發實習生，始終考慮設置一個「安全實習生」進行程式碼審查，以及一個「行銷實習生」來準備產品發布材料。這能確保開發的全面性和效率。\n\n-   **建議3: 擁抱Git作為AI協作的基礎設施**\n    *   **詳細說明**: Git（尤其是GitHub）不僅是版本控制工具，更是實現多AI代理人協同工作的必要基礎。確保專案程式碼始終在Git倉庫中，並及時推送更新。這是Cursor背景代理人功能運行的前提，也是保證所有AI代理人能在共享、同步的程式碼基礎上高效工作的關鍵。\n    *   **實施方法**: 在專案啟動初期就建立GitHub倉庫，並將資深開發者生成的程式碼推送到遠端。定期同步程式碼，確保所有代理人都能訪問最新版本，並在必要時手動解決潛在的合併衝突。\n\n-   **建議4: 逐步探索AI CEO的潛力**\n    *   **詳細說明**: 雖然影片中AI CEO的實際操作細節較少，但其概念代表了AI在專案管理和策略層面的潛力。隨著技術的發展，嘗試利用AI進行更高層次的任務協調、進度監控甚至初步的業務決策，將是提升整體開發效率和智慧化的重要方向。\n    *   **實施方法**: 從簡單的任務協調指令開始，例如讓AI CEO監控特定實習生的進度，或在多個任務之間進行優先級排序。隨著對AI能力的理解加深，逐步賦予其更複雜的決策權限。\n\n---\n## **相關資源與延伸閱讀**\n\n-   **Claude Code**:\n    *   **資源說明**: Anthropic公司開發的AI編碼工具，是此工作流中「資深開發者」的核心。了解其能力、限制和最佳實踐，對於有效利用此工作流至關重要。\n    *   **價值**: 深入學習Claude Code的提示工程（prompt engineering）技巧，能幫助開發者更精準地引導其生成高品質的程式碼和計畫。\n\n-   **Cursor編輯器**:\n    *   **資源說明**: 作為AI原生程式碼編輯器，Cursor提供了內建的AI整合功能，特別是其「背景代理人」功能，是實現多代理人工作流的技術基礎。\n    *   **價值**: 熟悉Cursor的介面、快捷鍵和AI相關功能（如聊天模式、編輯模式、背景代理人設定），能極大提升開發效率和AI協作體驗。\n\n-   **3JS (Three.js)**:\n    *   **資源說明**: 一個流行的JavaScript 3D函式庫，用於在網頁上建立和顯示3D圖形。影片中的3D房間和虛擬人偶範例就是基於此技術。\n    *   **價值**: 對於希望開發3D互動式網頁應用程式的開發者，學習3JS是基礎。理解其核心概念有助於更好地指導AI生成相關程式碼。\n\n-   **OpenAI API**:\n    *   **資源說明**: OpenAI提供的各種AI模型（如GPT系列）的API介面，用於整合語言理解和生成能力。影片中用於驅動虛擬人偶的對話功能。\n    *   **價值**: 了解OpenAI API的使用方法、不同模型的特性和計費方式，對於開發基於AI對話或內容生成的應用程式至關重要。\n\n-   **Git與GitHub**:\n    *   **資源說明**: Git是版本控制系統，GitHub是其最流行的網路代管服務。它們是現代軟體開發協作的基石，也是此多代理人工作流的技術前提。\n    *   **價值**: 掌握Git的基本操作（如`clone`, `add`, `commit`, `push`, `pull`, `branch`, `merge`）和GitHub的協作流程，是任何開發者必備的技能，尤其是在多代理人環境下。\n\n---\n## **總結與未來展望**\n\n這段影片所展示的Claude Code多代理人協作工作流，不僅僅是一個技術技巧，更是一種對未來軟體開發模式的深刻預示。其核心價值在於將傳統的單一AI工具使用模式，轉變為**模擬真實團隊分工的AI代理人協同作業模式**。透過將Claude Code定位為「資深開發者」，並輔以多個「實習生」AI處理平行任務，甚至設想一個「AI CEO」進行高層次協調，該工作流極大地提升了開發的並行性、專業化程度和整體效率。講者所宣稱的「十倍速」開發，正是源於這種從線性到並行、從單點到團隊的範式轉變。\n\n此模式的核心優勢在於：\n1.  **生產力飛躍**：AI代理人可以同時處理多個任務，且不受人類疲勞限制，實現24/7不間斷工作，顯著縮短開發週期。\n2.  **專業化與全面性**：透過設定不同職責的實習生（如安全、行銷），確保了開發過程不僅關注功能實現，還兼顧了非功能性需求和業務策略。\n3.  **開發者角色升級**：人類開發者從繁瑣的程式碼編寫中解放出來，轉變為專案的架構師、管理者和創新者，將精力集中於更高價值的決策和複雜問題解決。\n\n展望未來，這種多代理人協作模式將會更加成熟和普及。我們可以預見：\n*   **更智能的代理人協調框架**：未來的AI CEO將不僅限於簡單的任務分配，可能具備更強的專案管理、風險評估和自動化決策能力，甚至能自主進行需求分析和設計決策。\n*   **動態適應的AI團隊**：AI代理人團隊將能根據專案的即時進度和需求，動態地調整其組成和職責，實現更靈活、更高效的資源配置。\n*   **人機協作的深度融合**：人類開發者與AI代理人之間的協作將更加無縫，AI將成為真正的「數位同事」，共同參與從概念到部署的整個軟體生命週期。\n*   **開發門檻的進一步降低**：這種模式將使更多非專業人士也能參與到應用程式的創建中，加速「公民開發者」的崛起，並催生更多創新應用。\n\n總之，這不僅僅是關於如何更快地寫程式，更是關於如何重新定義軟體開發的本質。它預示著一個由AI驅動、高度自動化、並行且智慧化的開發新時代的來臨，將徹底改變我們構建和交付軟體的方式。",
      "transcript": "Everyone knows Claude code is the most powerful AI coding tool ever made. But what if I told you there's a secret workflow I discovered that will help you build money printing apps 10 times faster? In this video, I'm going to go over that workflow step by step. And if you stick with me until the end, I personally guarantee you, you'll be building significantly faster with Claude code. Let's get into it. So this right here is the gist of the top secret workflow I'm going to be showing you in this video. Basically what we're going to be doing is spinning up a bunch of AI agents with Claude code that are going to be working with us to build our apps significantly faster than if you were just using Claude code. The first thing I'm going to do is show you how we're going to use Claude code as a senior developer for our app. Then I'm going to show you how we're going to spin up a bunch of interns to do small little tasks for us while Claude code is working. And as all those developers are going and building for us, I'm going to show you how we'll spin up a ultra smart CEO that's going to be running our business for us and orchestrating all the AI agents as we go. I promise every step of this is about to blow your mind. So let's start with our senior developer who will be building the main part of our app for us. What we're going to do is we're going to open up Claude code inside a cursor. Cursor is free. Make sure to get that. And then Claude code. I'll also have the link down below if you don't have that yet, which you're crazy if you don't have that yet. We're going to open this up in cursor. So once you have your terminal open in cursor, make sure you type in Claude after you've gotten Claude code installed. That will open up Claude code and we're good to start going with our senior developer. So Claude code in this workflow is going to be our senior developer that will be scaffolding out our app. So we start here before we start hiring our interns to do little tiny tasks. So let's start building out our app with Claude code. What we're going to build in this video is a 3D world where we'll have AR avatars we can talk to. So as our senior developer Claude code will go scaffold out our app, build out all the main functionality, and then we'll move on to our interns after to start building on top of that. So here's the prompt I put in to build this app. Feel free to build this app along with me. The best way to learn is to build along. I want to build a 3D room with 3JS. 3JS is a really nice 3D framework for JavaScript that helps you build 3D worlds very easily. In this 3D room will be an avatar we can talk to. This avatar will be powered by the OpenAI API so we can chat with it and ask it questions. Please just build the room, the avatar, and the AI functionality so we can talk to the avatar. Right, so we're just going to have our developer to start building out the app for us, then we're going to go into the interns and the CEO. So I hit enter on that. Any main functionality, any main coding, any big features we build out will all be done with our senior developer which is Claude code. Because Claude code is by far the smartest coding AI out there, it's going to be the best at building out really big functionality like what we just gave it here. I did this all in planning mode so that we can quickly read over the plan, but it looks like they're going to set up the app, they're going to build the front-end structure, the back-end structure, as well as all the 3D and chat functionality. Read that over, looks good to me, and let's hit enter. And that's going to start building out with our senior developer. As our senior dev works, now I'm going to show you the next part of our workflow which is going to be our army of AI agent interns that are going to tackle all our other tasks for us. So our senior dev who I just introduced you to is going to do any sort of main functionality we want in this app. But now what we're going to do is we're going to utilize brand new functionality inside cursor to start spinning up intern agents that are going to do work for us while our developer works. These interns are going to be amazing at setting up small pieces of functionality in our app. So we can have an intern go and start putting decorations in our 3D room. We can have an intern go and start putting in small features like model pickers so we can have our avatars use different AI models. We're going to spin an intern up that's going to go and do marketing research for us and write us tweets for our announcement video. We're going to have a security intern that I'll show you how to spin up that's going to go and make sure our app's secure. We're going to have a whole army of AI agent interns supporting our senior dev. This is going to unlock productivity you've never had before when building with AI. And real quick before we spin up our interns, in order to get our interns working, we need to have our code on Git. It's a requirement of background agents in cursor to have your code on Git. So real quick, I'm going to show you how to get this code on there. Feel free to go to github.com real quick and set up an account if you haven't already. Then once you've set that up, make sure to create a new repository. I'm going to call this 3D avatar. We're going to make this private and then I'm going to create the repository. Now we have a URL for our GitHub. All we got to do is press copy on that. Once we have that URL, all we have to do is go back to our senior developer and say, please push this to GitHub. And then we paste in the URL that we just got from the other screen. You hit enter on that and our senior dev will go and push this code to GitHub so we can start spinning up our AI intern agents. Make sure to just hit yes along the way as it's going. All right, so we have our code on GitHub. Our senior developer is working to set up our application. Now let's spin up those interns so we can have a bunch of employees working on our app at the same time. And this is going to write code faster than you've ever seen before. So here's how we spin up our interns that will be supporting the senior dev. You're going to open up your cursor sidebar. That's why it's really important you open up Claude code and cursor is because you can unlock all this other functionality inside cursor. So inside our AI agent side panel in cursors, this little cloud icon here at the top, these are your background agents. These are going to be the interns that are going to work for us and support our senior dev. So I'm going to show you how to set up four AI agent interns, but you can set up as many or as few as you want. So I'm going to set up two interns to build out functionality for us. I'm going to set up two interns. One will be our security intern. The other is going to be our marketing intern. So let's start building out some feature interns first. So let's build out these interns. First one I'm going to have build out 3D decorations in our 3D space. So I said, I want you to build out 3D decorations in our space. Please put chairs and plants in our space. So you hit enter on the command and our background agent, our interns going to get to work. You see this there, the interns working. So it's building out the code for us. Let's spin up a couple more interns. So I'm going to do another one. I want you to put a model picker on the screen so I can change the AI model of the avatar. Boom, that interns going. We now have two interns working for us. Now let's spin up a third intern. These next two are critical. I always like to have a marketing and a security intern going just to make sure our app is secure. There's no holes that when we ship this to production, it can get hacked. And also just to come up with ideas for marketing. So we're going to say, I want you to be our security intern. Please check our app for best security practices. Boom, spin up another. Now we have three AI agent interns going for us. And then lastly, let's do our marketing intern. You're our marketing intern. Please build a marketing plan and write some tweets. Boom, hit enter on that. Four AI agent interns going. So just to recap what we've got going on so far in our workflow, we have Claude Code, our senior dev building out our 3D environment. And now we have four AI agent interns who are building out small functionality for us. Two are building out features. One is checking on security, which is really, really important. And the other is building us a marketing plan all at the same time. What you were doing before, if you're just using Claude Code or just using Cursor, is you were handholding one AI the entire time, building one single path. Now we have an army of agents working for us and building out our app simultaneously, which is way faster, but we're not even done yet. We still have another stage of our workflow to go, which is our CEO. I'm going to show you how to spin up a CEO in a second and how we're going to use it. But before we get to the final part of our top secret workflow, let's check in on our senior dev real quick, see how they're doing and see if they finish setting up our app. Looks like our senior developer finished their work. One small thing we'll have to do here is add our OpenAI API key to our .env file so that our AI\n\n",
      "model_used": "gemini-2.5-flash-preview-05-20",
      "processing_time": 95.2021861076355,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T02:18:31.799628",
    "updated_at": "2025-07-07T02:20:07.004140"
  },
  {
    "id": "-lI5AWejyeBUzy46VlTnnA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=3PdorDOn6xI",
    "timestamp": 1751832097.811847,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1751832193.64415
    },
    "result": {
      "title": "This Claude Code Workflow Changes EVERYTHING",
      "summary": "# **AI協作開發的革命性工作流：Claude Code與多代理模式深度解析**\n\n---\n\n## **主要觀點與核心價值**\n\n這段影片揭示了一種顛覆性的AI協作開發工作流，其核心價值在於將傳統的單一AI工具應用模式，提升至**多代理（Multi-Agent）協同作業**的層次。講者聲稱，這種方法能將應用程式的開發速度提升十倍，甚至能打造出「印鈔機般的應用程式」（money printing apps）。其背後的原理與意義深遠：\n\n首先，它重新定義了AI在軟體開發中的角色。傳統上，AI被視為一個強大的輔助工具，開發者與之進行一對一的互動，逐步完成任務。然而，此工作流將AI提升為一個**團隊成員**，甚至是一個**專案管理體系**。透過賦予不同AI代理特定的職責（如資深開發者、實習生、執行長），模擬真實世界中的開發團隊結構，實現了任務的**平行處理**與**專業分工**。這不僅極大地提高了效率，也讓AI能夠同時處理多個不同性質的任務，從核心功能開發到細節裝飾，再到安全審查和市場行銷規劃。\n\n其次，該工作流強調了**工具整合與生態系統的重要性**。它不僅僅是單純使用Claude Code，而是將其嵌入到Cursor這樣一個專為AI協作設計的整合開發環境（IDE）中。Cursor提供的「背景代理」（Background Agents）功能是實現多代理並行工作的關鍵。這種深度整合使得AI代理能夠在共享的程式碼庫上協同作業，並透過Git進行版本控制，確保了開發流程的順暢與一致性。這表明未來AI開發的趨勢將不再是孤立的工具，而是高度整合、互相協作的智慧生態系統。\n\n再者，此模式展現了**AI在專案管理與策略層面的潛力**。雖然影片中對「AI執行長」的具體操作細節描述不多，但其概念——負責協調所有AI代理、運行業務並制定策略——暗示了AI未來不僅能執行技術任務，還能參與到更高層次的專案規劃、資源分配甚至商業決策中。這為自動化開發流程的最終願景描繪了藍圖，即一個能夠自我組織、自我優化、甚至自我行銷的智慧開發體系。\n\n總體而言，該工作流的核心價值在於其對**開發效率的指數級提升**、**AI角色從輔助到協作的轉變**、**工具生態系統的深度整合**，以及對**未來AI驅動型專案管理模式的探索**。它不僅僅是一種技術技巧，更是一種對未來軟體開發範式的深刻洞察與實踐。\n\n---\n\n## **內容大綱**\n1.  **AI協作開發的革命性工作流概覽**\n2.  **資深開發者：Claude Code的核心角色與應用**\n3.  **AI實習生大軍：平行任務處理與專業分工**\n4.  **AI執行長：宏觀協調與商業策略的願景**\n5.  **實作環境與技術前置條件**\n6.  **生產力躍升與開發模式轉變的影響**\n\n---\n\n## **關鍵術語與概念**\n-   **Claude Code**: 一款被講者譽為「有史以來最強大AI編碼工具」的AI編碼助手，在此工作流中扮演「資深開發者」的角色，負責應用程式的核心架構與主要功能開發。\n-   **Cursor**: 一款專為AI設計的整合開發環境（IDE），提供「背景代理」（Background Agents）等功能，是實現多AI代理並行工作的關鍵平台。\n-   **AI Agent (AI代理)**: 指具有特定職能和任務的獨立AI實體。在此工作流中，AI代理被擬人化為資深開發者、實習生和執行長，各自承擔不同的開發與管理職責。\n-   **Multi-Agent Workflow (多代理工作流)**: 一種將多個AI代理協同組織起來，共同完成複雜開發專案的方法。每個代理負責特定任務，實現平行處理和專業分工，以大幅提升效率。\n-   **Scaffolding (鷹架)**: 在軟體開發中，指建立專案的初始結構、檔案和基本配置的過程。在此工作流中，由「資深開發者」Claude Code負責。\n-   **3JS**: 一個基於JavaScript的3D函式庫，用於在網頁瀏覽器中創建和顯示3D圖形。影片中用於構建3D房間和AR虛擬人偶。\n-   **OpenAI API**: OpenAI提供的應用程式介面，允許開發者將其強大的AI模型（如GPT系列）整合到自己的應用中，影片中用於實現虛擬人偶的聊天功能。\n-   **Git/GitHub**: Git是一個分散式版本控制系統，GitHub是一個基於Git的程式碼託管平台。在此工作流中，將程式碼推送到GitHub是啟用Cursor「背景代理」的必要條件，確保AI代理間的協同工作和程式碼同步。\n-   **Background Agents (背景代理)**: Cursor IDE內建的一項功能，允許用戶在後台啟動並運行多個AI代理，這些代理可以同時執行不同的任務，是實現多代理工作流的核心技術。\n\n---\n\n## **重要引述與案例**\n> \"Everyone knows Claude Code is the most powerful AI coding tool ever made. But what if I told you there's a secret workflow I discovered that will help you build money printing apps 10 times faster?\"\n**分析**: 這段引述是影片的開場白，極具煽動性和吸引力。它不僅確立了Claude Code作為頂級AI編碼工具的地位（儘管這是一種主觀宣稱），更直接點出了影片的核心承諾：透過一種「秘密工作流」實現**十倍速的開發效率**，並創造出「印鈔機般的應用程式」。這句話為整個影片定下了高期待的基調，暗示了即將揭示的內容將是顛覆性的，能夠為開發者帶來顯著的商業價值和生產力提升。它激發了觀眾的好奇心，促使他們深入了解這種「秘密」究竟為何。\n\n> \"Basically, what we're going to be doing is spinning up a bunch of AI agents with Claude Code that are going to be working with us to build our apps significantly faster than if you were just using Claude Code.\"\n**分析**: 這段話直接闡明了該工作流的**核心機制**：不再是單一AI工具的應用，而是**啟動多個AI代理**，讓它們協同工作。這標誌著從「AI輔助」到「AI協作」的範式轉變。講者明確指出，這種多代理模式將比單獨使用Claude Code更高效。這不僅解釋了「十倍速」的來源，也為後續介紹的「資深開發者」、「實習生」和「執行長」等角色設定了基礎，強調了AI團隊化、平行化作業的理念。\n\n> \"Now we have an army of agents working for us and building out our app simultaneously, which is way faster.\"\n**分析**: 這句話是該工作流**效率提升的直接總結**。它形象地將多個AI代理比喻為一支「代理大軍」，強調了其**同時性（simultaneously）**和**速度（way faster）**。在傳統的開發模式中，無論是人工還是單一AI輔助，任務往往是串行執行的。而此模式的核心突破在於實現了多個任務的並行處理，例如資深開發者構建核心架構的同時，實習生可以處理裝飾、安全檢查和市場行銷等次要但必要的任務。這種並行處理能力是實現指數級生產力提升的關鍵所在。\n\n**案例研究：3D AR虛擬人偶應用程式**\n影片中以開發一個「3D房間與可對話AR虛擬人偶」的應用程式作為實踐案例。這個案例具體展示了不同AI代理如何協同工作：\n-   **資深開發者 (Claude Code)**：負責應用程式的**核心架構搭建**（scaffolding），包括3D房間的建立（使用**3JS**）、虛擬人偶的整合，以及與**OpenAI API**連接以實現聊天功能。這是專案的基礎和主要功能。\n-   **實習生 (Cursor背景代理)**：\n    -   **功能實習生1**: 負責在3D空間中添加**裝飾品**，如椅子和植物，這些是次要但能豐富用戶體驗的細節。\n    -   **功能實習生2**: 負責添加**模型選擇器**，允許用戶切換虛擬人偶的AI模型，這是一個小型但實用的功能增強。\n    -   **安全實習生**: 專注於**安全審查**，檢查應用程式是否存在漏洞，確保符合最佳安全實踐，這對於應用程式上線至關重要。\n    -   **行銷實習生**: 負責制定**行銷計畫**並撰寫**推文**，為應用程式的發布做準備，這屬於非編碼但對專案成功不可或缺的任務。\n\n這個案例清晰地說明了如何將一個複雜的應用程式開發任務分解為多個子任務，並由不同職能的AI代理並行處理，從而實現了高效且全面的開發流程。\n\n---\n\n## **詳細內容分析**\n### **AI協作開發的革命性工作流概覽**\n這段影片的核心在於介紹一種創新的AI協作開發工作流，它徹底顛覆了傳統的單一AI工具應用模式。講者將這種模式比喻為一個由AI組成的「開發團隊」，其中包含了「資深開發者」、「實習生」和「執行長」等不同角色。這種多代理（Multi-Agent）的協同作業方式，旨在實現比單獨使用Claude Code或其他AI工具快十倍的開發速度。其基本理念是將複雜的應用程式開發任務分解為多個可並行執行的子任務，並將這些子任務分配給具有特定職能的AI代理。這不僅提高了單個任務的處理速度，更重要的是，它允許多個任務同時進行，從而實現了整體開發週期的指數級縮短。這種工作流的出現，標誌著AI在軟體開發中從單純的輔助工具向協作夥伴，乃至於專案管理者的角色轉變，預示著未來開發模式將更加自動化、智慧化和高效化。\n\n### **資深開發者：Claude Code的核心角色與應用**\n在該工作流中，**Claude Code**被賦予了「資深開發者」的核心職責。其主要任務是負責應用程式的**核心架構搭建（scaffolding）**和**主要功能開發**。講者強調，由於Claude Code被認為是「最聰明的編碼AI」，因此它最適合處理複雜、宏大的編碼任務。影片中以建立一個「3D房間與可對話AR虛擬人偶」的應用程式為例，展示了資深開發者如何運作。開發者首先在Cursor IDE中啟動Claude Code，並輸入一個高層次的指令，要求它使用**3JS**構建3D房間、整合虛擬人偶，並透過**OpenAI API**實現聊天功能。\n\n資深開發者在接收指令後，會進入「規劃模式」（planning mode），生成一個詳細的開發計畫，包括前端和後端結構的設置，以及3D和聊天功能的實現。這個計畫允許開發者在AI開始編碼前進行審閱和確認。一旦計畫獲批，Claude Code便會開始自動生成和組織程式碼，為整個應用程式奠定堅實的基礎。資深開發者的角色確保了應用程式的核心功能和結構的穩健性，為後續實習生們的細節工作提供了穩定的平台。\n\n### **AI實習生大軍：平行任務處理與專業分工**\n當資深開發者（Claude Code）忙於構建應用程式的核心功能時，該工作流的第二個關鍵組成部分——「AI實習生大軍」——便會登場。這些實習生實際上是Cursor IDE中的**背景代理（Background Agents）**功能。它們被設計來處理應用程式中的**小型、獨立且可並行執行的任務**。為了啟用這些背景代理，一個重要的前置條件是將專案程式碼推送到**Git/GitHub**，因為Cursor的背景代理功能依賴於程式碼的版本控制。\n\n影片中展示了如何啟動多個不同職能的實習生：\n-   **功能實習生**: 例如，一個實習生被指派在3D房間中添加「椅子和植物」等裝飾，另一個則負責實現「模型選擇器」功能，允許用戶切換虛擬人偶的AI模型。這些任務雖然看似微小，但對於提升用戶體驗和功能豐富度至關重要。\n-   **安全實習生**: 專門負責「檢查應用程式的最佳安全實踐」，確保應用程式在部署前沒有潛在的安全漏洞。這是一個高度專業化且不可或缺的角色。\n-   **行銷實習生**: 負責「建立行銷計畫並撰寫推文」，這展示了AI代理不僅限於編碼任務，還能處理與專案相關的非技術性、商業性任務。\n\n這種多實習生並行工作的模式，極大地提高了開發效率。當資深開發者處理複雜的架構時，實習生們可以同時進行細節功能開發、品質保證和市場準備，從而避免了傳統開發流程中的串行瓶頸，實現了真正的**多任務、多線程開發**。\n\n### **AI執行長：宏觀協調與商業策略的願景**\n在該工作流的頂層，講者引入了「AI執行長」的概念。儘管影片中並未詳細展示其具體設置和操作，但其被描述為負責「運行我們的業務並協調所有AI代理」的角色。這暗示了AI執行長將超越單純的編碼或功能實現，進入到**宏觀專案管理、策略規劃和業務決策**的層面。\n\nAI執行長的潛在職能可能包括：\n-   **專案進度監控與協調**: 監督資深開發者和實習生們的工作進度，確保各個任務之間的協調性，並在必要時進行資源調配或任務優先級調整。\n-   **衝突解決與決策**: 當不同AI代理的輸出存在衝突或需要權衡時，AI執行長可能具備更高層次的判斷能力，做出最佳決策。\n-   **業務目標對齊**: 確保所有開發工作都與最終的商業目標保持一致，例如「印鈔機般的應用程式」的願景。這可能涉及市場趨勢分析、用戶反饋整合，甚至產品迭代策略的制定。\n-   **風險管理**: 識別潛在的技術或業務風險，並提出應對方案。\n\n雖然影片中對AI執行長的實踐細節描述有限，但其概念本身極具前瞻性。它預示著AI未來不僅能成為強大的技術執行者，更能成為具備戰略思維和管理能力的「智慧領導者」，引導整個開發團隊（無論是人類還是AI）高效地達成商業目標。這將是AI在軟體開發領域實現更高層次自動化的關鍵一步。\n\n### **實作環境與技術前置條件**\n要成功實踐這種多代理AI協作工作流，需要特定的軟體環境和技術配置。影片中明確指出了以下關鍵要素：\n-   **Cursor IDE**: 這是整個工作流的基礎平台。Cursor被強調為一款免費且專為AI協作設計的整合開發環境。其核心功能在於提供了**AI代理側邊欄**和**背景代理（Background Agents）**機制，這是啟動和管理多個AI實習生的關鍵。講者建議用戶務必安裝Cursor，因為「所有其他功能」都依賴於它。\n-   **Claude Code**: 作為「資深開發者」，Claude Code需要被安裝並在Cursor中啟動。影片中提到，在Cursor的終端機中輸入`Claude`指令即可啟動。它是負責核心編碼和架構搭建的AI引擎。\n-   **Git/GitHub整合**: 這是啟用Cursor背景代理的**強制性要求**。開發者必須將其專案程式碼推送到GitHub倉庫。影片中詳細演示了如何創建GitHub倉庫，獲取URL，然後指示資深開發者（Claude Code）將本地程式碼推送到該倉庫。程式碼在Git上的存在，使得多個背景代理能夠在共享的、版本受控的程式碼庫上協同工作，確保了程式碼的一致性和可追溯性。\n-   **OpenAI API Key**: 在影片的結尾處，講者提到資深開發者完成工作後，需要將OpenAI API金鑰添加到`.env`檔案中。這表明如果應用程式需要與OpenAI模型互動（例如虛擬人偶的聊天功能），則必須提供有效的API憑證。這是一個重要的實務細節，確保AI驅動的功能能夠正常運作。\n\n這些技術前置條件共同構成了一個強大的AI協作開發環境，使得開發者能夠充分利用AI的並行處理能力和專業分工優勢，實現前所未有的開發效率。\n\n### **生產力躍升與開發模式轉變的影響**\n該多代理AI協作工作流對軟體開發的影響是深遠的，主要體現在**生產力的指數級躍升**和**開發模式的根本性轉變**上。\n\n首先，**生產力的大幅提升**是顯而易見的。傳統上，無論是單人開發還是小型團隊，任務往往是串行執行的，或者需要大量的人工協調。即使引入單一AI工具，也通常是開發者與AI進行一對一的互動。而這種多代理模式，透過讓「資深開發者」處理核心架構，「實習生」並行處理細節功能、安全審查和市場行銷等多個任務，實現了**真正的並行開發**。這意味著在同一時間內，可以完成的工作量是過去的數倍甚至十數倍。講者明確指出：「現在我們擁有一支代理大軍為我們工作，同時構建我們的應用程式，這要快得多。」這種效率的提升，直接縮短了產品上市時間，降低了開發成本，並允許開發者更快地迭代和實驗新想法。\n\n其次，它導致了**開發模式的根本性轉變**。開發者不再是單純的程式碼編寫者，而是轉變為**AI團隊的管理者和協調者**。他們的角色從「手把手指導一個AI」變為「指揮一支AI軍隊」。這要求開發者具備更強的專案管理能力、任務分解能力和對AI能力的深刻理解。他們需要精確地定義每個AI代理的職責，監控它們的進度，並在必要時介入進行調整或修正。這種模式將開發者從繁瑣的編碼細節中解放出來，讓他們能夠專注於更高層次的設計、架構和創新。\n\n此外，這種模式也暗示了**未來開發團隊結構的演變**。人類開發者可能會更多地扮演「產品經理」、「架構師」或「AI訓練師」的角色，而大量的編碼和執行性任務則由AI代理完成。這將使得小型團隊也能夠承擔過去只有大型團隊才能完成的複雜專案，甚至可能催生出全新的「一人公司」模式，由一個人類開發者指揮一支AI團隊，實現高效的產品開發和運營。這種生產力與模式的轉變，將對整個軟體產業產生深遠的影響。\n\n---\n\n## **實踐應用與建議**\n-   **逐步導入AI代理角色**: 對於初次嘗試多代理工作流的開發者，建議從核心的「資深開發者」角色（如Claude Code）開始，熟悉其在核心功能搭建上的效率。待掌握後，再逐步引入「實習生」角色（Cursor的背景代理），從簡單的裝飾或輔助功能開始，逐漸擴展到安全、行銷等專業領域。最終，再探索「AI執行長」的潛在應用，以實現更高層次的專案管理與協調。\n-   **明確任務分工與指令**: 每個AI代理應有清晰、具體的任務範圍和目標。在給予指令時，應盡可能詳細和明確，避免模糊不清的要求。例如，對於功能實習生，應具體說明要添加的物件類型和位置；對於安全實習生，應指明檢查的重點或遵循的安全標準。清晰的指令是AI代理高效運作的基礎。\n-   **善用版本控制系統（Git/GitHub）**: Git/GitHub是多代理協作的基石。務必確保專案程式碼始終保持在Git倉庫中，並定期提交更新。這不僅是Cursor背景代理的技術要求，更是確保多個AI代理在共享程式碼庫上協同工作時，能夠追蹤變更、解決衝突並回溯歷史版本的關鍵。建議在每次重要功能完成或代理任務結束後進行提交。\n-   **持續監控、審核與迭代**: 儘管AI代理能夠自動生成程式碼和執行任務，但人工的監控和審核仍然不可或缺。開發者應定期檢查AI生成的程式碼品質、功能正確性和安全性。AI生成的內容可能存在邏輯錯誤、效率低下或不符合最佳實踐的情況。因此，將AI視為高效的協作者而非完全自主的決策者，並準備好進行必要的修正和優化，是確保專案成功的關鍵。\n-   **探索Cursor的進階功能**: 充分利用Cursor IDE提供的AI代理管理介面，了解如何啟動、停止、監控和調整背景代理的行為。Cursor作為專為AI設計的IDE，其許多功能都旨在優化AI協作體驗。深入學習這些功能，將有助於更高效地管理AI團隊，並發揮其最大潛力。\n\n---\n\n## **相關資源與延伸閱讀**\n-   **Claude Code官方網站**: 了解Claude Code的最新功能、模型能力和使用指南。這是該工作流中「資深開發者」的核心工具，深入了解其特性有助於更有效地利用它。\n-   **Cursor IDE官方網站**: 探索Cursor IDE的詳細功能，特別是其AI代理、背景代理和AI原生開發環境的設計理念。理解Cursor如何作為AI協作的平台，是實踐此工作流的基礎。\n-   **3JS官方文檔**: 如果對3D網頁開發感興趣，3JS的官方文檔提供了豐富的教程和API參考，有助於理解影片中3D房間和虛擬人偶的技術實現細節。\n-   **OpenAI API文檔**: 了解OpenAI API的各種模型、使用方法和最佳實踐。這對於實現AI驅動的聊天功能、自然語言處理或其他智慧應用至關重要。\n-   **Git/GitHub基礎教程**: 對於不熟悉版本控制的開發者，學習Git和GitHub的基礎操作是必不可少的。掌握程式碼的提交、分支、合併和遠端同步，是多AI代理協同工作的前提。\n\n---\n\n## **總結與未來展望**\n這段影片所揭示的AI協作開發工作流，不僅僅是一種技術技巧，更是對未來軟體開發範式的一次深刻預演。它將AI從單純的輔助工具提升為一個具備專業分工、能夠並行處理任務的「智慧團隊」。透過「資深開發者」Claude Code負責核心架構，「AI實習生」處理細節功能、安全與行銷，以及概念中的「AI執行長」進行宏觀協調，這種模式極大地提升了開發效率，實現了從單點突破到全面加速的轉變。其核心價值在於**將複雜的開發流程模組化、平行化，並透過AI代理進行自動化執行**，從而將開發者從繁瑣的編碼細節中解放出來，使其能夠專注於更高層次的設計、創新與策略。\n\n展望未來，這種多代理AI協作模式將會持續演進，帶來更多令人興奮的發展：\n-   **更精密的AI協調與溝通**: 未來的AI代理將不僅能並行工作，還能更智慧地相互溝通、協調任務，甚至自主解決衝突，實現更無縫的協作。\n-   **自適應與自我優化**: AI代理可能會具備學習和自適應能力，根據專案的實際進度和需求，動態調整任務分配和執行策略，甚至自主優化程式碼和架構。\n-   **全生命週期自動化**: 從需求分析、設計、編碼、測試、部署到監控和維護，AI將逐步滲透並自動化軟體開發的每一個環節，實現真正的「自動化工廠」。\n-   **人類-AI協作的深度融合**: 開發者將不再是單純的程式設計師，而是AI團隊的「指揮家」或「產品願景師」。人類的創造力、批判性思維和領域知識將與AI的執行效率、數據處理能力完美結合，共同推動軟體產業的發展。\n-   **AI驅動的商業創新**: 隨著開發週期的縮短和成本的降低，企業將能夠更快地將創新理念轉化為實際產品，加速市場驗證和迭代，從而催生更多「印鈔機般的應用程式」，甚至顛覆現有的商業模式。\n\n總之，這種多代理AI工作流為軟體開發帶來了一場生產力革命，它不僅改變了我們開發應用程式的方式，更預示著一個由AI深度參與、高度自動化和極致高效的開發新時代的到來。",
      "transcript": "Everyone knows Claude Code is the most powerful AI coding tool ever made. But what if I told you there's a secret workflow I discovered that will help you build money printing apps 10 times faster? In this video, I'm going to go over that workflow step by step. And if you stick with me until the end, I personally guarantee you, you'll be building significantly faster with Claude Code. Let's get into it. So this right here is the gist of the top secret workflow I'm going to be showing you in this video. Basically, what we're going to be doing is spinning up a bunch of AI agents with Claude Code that are going to be working with us to build our apps significantly faster than if you were just using Claude Code. The first thing I'm going to do is show you how we're going to use Claude Code as a senior developer for our app. Then I'm going to show you how we're going to spin up a bunch of interns to do small little tasks for us while Claude Code is working. And as all those developers are going and building for us, I'm going to show you how we'll spin up a ultra smart CEO that's going to be running our business for us and orchestrating all the AI agents as we go. I promise every step of this is about to blow your mind. So let's start with our senior developer who'll be building the main part of our app for us. What we're going to do is we're going to open up Claude Code inside a cursor. Cursor is free. Make sure to get that. And then Claude Code, I'll also have the link down below if you don't have that yet, which you're crazy if you don't have that yet. We're going to open this up in cursor. So once you have your terminal open in cursor, make sure you type in Claude after you've gotten Claude Code installed. That will open up Claude Code and we're good to start going with our senior developer. So Claude Code in this workflow is going to be our senior developer that will be scaffolding out our app. So we start here before we start hiring our interns to do little tiny tasks. So let's start building out our app with Claude Code. What we're going to build in this video is a 3D world where we'll have AR avatars we can talk to. So as our senior developer, Claude Code will go scaffold out our app, build out all the main functionality, and then we'll move on to our interns after to start building on top of that. So here's the prompt I put in to build this app. Feel free to build this app along with me. The best way to learn is to build along. I want to build a 3D room with 3JS. 3JS is a really nice 3D framework for JavaScript that helps you build 3D worlds very easily. In this 3D room will be an avatar we can talk to. This avatar will be powered by the OpenAI API so we can chat with it and ask it questions. Please just build the room, the avatar, and the AI functionality so we can talk to the avatar. We're just going to have our developer to start building out the app for us. Then we're going to go into the interns and the CEO. So I hit enter on that. Any main functionality, any main coding, any big features we build out will all be done with our senior developer, which is Claude Code. Because Claude Code is by far the smartest coding AI out there, it's going to be the best at building out really big functionality like what we just gave it here. I did this all in planning mode so that we can quickly read over the plan, but it looks like they're going to set up the app. They're going to build the front end structure, the back end structure, as well as all the 3D and chat functionality. Read that over. Looks good to me. And let's hit enter. And that's going to start building out with our senior developer. As our senior dev works, now I'm going to show you the next part of our workflow, which is going to be our army of AI agent interns that are going to tackle all our other tasks for us. So our senior dev, who I just introduced you to, is going to do any sort of main functionality we want in this app. But now what we're going to do is we're going to utilize brand new functionality inside Cursor to start spinning up intern agents that are going to do work for us while our developer works. These interns are going to be amazing at setting up small pieces of functionality in our app. So we can have an intern go and start putting decorations in our 3D room. We can have an intern go and start putting in small features like model pickers so we can have our avatars use different AI models. We're going to spin an intern up that's going to go and do marketing research for us and write us tweets for our announcement video. We're going to have a security intern that I'll show you how to spin up that's going to go and make sure our app's secure. We're going to have a whole army of AI agent interns supporting our senior dev. This is going to unlock productivity you've never had before when building with AI. And real quick before we spin up our interns, in order to get our interns working, we need to have our code on Git. It's a requirement of background agents in Cursor to have your code on Git. So real quick, I'm going to show you how to get this code on there. Feel free to go to github.com real quick and set up an account if you haven't already. Then once you've set that up, make sure to create a new repository. I'm going to call this 3D avatar. We're going to make this private and then I'm going to create the repository. Now we have a URL for our GitHub. All we got to do is press copy on that. Once we have that URL, all we have to do is go back to our senior developer and say, please push this to GitHub. And then we paste in the URL that we just got from the other screen. You hit enter on that and our senior dev will go and push this code to GitHub so we can start spinning up our AI intern agents. Make sure to just hit yes along the way as it's going. All right, so we have our code on GitHub. Our senior developer is working to set up our application. Now let's spin up those interns so we can have a bunch of employees working on our app at the same time. And this is going to write code faster than you've ever seen before. So here's how we spin up our interns that will be supporting the senior dev. You're going to open up your cursor sidebar. That's why it's really important you open up Claude code and cursor is because you can unlock all this other functionality inside cursor. So inside our AI agent side panel in cursors, this little cloud icon here at the top. These are your background agents. These are going to be the interns that are going to work for us and support our senior dev. So I'm going to show you how to set up four AI agent interns, but you can set up as many or as few as you want. So I'm going to set up two interns to build out functionality for us. I'm going to set up two interns. One will be our security intern. The other is going to be our marketing intern. So let's start building out some feature interns first. So let's build out these interns. First one I'm going to have build out 3D decorations in our 3D space. So I said, I want you to build out 3D decorations in our space. Please put chairs and plants in our space. So you hit enter on the command and our background agent, our interns going to get to work. You see this there, the interns working. So it's building out the code for us. Let's spin up a couple more interns. So I'm going to do another one. I want you to put a model picker on the screen so I can change the AI model of the avatar. Boom, that interns going. We now have two interns working for us. Now let's spin up a third intern. These next two are critical. I always like to have a marketing and a security intern going just to make sure our app is secure. There's no holes that when we ship this to production, it can get hacked. And also just to come up with ideas for marketing. So we're going to say, I want you to be our security intern. Please check our app for best security practices. Boom, spin up another. Now we have three AI agent interns going for us. And then lastly, let's do our marketing intern. You're our marketing intern. Please build a marketing plan and write some tweets. Boom, hit enter on that. Four AI agent interns going. So just to recap what we've got going on so far in our workflow, we have Claude Code, our senior dev, building out our 3D environment. And now we have four AI agent interns who are building out small functionality for us. Two are building out features. One is checking on security, which is really, really important. And the other is building us a marketing plan all at the same time. What you were doing before, if you're just using Claude Code or just using Cursor, is you were handholding one AI the entire time, building one single path. Now we have an army of agents working for us and building out our app simultaneously, which is way faster. But we're not even done yet. We still have another stage of our workflow to go, which is our CEO. I'm going to show you how to spin up a CEO in a second and how we're going to use it. But before we get to the final part of our top secret workflow, let's check in on our senior dev real quick, see how they're doing and see if they finish setting up our app. Looks like our senior developer finished their work. One small thing we'll have to do here is add our OpenAI API key to our .env file\n\n",
      "model_used": "gemini-2.5-flash-preview-05-20",
      "processing_time": 95.83019304275513,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-07T04:01:37.811871",
    "updated_at": "2025-07-07T04:03:13.644421"
  },
  {
    "id": "ahmy1P94eTKoLz1M2i0-dg",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=mT9wuGpgWSs",
    "timestamp": 1753751977.2521868,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1753752508.527123
    },
    "result": {
      "title": "0050創新高了，然後呢...你還在等什麼？【0050動態提領三大規則深度解析】",
      "summary": "## **主要觀點與核心價值**\n\n本次影片深入探討了台灣投資市場中兩個核心議題：**市值型ETF（以0050為例）的長期投資策略**，以及**退休金的動態提領機制**。講者以其獨特的風格，強烈主張投資人應摒棄「高點恐懼症」的迷思，並透過歷史數據回測，證明當0050等市值型ETF創新高時，長期持有反而能帶來更高的勝率與報酬率。這挑戰了許多投資人對於「追高」的傳統擔憂，強調了**市場長期向上**的本質與**時間作為風險過濾器**的重要性。\n\n其次，影片深度解析了由蓋頓（Guyton）與克林格（Klinger）共同創立的**GK動態提領策略**。相較於傳統固定提領的「4%法則」，GK策略引入了**「護欄」機制**，透過「通膨規則」、「保本規則」與「繁榮規則」三大核心原則，使退休金提領金額能根據市場表現與投資組合價值進行彈性調整。這不僅能有效延長退休金的壽命，避免在市場下跌時過度提領導致破產，也能在市場上漲時適度增加提領金額，提升退休生活的品質。講者透過具體的三年實例演練，將複雜的規則轉化為易於理解的操作步驟，展現了GK策略的實用性與智慧性。\n\n影片的核心價值在於提供了一套**基於實證數據的投資與提領哲學**。它不僅僅是知識的傳遞，更是一種**心態的重塑**。講者堅定地推廣**總報酬投資法**，認為市值型ETF無論在資產累積期或退休提領期，都優於高股息ETF，因為更高的總報酬能加速財富累積並提升提領效率。這種觀點直接挑戰了台灣市場中普遍存在的「退休後買高股息求現金流」的迷思。此外，講者對於「定能兒」（指那些過於悲觀、只敢定存的投資人）的諷刺性稱讚，雖然語氣強烈，卻也間接傳達了**投資應與自身風險承受能力及心態相符**的訊息，並鼓勵投資人培養**成長性思維**，主動學習與實踐。整體而言，這是一份旨在賦能投資人，使其能更理性、更有效地規劃長期財務目標的專業指南。\n\n---\n## **內容大綱**\n\n1.  **0050創新高迷思與還原股價解析**\n2.  **0050與0056的績效對比及機會成本分析**\n3.  **創新高後的投資行為與歷史回測數據**\n4.  **GK動態提領策略的背景與核心原理**\n5.  **GK動態提領三大規則深度解析**\n6.  **GK動態提領實例演練與應用場景**\n7.  **市值型ETF在人生兩大階段的應用哲學**\n8.  **講者立場與「定能兒」的心理學分析**\n\n---\n## **關鍵術語與概念**\n\n-   **還原股價 (Adjusted Share Price)**: 指將股票或ETF歷年來的除權息、分割等事件所造成的股價變動，透過股利再投入的方式，還原成一個連續性的股價走勢。它能真實反映投資人從頭到尾持有並將所有股利再投入後的總報酬表現，是衡量長期投資績效的更準確指標。\n-   **機會成本 (Opportunity Cost)**: 指在做出某項決策時，所放棄的次優選擇可能帶來的利益。影片中用於比較0050與0056的投資選擇，強調選擇0056可能錯失了0050帶來的更高報酬。\n-   **高點恐懼症 (Fear of Highs)**: 一種投資心理現象，指投資人因擔心股價已在高點而不敢買入，或急於賣出獲利了結，錯失市場長期上漲的機會。影片透過數據回測駁斥此迷思。\n-   **GK動態提領 (GK Dynamic Withdrawal)**: 由美國退休規劃專家蓋頓（Guyton）與電腦科學家克林格（Klinger）共同創建的一種退休金提領策略。它透過設定「護欄」及三大規則，使提領金額能根據投資組合的實際表現進行動態調整，以延長退休金壽命並兼顧生活品質。\n-   **4%法則 (4% Rule)**: 一種廣為人知的退休金提領策略，指每年從退休金總額中提領4%，並隨通貨膨脹調整。其假設是此提領率能讓退休金在30年內不致用罄。GK動態提領是其更具彈性的替代方案。\n-   **護欄 (Guardrail)**: GK動態提領策略中的上下限機制。當當前提領率超出初始提領率的特定百分比（例如±20%）時，會觸發提領金額的調整，如同保齡球道的護欄，防止「洗溝」（退休金用罄）或「溢出」（過度保守）。\n-   **當前提領率 (Current Withdrawal Rate)**: 指當前欲提領的金額除以當前投資組合的總價值。這是GK動態提領策略中判斷是否觸發調整規則的核心指標。\n-   **市值型ETF (Market-Cap Weighted ETF)**: 根據成分股的市值大小來決定權重，追蹤大盤指數（如台灣加權股價指數）的指數股票型基金。影片中以0050為例，強調其代表台灣整體經濟成長，具有長期向上趨勢。\n-   **定能兒 (Fixed Deposit Savvy Child/Person)**: 講者自創的詞彙，原意指「定存能力很強的兒童」，用來諷刺那些過於悲觀、只敢將資金存放於定存而錯失股市長期成長機會的投資人。後期被講者重新詮釋為一種「稱讚」，意指其心性穩定、擅長定存。\n\n---\n## **重要引述與案例**\n\n> \"當0050整個大盤台股創新高的時候，他不是高點，他反而是個低點。每一次0050創新高，市場就會有一些酸民開罵你聽流群你又要再害人了，害人要被套又要追高了，害人要接盤了，但是我們來看這張圖，這專門打臉這些低能額有高點恐懼症的韭菜。\"\n**分析**: 此引述直接挑戰了投資人普遍存在的「高點恐懼症」心理。講者透過歷史回測數據（圖表顯示0050還原股價創新高後，持有一年、三年、五年、十年的勝率分別為73%、82%、82%、100%），證明創新高並非危險訊號，反而是市場具備續航力、長期向上的象徵。這段話的背景是市場對0050創新高的普遍擔憂，講者以數據為依據，堅定地反駁了「追高必套」的傳統觀念，強調長期持有在股市成長中的重要性。其語氣雖然激進，但旨在破除迷思，鼓勵投資人以更宏觀、數據導向的視角看待市場。\n\n> \"市場只獎勵樂觀投資人，悲觀投資人只適合當定能兒。\"\n**分析**: 這句是講者的「名言」，貫穿其頻道的核心投資哲學。它不僅僅是一句口號，更深層次地揭示了投資中**心態的重要性**。在長期向上的股市中，悲觀和畏縮的投資人往往會錯失機會，或因恐懼而過早離場，最終收益不如那些願意承擔風險、保持樂觀並長期持有的投資人。此處的「定能兒」最初帶有貶義，諷刺那些因過度保守而錯失成長機會的人。然而，在影片結尾，講者又將其重新詮釋為一種「稱讚」，意指「定存能力很強的兒童」，強調這也是一種心性穩定、萬中無一的能力。這種轉變反映了講者在傳達其投資理念時，既有批判性，也試圖在最終達成一種「和解」，即尊重不同投資人的風險偏好和選擇，但仍堅定地推廣其認為更優的策略。\n\n---\n## **詳細內容分析**\n\n### **0050創新高迷思與還原股價解析**\n影片開篇即點出0050創新高的熱門話題，並迅速引入**「還原股價」**這一關鍵概念。講者解釋，0050的「還原股價」早已屢創新高，這與許多投資人僅關注原始股價圖的認知不同。還原股價的意義在於，它將ETF每次配息、分割或除權除息等事件所造成的股價下跌，視為股利再投入，從而計算出**如果投資人從頭到尾持有並將所有股利再投入後的總資產價值變化**。這代表了投資人實際持有的總報酬走勢。例如，當0050配息2元，股價從100元跌至98元，原始股價圖顯示下跌，但實際上投資人手裡多了2元現金，總價值並未改變。還原股價正是將這2元加回，呈現出更真實的資產成長軌跡。透過展示0050過去20多年還原股價圖上密密麻麻的紅色創新高點，講者強調了其長期穩健的成長性，為後續的投資策略分析奠定基礎。\n\n### **0050與0056的績效對比及機會成本分析**\n講者在此部分對0050與0056進行了鮮明的對比，並強烈批判了高股息ETF（如0056）。他展示了0056從2020年至今的還原股價圖，指出其在2024年7月經歷一波下殺後，至今（2025年7月18日）仍未創新高，即使股息再投入也未能恢復。這與0050密密麻麻的創新高點形成鮮明對比。講者認為，0056的**成長性不足**，其創新高動能「非常不給力」。他強調，投資決策應考慮**機會成本**，即選擇0056意味著放棄了投資0050可能獲得的更高報酬。他駁斥了「5056不能比」的觀點，認為兩者作為台股ETF，理應放在一起比較其總報酬表現。講者語氣激昂，旨在破除「高股息等於安心」的迷思，強調總報酬才是衡量投資績效的最終標準。\n\n### **創新高後的投資行為與歷史回測數據**\n此部分是影片的核心論點之一，旨在破除投資人對「高點」的恐懼。講者提出一個反直覺的觀點：**當0050創新高時，它不是高點，反而是個低點**。他透過歷史回測數據（右下角圖表），展示了當0050還原股價創新高後，若當天買進並持有一年、三年、五年、十年，其平均績效和勝率表現。數據顯示，持有一年的勝率為73%，三年和五年均為82%，而持有十年勝率高達100%，且平均報酬率隨時間大幅增加（一年約+9%，三年約+23%，五年約+55%，十年飆破+140%）。這項實證結果強烈反駁了「高處不勝寒」或「追高必套」的觀點，證明**長期持有是克服市場波動、實現穩定報酬的關鍵**。講者將時間比喻為「最強的風險過濾器」，強調股市長期伴隨經濟成長、企業獲利提升，創新高是趨勢的體現，真正的風險是不敢投入或急於賣出。\n\n### **GK動態提領策略的背景與核心原理**\n在進入GK動態提領的詳細規則前，講者首先介紹了其背景。GK動態提領是由美國退休規劃專家蓋頓（Guyton）與電腦科學家克林格（Klinger）共同創建，其名稱G與K即取自兩位創始人。它與廣為人知的**4%法則**形成對比。4%法則是一種固定提領策略，每年提領固定金額並隨通膨調整，主要應用於提早退休和財務自由運動。然而，GK動態提領則是一種**動態調整策略**，也被稱為**「護欄（Guardrail）」策略**。其核心原理是根據投資組合的當前價值百分比來調整提領金額，設定上下限，確保退休金不會「洗溝」（用罄）。講者以「小孩子打保齡球有護欄」的比喻，生動地解釋了GK策略如何防止退休金在市場波動中耗盡，實現「一輩子都不會洗溝」的目標。\n\n### **GK動態提領三大規則深度解析**\n講者將GK動態提領的四條原始規則簡化為三條核心規則，並進行了深入剖析：\n1.  **投資組合管理規則（簡化為資產再平衡）**: 這條規則主要關於資產配置。每次提領時，應順帶進行再平衡，優先從比例過高的資產中提領現金，必要時才從比重過低的資產提領。這確保了投資組合的健康與穩定。\n2.  **通貨膨脹規則**: 規定了提領金額是否能隨通膨調整。如果前一年投資組合總資產虧損，則當年年初提領金額不能隨通膨調整；如果前一年有獲利，則可以隨通膨調整，但上限為6%。這確保了在市場不佳時能保守提領，避免加速耗盡。\n3.  **保本規則與繁榮規則（護欄機制）**: 這兩條規則是GK策略的核心。\n    *   **保本規則**: 當市場下跌導致投資組合總價值下降時，當前提領率會上升。若當前提領率比初始設定的提領率高出20%以上，則必須將當前提領金額下調10%。這避免了在市場低谷時過度提領，保護本金。\n    *   **繁榮規則**: 當市場上漲導致投資組合總價值暴增時，當前提領率會下降。若當前提領率比初始設定的提領率低於20%以上，則必須將當前提領金額上調10%。這避免了在市場繁榮時過於保守，讓退休金花不完而留下過多遺產稅。\n這兩條規則共同構成了「護欄」，確保提領金額在合理範圍內浮動，如同開車的「油門與剎車」，讓退休之路開得穩、開得久。\n\n### **GK動態提領實例演練與應用場景**\n為了讓觀眾徹底理解GK動態提領的實操細節，講者透過一個**三年的假設案例**進行了詳細演練。\n*   **第一年**: 初始退休金1000萬，設定提領率5%，提領50萬，剩950萬。這是基礎年，無規則觸發。\n*   **第二年**: 年初投資組合上漲40%（從950萬變1330萬）。根據通膨規則，提領金額從50萬調整為51.5萬（50萬*1.03）。計算當前提領率：51.5萬/1330萬 ≈ 3.87%（約3.9%）。由於初始提領率5%的護欄為4%至6%（5%*0.8=4%，5%*1.2=6%），3.9%低於4%下限，觸發**繁榮規則**。系統自動將提領金額上調10%（51.5萬*1.1 = 56.7萬）。最終提領56.7萬。\n*   **第三年**: 年初投資組合大跌30%（從1273.3萬變891萬）。由於前一年虧損，根據通膨規則，提領金額不能隨通膨調整，維持前一年的56.7萬。計算當前提領率：56.7萬/891萬 ≈ 6.36%（約6.4%）。由於6.4%高於6%上限，觸發**保本規則**。系統自動將提領金額下調10%（56.7萬*0.9 = 51萬）。最終提領51萬。\n這個案例清晰地展示了GK動態提領如何根據市場變化自動調整提領金額，實現風險控制與生活享受的平衡。講者還提到，GK提領可以實現「月月配」、「周周配」甚至「日日配」的效果，只需年初提領一筆金額後自行分配。\n\n### **市值型ETF在人生兩大階段的應用哲學**\n講者在此部分再次強調其核心投資理念：**市值型ETF適用於人生的兩大階段——資產累積期間和退休提領期間**。他堅決反駁了坊間「年輕時用市值型ETF，退休後買高股息」的說法，認為這是一種「屁話」。其理由是，ETF的**總報酬越高**，在資產累積期間能更快達到財務目標（如提早退休、買房、教育金），而在退休提領期間，更高的總報酬則能讓初始提領率更高，提領金額更豐厚，且能讓資金使用更久。他指出，先鋒集團（Vanguard）等多家機構的研究也打臉了退休後使用高股息或高收益商品的策略，因為這些商品可能帶來更高的機會成本和潛在風險。因此，講者倡導一種**貫穿人生始終的總報酬提領法**，以市值型ETF作為核心工具，實現全面的財務規劃。\n\n### **講者立場與「定能兒」的心理學分析**\n講者在影片中展現了極其鮮明的個人立場和溝通風格。他堅定地看好台股長期向上趨勢，並強烈推崇0050等市值型ETF，同時對高股息ETF和悲觀的市場觀點持批判態度。他多次使用「定能兒」（定存能力很強的兒童）一詞來形容那些對股市悲觀、只敢定存的人。這個詞彙最初帶有諷刺意味，旨在激勵聽眾克服恐懼、擁抱成長。然而，在影片的結尾，講者對「定能兒」進行了重新詮釋，稱其為一種「稱讚」，意指擁有「心性穩定、定存能力很強」的特質，甚至鼓勵觀眾將其視為一種「家族的象徵」傳承下去。這種語氣上的轉變，一方面是講者獨特的幽默感和溝通策略，另一方面也暗示了投資策略並無絕對優劣，關鍵在於**與個人心性、風險承受能力相匹配**。他雖然極力推廣自己的理念，但也最終承認「人各有志」，不強求所有人都接受，但仍希望透過數據和邏輯，幫助那些願意學習和成長的投資人。\n\n---\n## **實踐應用與建議**\n\n-   **建議1: 克服「高點恐懼症」，擁抱長期持有市值型ETF。**\n    *   **詳細說明**: 影片數據顯示，0050在創新高後，長期持有（3-10年）的勝率和報酬率極高。這意味著投資人應摒棄「追高」的心理負擔，認識到股市長期向上的本質。當市場創新高時，應視為趨勢的延續，而非立即回檔的訊號。\n    *   **實施方法**: 建立定期定額投資市值型ETF的習慣，無論市場高低點都堅持投入。在市場創新高時，保持冷靜，不因恐懼而停止投資或急於獲利了結。將投資時間拉長，讓時間成為最強的風險過濾器。\n\n-   **建議2: 學習並應用GK動態提領策略於退休規劃。**\n    *   **詳細說明**: GK動態提領策略提供了一種比傳統4%法則更具彈性且更永續的退休金提領方式。它能根據市場表現自動調整提領金額，避免在市場下跌時過度提領導致破產，也能在市場上漲時適度增加支出，提升生活品質。\n    *   **實施方法**:\n        1.  **理解三大規則**: 熟練掌握通膨規則、保本規則和繁榮規則的觸發條件與調整機制。\n        2.  **設定初始提領率與護欄**: 根據自身情況設定合理的初始提領率（例如5%），並計算出上下20%的護欄範圍。\n        3.  **每年年初計算與調整**: 每年年初，計算當前的投資組合總價值和當前提領率，並根據GK規則判斷是否需要調整當年的提領金額。\n        4.  **資產再平衡**: 在提領時，順帶進行資產配置的再平衡，優先從比例過高的資產中提領。\n\n-   **建議3: 培養成長性思維，主動學習與驗證。**\n    *   **詳細說明**: 講者強調「成長性思維」的重要性，鼓勵投資人像那位自行編寫Python程式碼驗證GK策略的觀眾一樣，主動尋找答案、驗證理論。這不僅有助於理解複雜的投資概念，也能在生活中培養解決問題的能力。\n    *   **實施方法**:\n        1.  **不盲從**: 對於任何投資建議，都應抱持懷疑態度，並主動尋找數據和實證來驗證。\n        2.  **動手實踐**: 嘗試用Excel或程式碼模擬回測不同的投資或提領策略，加深理解。\n        3.  **持續學習**: 關注可靠的金融資訊來源，閱讀相關書籍和研究論文，不斷更新自己的知識體系。\n\n---\n## **相關資源與延伸閱讀**\n\n-   **資源1: GK動態提領原始論文 (Guyton & Klinger)**\n    *   **資源說明和價值**: 這是GK動態提領策略的理論基礎。深入閱讀原始論文能幫助理解其背後的數學模型、假設條件以及更詳細的規則設定。對於希望精確實踐或進一步研究的投資人，這是不可或缺的學術資源。\n-   **資源2: 先鋒動態提領準則 (Vanguard Dynamic Spending Rule)**\n    *   **資源說明和價值**: 影片中講者提及的另一種「簡單又暴力」的動態提領策略，由先鋒集團提出。雖然講者提到其論文已絕版，但先鋒集團的官方網站或相關研究報告中，仍可能找到其核心概念和實證結果。這為投資人提供了GK之外的另一種動態提領選擇，可能更適合追求簡潔的實踐者。\n-   **資源3: 台灣市值型ETF (如0050) 相關資料**\n    *   **資源說明和價值**: 深入了解0050的成分股、追蹤指數、管理費用、歷史績效等。可透過投信官網、證券交易所網站或財經資訊平台獲取。這有助於投資人建立對其投資標的的基本認知，並理解其作為台灣大盤代表的意義。\n-   **資源4: 《心態致勝》(Mindset: The New Psychology of Success) by Carol S. Dweck**\n    *   **資源說明和價值**: 講者在影片中提及的書籍，強調「成長性思維」與「僵固性思維」的差異。這本書能幫助投資人從心理層面理解為何有些人能持續學習和成長，而有些人則停滯不前。對於培養積極的投資心態、克服心理障礙具有重要啟發意義。\n\n---\n## **總結與未來展望**\n\n本次影片的核心價值在於為投資人提供了一套**基於實證數據、挑戰傳統迷思的投資與退休規劃框架**。講者透過對0050創新高後績效的深度回測，有力地駁斥了「高點恐懼症」，強調了**長期持有市值型ETF**在股市長期向上趨勢中的巨大潛力。這不僅是關於數字的分析，更是對投資人心理建設的呼籲，鼓勵大家培養**樂觀且數據導向的投資心態**。\n\n更為關鍵的是，影片詳細解析了**GK動態提領策略**，為退休金的永續提領提供了一條智慧之路。相較於僵化的4%法則，GK策略的「護欄」機制，透過通膨、保本、繁榮三大規則的動態調整，有效平衡了退休生活的品質與資金的壽命。這套策略的實踐，將使退休金管理從被動的消耗轉變為主動的風險管理與收益優化。\n\n展望未來，隨著金融科技的發展和數據分析能力的提升，動態提領策略有望變得更加普及和易於操作。我們可以預見：\n1.  **個人化動態提領工具的普及**: 未來可能會出現更多整合AI和機器學習的金融科技平台，能根據個人風險偏好、資產狀況和市場實時數據，提供高度個人化的動態提領建議和自動化調整功能。\n2.  **總報酬投資理念的深化**: 隨著年輕一代投資者對全球市場和指數化投資的接受度提高，市值型ETF作為核心配置的理念將會更加深入人心，高股息與總報酬之爭將持續，但數據將會是最終的裁判。\n3.  **跨資產類別的動態提領**: 目前主要針對股票型資產，未來可能會有更複雜的動態提領模型，納入債券、房地產、另類投資等多種資產類別，以實現更全面的退休金管理。\n4.  **心理學與行為經濟學的結合**: 投資教育將更加注重心理層面的引導，幫助投資人克服貪婪與恐懼，培養長期主義和成長性思維，這也是講者在影片中不斷強調的重點。\n\n總之，這份專業筆記不僅提供了實用的投資策略和工具，更啟發我們以更宏觀、更理性的視角看待市場，並為自己的財務未來做出更明智的決策。",
      "transcript": "喂 麥克風測試 聲音可以嗎大家?聲音可以的打個加一沒聽到打加零今天我們一開始要先來聊0050創新高了我們現在該做什麼要一部分獲利了結嗎?還是繼續抱著?還是要用所謂的調節移動式停利?我們今天一次採解之後直播的最後也會給出乾貨就是我們要解析我上一部影片0050動態停利一輩子三大規則的深入採解創新高了 有人還在被套牢嗎?我問一下大家還有人在被套著嗎?還有被套著的朋友嗎?對 有人說他是停利減碼了因為現在真的創新高了我們來看一下0050的股價創新高其實他的還原股價各位有聽過四個字嗎?還原股價0050的還原股價早就已經創新高了我秀給大家看一下右下角這張圖是0050從03年6月30號成立到現在2025年7月18號的還原股價藍色線 淺藍色線就是他還原股價的每日收盤價的走勢紅色點點就是還原股價0050創新高的點那有些人可能沒有聽過還原股價是什麼意思還原股價講的就是說股票0050ETF他的成分股會有股利的發放那0050他每次在配息的時候或者是分割的時候或一些除息除權的事件都考慮進去的時候是不是每次除息股價都會下跌那還原股價講的就是說你計算出如果你從頭到尾都持有而且每一次都把股息再投入再投入所有的股利之後的價格還原的表現那當我們去看一檔ETF或股票他的還原股價等於就是你把這兩塊錢加回去讓我們看到的是你實際持有總報酬的走勢我們就以除息來舉例好了如果0050他的原始價格今年除息了配息了或者是分割了你價格會有所謂的跳空可是這不代表他真的下跌了而是所謂的左手配右手你資產他股價下跌的幅度就會變股利從我們本來的總資產的帳戶裡面變到你的口袋裡面了你的帳戶裡面像是0050發兩塊錢的股息假設他本來股價100塊好了那就會掉到98所以你原始股價圖看起來是跌了2%但是你實際上你手裡會多了兩塊的現金部位你的總價值是沒有變的那當我們去看一檔ETF或股票他的還原股價等於就是你把這兩塊錢加回去讓我們看到的是你實際持有總報酬的走勢也就是說他代表的是一位從頭持有到現在並且把所有的股息都再投入的投資人實際帳面上資產的價值變化這個就是0050過去20多年經歷這麼多次的多空循環他的還原股價的走勢你有沒有看到那個紅色的點密密麻麻的各位有看到嗎非常的密那我現在問問一下大家你們知道0056的還原股價長得像什麼樣子嗎我們來猜猜看0056的還原股價有觀眾可以畫的出來嗎舉個手我看一下看誰能猜到0056的還原股價我就秀我不要秀這麼久了我們來看一下0056他從2020年到現在的還原股價我們先不要看那麼遠我們先看從2020年開始我們來看一下因為是還原股價所以每一次配息都有再投入OK嗎不要說我什麼欺負0056不讓他股息再投入有時候我失誤而已那這張圖我們來看一下各位右下角這張就是0056的從2020年到現在7月18號的還原股價你有沒有發現他到去年2024年7月有一波下殺嗎下殺完之後呢你們有沒有看到現在有沒有紅色點點完全沒有所以代表什麼0056從去年7月那一波下殺到現在今年7月18號還沒創新高配息都股息都有再投入了因為這是還原股價這個是很嚇人的數據當大盤一直坐著電梯一直往上不斷創新高一高還要一高高的時候可是你的高股息卻完全沒有創新高大多時候都是盤整個一路向下的這個你要樂活派大叔派的人親何以堪這個不是我看後照鏡開車我講0050PK0056我從2020年第一部影片我記得在7月8月你們可以去翻就一路講到現在每一年都有老生常談這個不是什麼看後照鏡開車這個是我一路頻道推廣下來如果你當初你願意把你的資金撤出0056all in在0050你中間的機會成本你多賺了多少錢我問各位我就問大家你要這些高股息ETF的台股韭菜親何以堪也比較微笑像0050他的紅色點是密密麻麻的反觀0056大多時候紅色點是很稀疏的很稀少的很平淡的你光看\n\n你就可以发现0056就是因为他成长性不足他创新高的那种成长动能是非常不给力的所以千万你不要再买0056了我求你了拜托我拜托你了不要再跟我讲这种安心最重要的屁话不要再跟我说5056不能比了他们就是可以比你高中国中公民课都学过四个字机会成本当你做一个决策背后他另外一个你也可以做的决策变相的绩效变相的获利变相你应该获得的就是机会成本这是公民课教我们的那种玩偶万的那种基础的概念不要再跟我说这两个商品的品质不同不能一起比了他们就应该摆来一起比这个我不说了真的是我再怎么推广你看那个高股息568789199929那种受益的人数还是没有没有变少到现在我已经释怀了我不说了我们今天先进入重点不能被这种0056这种高股息ETF拖垮我直播的时间我们现在来分析一件事情当0050创新高之后的绩效是怎样我们各位猜一下你们会觉得聊天室的大家各位兄弟你们会觉得创新高之后会不会有点危险有点那种高点的感觉是不是应该要获利了解一部分移动式挺立分批挺你可以像all in一千万的0050我分个十批慢慢先挺一下有没有人这样觉得我一千万我分一百万一百万移动式挺立我现在创新高我先把一百万卖掉摆现金慢慢移动式挺立有没有人这样觉得吗分批调节这是比较符合人性的做法有没有人这样觉得聊天室的各位对有一个观众说高处不胜寒我们应该是要卖掉一部分先观望一下还是会有另外一派的人他的概念是比较趋势的看趋势的现在趋势一路往上我应该现在创新高就该all in我觉得有两个极端一个是比较风险趋避的一派投资人他觉得说高处不胜寒第二派的就是跟趋势做朋友的感觉现在已经创新高了往后的后市我大幅看好我应该all in加产all in开杠杆all in你们是属于哪一派我们来看回测结果最明显当0050创新高会发生什么事情我们各位观众我们看右下角这张图有看到右下角这张吗这是当0050的还原股价创新高之后一年三年五年十年你持有的绩效表现跟胜率浅蓝色就是你的持有一年三年五年十年的平均绩效红色的就是胜率你能不能赚钱的胜率就当你以为你在高点的时候是你太年轻了是你太年轻了你一个小屁孩毛都还没长齐的在股市的年资才五六年而已你太年轻了你会觉得说你买在高点在高点是高处不胜寒是你太年轻了你毛还没长齐翅膀还没有长出来看到这张图你就会知道当0050整个大盘台股创新高的时候他不是高点他反而是个低点每一次0050创新高市场就会有一些酸民开骂你听流群你又要再害人了害人要被套又要追高了害人要接盘了但是我们来看一下这张图这专门打脸这些低能额有高点恐惧症的韭菜这个不是我嘴炮这个就是实测我回测历史上所有创新高点当天买进分别持有一年三年五年十年的表现结果呢你们看结果呢然后呢毫不夸张几乎是无脑式的碾压胜率这个胜率是一边倒的倒到你会怀疑人生有看到右下角这张图吗你持有一年的胜率是73%三年是82%五年也是82%十年胜率百分之百当你创新高all in的时候没有一次是赔钱的你必赚根据历史回测当你创新高投入你是必赚十年的资料点有一百八十多个也是很足够的充足的观察的样本点你的胜率是百分之百不要再当高点恐惧症的韭菜了好不好求你了因为很多人他有那种我不知道这个心态是哪里来的就我每次我都会讲说两句话我一直在我粉专或者是YouTube社群IG我都会讲两句话你们知道哪两句吗市场只奖励乐观投资人悲观投资人只适合当只适合当定能儿有听过我这两句名言吗市场只奖励乐观投资人悲观的投资人只适合当定能儿定存能力很强的儿童简称定能儿这两句名言大家跟我念一遍你们必须像九九惩罚那样背起来我的这两句名言定能儿定存能力很强的儿童所以不要打破现在打破这迷思很多人只要听到创新高就会联想到什么高点要回档了可是数据显示只要当你持有期间拉长你的胜率跟报酬率反而是越来越稳定的有发现吗这个你们大家都可以验算一遍即便是你买在历史最高点最高点了只要你时间有耐心你的胜率长期持有就是高于七八成以上的一年后有73%的几率是赚钱的三年五年稳定在82%以上的胜率\n\n10年竟然沒有任何一次的虧損樣本點高達了188次188次的ALL IN10年都沒有任何一次賠錢創新高不是危險訊號創新高在長期投資下反而是市場有續航力長期向上的象徵那我們來看平均報酬平均績效好了平均報酬率顯示時間就是你最強的風險過濾器你只要願意長期持有管你創不創新高你持有時間只要拉長你平均報酬就會大幅增加一年後大約正9%三年後翻到加23%五年後再衝高到正55%十年後飆破正140%所以很多韭菜很多那種悲觀的韭菜悲觀的達人跟老師0050不適合你0050不適合你你不要買0050了我求你你乖乖定存這是命令你們以後只要看到那種韭菜老師達人他很悲觀的看空的看壞台股後市的你在下面留言三個字定能額不用多說什麼就三個字你在下面留言定能額這三個字會解決一切的答案跟紛爭跟困擾不用跟人家起衝突衝突是不好的血流成河是不好的我不建議大家這麼做你去跟酸民互嘴什麼的你就留言三個字定能額就夠了你也不用你身邊有一些朋友啊同事家人親戚長輩他們跟你那種悲觀的韭菜你也不用說服他們你就跟他們說你乖乖定存你乖乖定存0050是很危險的你趕快回去當你的定能額我右上角的這個梗圖你也可以直接截圖下來發在你Line群的長輩群裡面你們家裡長輩群的Line群就發這張圖歡迎大家截圖你不用說服他們買0050這種商品不適合他們我拜託他們不要買0050這是命令你回去快點回去當定能額吧0050是很危險的你不要回去當你的定存能力很強的兒童歡迎大家截圖以後有人在靠邀你就把這張圖截給他你不用說服他們你只要截這張圖給他們附上三個字定能額所以一堆老師一堆定能額定能額型的老師四月就開始唱空到現在你就在下面打三個字定能額不用起衝突不用血流成河我們的頻道是以四個字為主軸的我們的精神是以和為貴修身養性不要跟別人起衝突就回三個字定能額可以嗎你也不用拜託他們說你要股市是長期向上你應該要看多才對不需要說服定能額你叫他們回去乖乖定存0050太危險不適合你我們不要跟別人起衝突好嗎我真心拜託大家衝突是不好的做人要修身養性好我們繼續把這張圖講解完之後我們就要進入乾貨動態體力對我們不需要說服任何的人所以很多人他害怕買在高點我也希望我這次的直播可以幫大家說服心魔就很多人他不是那種完全看空也不是完全看多的他有那種心裡還是會怕怕有點猶豫的可是我們要知道一件事就是說當你害怕買在高點的時候其實真正能幫助你的是只有長期持有而非你去刻意迴避創新高因為整個股市的長期向上它的高勝率高報酬本身就是股市結構的反應這不是什麼技術指標不是什麼市場情緒而是長期台灣股市的基本面成長的結果整個台灣大型權值股具備的全球競爭力股市長期伴隨著經濟成長GDP成長企業獲利提升創新高就是趨勢的體現所以真正的風險不是你買在創新高的點位不是你買貴真正的風險是你不敢投入你遲遲等待歸縮在場外不敢買進或者你買了就急著賣很想停利畏首畏腳一跌就看一漲就急著想要獲利了結這才是真正的風險這些數據都告訴我們當你持有的期間越長你的勝率就會越穩定這邊我要說明說十年的100%勝率雖然非常非常亮眼但也不是絕對的保證我們還是有一定的比例一定的股市的部位的比例要進行全球分散所以我希望我這張圖可以幫助大家克服那種高點的恐懼跟害怕下跌的焦慮創新高不是高點不是鑑定你回頭看創新高就是個低點可以接受嗎大家這個也不是我胡說八道這是過去20多年經歷這麼多次的多空循環它的勝率跟長期報酬的穩定性就是這麼強好可以嗎那我們繼續下一part其實我不是很知道目前台灣有哪一派的達人或老師比較屬於看空的因為我覺得他們的說法變化太多了你們知道是哪一個比較他們是長期可能過去一直都是比較看空的類型的人嗎其實我不太知道因為我覺得他們有時候看多有時候看空\n\n弄搞得我也蠻亂的台灣哪一個老師跟達人是比較屬於那種長期探空的其實我不是很知道那種穩定的啦穩定長期探空的對就一些觀眾他就是三個字定能額對搞得很亂就是一下看多一下看空的對聊天室有一些定能額我們也不需要跟他們爭辯就好吧恭喜你你是定能額回去趕快定存大盤ETF0050不適合你太危險了對說到這個也是我發現一個pattern有一個那種模式有個規律從我2020年頻道經營到現在創立到現在一直都有一個模式就是每一次每一次當我講all in的時候整個股市都是什麼很多人在罵的時候罵一罵過幾個月可能就會大跌或爆發一些事件然後我就被噴歪被噴歪之後過幾個月又創新高了那之後又一高還要一高高然後再過幾個月可能半年一年可能也會有小幅的回調然後我又被噴了噴完之後可能又過幾個月半年又創新高了我已經習慣了每一年過去五六年一直重複這個pattern對今年四月的時候我也是被噴歪我在Dcard版Dcard版股版PTT的股版都是被噴歪的但是時間總是打臉這些韭菜時間總是打臉這些定能額我們一起來奇聞共賞一下太多了我只截一些太多了太多了我不可能全截我不可能全截對太多了太多了你們有興趣的可以去翻一下這些定能額的論述太多了太多篇了今年四月三月那段時間太多篇了每一篇都是吵得血流成河的我們也可以看一些這些D能這些Dcard版的定能額跟PTT股版的定能額他們的論述有什麼可以讓我們借鑒引以為戒的地方我們不要跟他們起衝突我們可以從他們的一些犯的錯誤裡面學習成長然後下面留言都是你是滑不完的有興趣再看好了有興趣再看就可以了這些定能額的論述到現在短短三個月通通打臉啪啪啪完全打臉為什麼會有這些論述的存在我真的就是他們不相信股市是那種正和遊戲你知道嗎就是在股版的很多網友他們會覺得說股市就是那種短期的那種零和遊戲你們知道嗎有人賺就有人賠可是股市長期就是正和遊戲你賺的就是整體的經濟成長跟全體企業的盈餘獲利向上股市是超額報酬是零和遊戲可是它本身的績效它的長期報酬就是正和的聊天室總有定能額我也不會想要ban你你乖乖回去定存就可以了我的頻道0050不適合你你退訂吧這張圖是屬於定能額的禮物聊天室那種悲觀長期看空股市的你截完這張圖當你手機的桌面你就退訂我的頻道你回去當定能額我的頻道是很危險的不適合你OK我們不理這些定能額了我們不需要跟他們起衝突人各有志有些人就適合當定存很能力很強的兒童有些人就適合承擔風險換取股市長期向上的高報酬人各有志我們不需要強迫別人我們繼續我們上一次影片的那個動態體力我看大家對上一部影片動態體力是很動有那個三大規則我們我在這邊統計一下有完全理解的大概也不說完全理解就是你大概懂個七八成的你打個加一你完全不太懂我在說什麼的你打個加零你完全不太懂我在說什麼的你打個加零我做個我看個統計0050動態體力一輩子那支影片你對GK動態體力如果你懂個七八成的打個加一你完全看不懂我在講什麼的你打個加零因為我看下面留言很多人是不懂的其實很簡單我跟各位講其實很簡單你們大家聽我深入解析剖析你們會覺得這三大規則簡單到像一加一等於二的那種簡單程度其實真的很簡單我們來聊一下\n\n我這邊舉一個例子好了先幫大家理解一下GK動態提領的實操細節實際操作的細節該怎麼操作這個是我用Python畫出來我舉三年的例子輔助說明一下OK嗎那動態提領它有很多種十多種我覺得有幾種是比較好用的我之後也會陸續介紹那最著名的就是這個GK動態提領它是由美國的退休規劃專家它本身蓋頓它本身也是那種資產退休資產管理公司的負責人蓋頓跟電腦科學家克林格共同創建的所以這個GK動態提領的G跟K就是由他們這兩個著名專家來命名的那除了我相信大家比較常聽到的是4%法則這種固定隨通膨固定調整的固定提領策略那4%法則它為什麼出名就是在2020年放在提早退休財務自由的運動應運而生的就是說你該怎麼提早退休放在老闆30 40歲都提早退休背後其實內建著4%法則所以4%法則這個東西它出名的時候攻擊一時是在2020年我頻道早期影片也介紹了4%法則好幾部影片那有一個和它截然不同的因為4%法則它是固定那和它完全是走另外一個取向就是所謂的動態提領策略那也有人稱它是護欄Guardrail護欄因為動態提領策略它有一個觸發機制有個上下線那這個我們也稱之為護欄就是你要依照你當前投資組合的價值的百分比來進行提領你有超過那個護欄那我們就要進行提領金額的調整有點像什麼聊天室的大家有沒有看過那種小孩子小孩子在打保齡球的時候你們有沒有打保齡球就大人打保齡球跟小孩子打保齡球差在哪是不是小孩子那種打保齡球他不會洗溝他有那個溝上面有那個護欄有人看過嗎那個小孩子的保齡球的那個旁邊的護欄那動態提領策略就像是小孩子打保齡球你永遠不會洗溝我這樣解釋可以理解嗎你永遠一輩子都不會洗溝所以為什麼你可以靠動態提領一輩子因為你一輩子都不會洗溝他就是有個上下線右邊左邊有護欄你的保齡球怎樣都不會到那個洞裡面那其實我們來深入解析一下GK動態提領他本來有四條規則他被我簡化成三條因為第一條第一條是屬於資產配置的就是你每一次提領的時候你要順帶在平衡像如果去年台股漲的比台股美股漲的比非美的國際股是多的話你今年年初在提領的時候你就要順帶在平衡了你大部分的提領就要來自去年漲比較多的市場區塊他本來有四條規則他被我簡化成三條因為第一條叫投資組合管理規則其實很簡單就是資產配置的五個字順帶在平衡你的現金流提領要來自你本來比例過高的資產然後是現金最後必要時才是從比重過低的資產進行提領講簡單就是順帶在平衡他是整個資產配置架構的那我們真正要理解的是三大規則因為這個才是我們真正領出來要去注意的第二個規則通貨膨脹規則應該大家那時候看影片光看那個字面上的敘述我相信應該都能理解通貨膨脹規則講的就是說你前一年如果你的退休金的總total總資產的投資組合如果是虧損的你今年年初在固定在進行提領的時候你的金額就不能隨通膨進行調整相反的如果你去年前一年的退休金的總total你的投資組合的總資產是正的正報酬有賺錢的你今年年初在提領的時候就可以隨通膨進行調整可是你的上限是6%你不能說欸欸清流君美國你可能將來台灣爆發惡性通膨一年通膨給你正個8%可是上限就是6%你不能調整超過6%好這是第二條規則通膨規則各位可以理解嗎大家比較難理解的我覺得是最後兩條規則第三跟第四保本規則跟繁榮規則大家比較感到困惑是在這兩條規則保本規則講的就是說當市場下跌的時候可能去年爆發什麼股災市場回跳你的退休金的總total的總價值總資產會下降它會導致你因為去年大跌了跌完你今年年初要提領的時候你當前的提領率是不是會飆高因為你的提領金額除以你的總total你的分母是什麼下降的你提領率就會上升各位可以理解嗎你的當前提領率就會上升當你的當前提領率上升比你初始設定的超出20%的時候那你就必須把當前的提領率下調10%以避免你過度提領將來又遇到連續性的下跌的時候你很容易就是砍在阿呆股太多了你賣太多股了他避免這樣油盡燈枯的情況那繁榮規則第四個他的情況本質就跟保本完全相反原理是一樣的只是剛好相反而已你可以想去年大牛市AI爆發市場上漲個四五成你的退休金就會暴增一千萬暴增到一千四一千五都有可能你今年要提領的時候看到去年暴增了那你本來該提領年初該提領的額度除以退休金的總total除下去你的分母暴增了你兩個數字相除分母暴增的時候除下去你的數值你的比例就會下降當前提領率一除完就會下降當你降的太多比初始提領率低過20%的時候因為降太多了降的幅度超出了兩成那你就必須把當前提領率上調10%以避免退休金\n\n一路又遇到連環大牛市你一路花不完留一堆遺產繳給政府當遺產稅各位可以理解當前體領率這五個字嗎能理解之後我們去看我們接下來要講右上角這張實例好我們要講這個右上角的實例大家要專心一點這邊會有一點細節的地方最好最好你能拿起你的筆記本抄起來這邊會有一點數字比較多也不是比較難也很簡單只是數字會比較多各位要做好心理準備我們要正式上課了前面都在幹話也不是這樣我們要正式認真開始上課前面的定人兒也是很認真的我認真表達我的看法ok嗎現在是認真上課前面是認真闡述整個回測的理念回測的數據深入解析都很認真其實其實從上次很多看不懂就驗證了一件事有些人他是比較成長性思維的有些是比較僵固性思維的我記得我頻道之前解說過一本書叫做心態制勝可能有早期的頻道的觀眾可能看過我那部影片我講過一本書叫做心態制勝就有些人他會自己找答案有些人是好像我是他爸爸一樣我本來就該給你他的心態是這樣真的就是好像我是他爸一樣你知道嗎好像我就應該要手把手教你說兒子你現在站起來囉右手先撐不要跌倒奶嘴要怎麼吸用舌頭吸還是用牙齒咬就好像我應該要手把手教你把你當我的小孩一樣好像是我是你爸你知道嗎okok你覺得我應該把你教到手把手教到會你叫我爸爸好那我就教你我親自下海教你你叫聲爹我就手把手把你教到總會貫通因為我把你當我兒子有一些比較他是那種很有成長性思維的他會自己像如果我今天是我我一定我不懂我一定想辦法看怎麼搞懂像有一位觀眾我覺得他很不錯他自己寫了程式碼他自己寫了程式碼他私訊我的粉專來問我他寫的對不對當你這麼有心的時候我絕對幫你看你寫的python的程式碼到底有沒有寫錯我一個一個幫你看看有沒有邏輯錯誤我也給你反饋當你真的有這麼有有心學習的時候我欣賞我絕對幫你幫你看到會他自己根據短管片面的三條規則他自己寫了python的程式碼私訊我的粉專打了這麼長串的字好當你這麼有心的時候我絕對幫你看我幫你我清流菌親自幫你debug我還給你改進的方向當你這麼有成長性思維的時候ok我幫你我叫你爹都可以我不叫你你不用叫我爸爸我叫你爸爸我幫你改正我叫你生爹如果你這麼有心的話那麼有心學習的話我幫你免費提供你只因為我欣賞這種態度我叫你生爹都可以打一長串的回饋跟要我去幫你檢驗你自己也寫了程式碼這麼長花時間好幾個小時下去寫好幾天下去寫ok如果你這麼有心我免費幫你debug看你寫的是不是對的對因為這種成長性思維我覺得說你在生活上的各方面都很有幫助當你有這麼有心有這種態度的時候我是願意幫助你的那很多他是他私訊我就是來伸手我要個那種伸手牌的那種我就不會理你大家看到右上角這張圖我要讓你們用一張圖表一次搞懂GK動態體力你們看到這張圖先別嚇到他可能很像那種財務工程的那種期末報告但是我保證今天我爹爹我本人用這張圖讓你一次搞懂什麼叫做退休金的動態體力讓你體力一輩子有規則有護欄可以自己調節風險的智慧體力方程式我讓各位用右上角這張圖一次搞懂我們先從藍色跟淺藍色跟淺綠色的那個柱狀圖開始講起淺藍色這個柱子就是說我們每一年一開始賬戶裡退休金的總額那綠色的地方呢就是你賬戶體力以外退休金年初體力以外退休金剩下多少所以藍色是年初一開始還沒有提的退休金的總額退休金投資賬戶的投資組合的總額那綠色就是你提完之後還剩下多少退休金可以嗎我們這邊用三年來舉例\n\n你可以想像是說你家裡冰箱裡的食物的庫存量藍色是你冰箱一打開的總庫存綠色就是什麼你今天早上吃完早餐拿完便當還剩下的東西那黃色就是你拿出來吃的食物量黃色這條線黃色這條摺線就是你實際提領的金額所以黃色對應的是右邊的縱軸那藍色跟綠色它對應的是左邊的縱軸各位可以理解這張圖嗎?那什麼叫做所謂的動態提領?傳統的固定提領策略像四趴法則就是每年提一樣多不管市場好不好壞不壞完全就不管你每年就過著花同樣的預算雖通膨調整可是GK動態提領它更像是那種有智慧的管家如果市場漲了讓你的退休金變得更有錢了你可以考慮多提一點犒賞自己如果市場跌了帳戶縮水了你可以自動減少支出守住底線那我們就從最左邊的第一年左下角的第一年來看起一開始第一年假設我們一開始的退休金是有一千萬元一千萬元整這個就是一千萬就是我們退休的即時的資產好假設我們設定的提領率是5%好那第一年很簡單我們就提50萬所以你藍色你看一千萬提完50萬變到多少綠色的950萬你這一年就是初始的第一年什麼都沒發生市場還沒開始動規則也還沒有啟動就像你剛搬進新家冰箱是滿滿的按計劃過生活這個是第一年非常平淡一千萬提50萬你設的提領率是5%提完是你帳戶剩下950萬綠色的柱子好第二年關鍵來了第二年各位有沒有看到第二年的一開始你提完你的退休金是950萬可是你在第二年一開始的時候你發現你的你的投資組合上漲了四成950萬乘1.4直接飆升到了1330萬所以第一年的年初你提完了50萬剩950嘛可是經過了一年到了第二年年初整個市場在過去一年大漲了四成你的退休金的總資產從950飆到了1330萬的藍色的柱子第二年的藍色的柱子好這時候因為你設的提領率是5%嘛你的初始提領率設5%這時候你想提領的金額你要通膨調整因為根據第二條過去一整年市場是漲的你退休金是漲的是上升的你的50萬假設通膨3%那你50萬乘1.03根據通膨3%微調之後就是51.5萬好你在第二年年初的時候你退休金漲到1330萬你本來該提根據通膨調整你在第二年年初你要提的是51.5萬好那你的當前提領率就算出來囉51.5萬除以你此時此刻的退休金的總金額總資產51.5萬除以1330萬等於多少各位按個計算機51.5除以1330等於多少除完會是幾%各位按個計算機是幾%在聊天室打出來你們算的數字不要跟我說是什麼爛%喔是幾%51.5萬你本來第二年年初該提的提領金額除以你當前你看到你的帳戶的價值1330除以下去會是幾%3.87%除下去是3.9%大約等於3.9%好那我們還記得嗎根據繁榮跟保本規則是你的當前提領率如果超出上面跟下面20%的時候還需要去調整提領金額嗎因為你超出護欄了那我們先來想一件事情因為我們在這個case我們設的初始提領率是5%1000萬提50萬嘛那5%的上下20%是多少它的護欄是多少5%你去乘以1.2再乘以0.85%乘以1.2就是多少6%嘛5%乘以0.8就是4%所以你設你的初始提領率5%它的護欄上下線就是6%跟4%好你在第二年的時候超出護欄了你的3.9%當前提領率超出你一開始設的護欄的4%了你的護欄就是規定你只能在4到6%浮動可是你在第二年年初的當前提領率是低於4%的超出護欄了這時候系統就會觸發一個判斷它會告訴你說你太保守了你口袋這麼滿你卻還在省錢你該加薪了所以系統自動啟動繁榮規則直接幫你加薪10%所以第二年年初你提領的金額本來是51.5萬的你自動調高10%就是51.5萬乘以1.1直接調高到了56.7萬有看到第二年的黃色的提領金額嗎它不是51.5萬了它直接拉高到了56.7萬自動加薪10%系統觸發了繁榮規則黃色的點往上拉了它告訴你說你該對自己好一點喔所以這是第二年系統觸發了繁榮規則自動幫你加薪10%從51.5萬你該提領的金額自動調高到56.7萬所以你的1330萬提完56.7萬相減之後就變到第二年綠色的柱狀圖的金額所以第二年你提完56.756.7萬之後還剩下多少還剩下1273.3萬可理解嗎第二年大家不懂可以打出來有不懂的地方可以在聊天室打出來第二年的部分有任何不解的疑惑的地方我這邊有自動四捨五入了就是你51.5萬乘以1.1實際的金額是56.65萬嘛這邊我稍微四捨五入自動進位到56.7各位第二年懂嗎之後我們要進第三年\n\n我這邊有自動四捨五入56.7所以提完你的退休金會剩下第二年會剩下12點不是1273.3萬自動四捨五入因為為什麼50萬會變51.5萬因為你在第一年一整年是上漲的嘛根據通膨規則你要去加3%的通膨往上調嘛所以50萬要先乘51.5不是你50萬要先乘1.03就是51.5萬拿用這個通膨調整過後的數字去除以你當下退休金的總金額算出當前提領率再看是否觸發繁榮規則跟保本規則的護欄可以接受嗎大家對有觀眾講到三桶水的這種提領的架構這之後我會再可能拍一部影片講三桶水就是講說你有一桶是短期現金第二桶短期配置第三桶長期配置這也是不同的提領策略它跟我們今天要講的GK動態提領是不相干的好各位先理解一下第二年那第三年呢第三年你們看一下本來提完你的退休金在第二年年初是剩1273.3萬的嘛好第二年一整年過完到第三年年初了呢你的退休金初始的退休金好景不長大跌了有發現嗎市場大跌了你遇到股災了第三年年初惡夢來了你整個第二年年初提領完之後市場大跌三成你在第三年年初要提領的時候你發現你的退休金帳戶瞬間縮水從1273萬變成891萬藍色的柱子好這時候第三年年初我們有兩件很重要的事情要記得因為你的帳戶在去年虧損了你在第三年年初的時候你就不能隨著通膨加薪囉你這個3%的通膨調整就不能去調囉所以你的提領金額就要照前一年一樣維持在56.7萬你的第二條通膨規則就不能觸發所以第三年年初你本來該提的金額就是56.7萬好你把這個56.7萬除以你當下的退休金的總資產的金額891萬各位觀眾按個計算機56.7除以891大約等於多少按個計算機你們算一下我上個廁所好看一下大家有沒有算對沒錯大家都算對了56.7萬除以891萬大約等於6.4%所以我們剛剛前面說你初始提領率設5%上下各20%就是護欄的上限是6%你的6.4%已經超過上限的護欄了你超過6%了當你超過護欄的時候系統就跳出來對你說你這樣滑太兇了你的退休金會破產於是啟動保本規則把你本來該提的56.7萬砍10%變成降到51萬所以你去算56.7萬乘0.9砍10%大約就是51萬所以你第三年該提的黃色折線的總金額你們有看\n\n變到嗎?變到多少?變到51萬51萬又300塊,這樣我四捨五入51萬這就是GK動態體領系統的安全護欄我藉由這個右上角這張圖,三年的資料三年的case讓大家搞懂,安全護欄指的是什麼你的身GK這套系統動態體領的系統會自動幫你懶趴捏緊讓你體態多,守住你未來生活的底線如果漲太多呢?它自動幫你鬆開懶趴讓你多體一點,多享受一下當下多出國玩個幾次,吃好一點不要把你的錢留到死所以右上角這張圖,大家都懂嗎?三個年份第二年觸發了什麼?繁榮規則第三年年初觸發了保本規則它就像是各位你們在開車一樣有油門嘛,也有剎車,加薪跟減薪的力度那這樣有油門有剎車就可以讓你在退休的路上開得穩,也開得久所以國外比較多的退休規劃的專家跟他們資產管理公司都比較推薦像GK這種有動態調整邏輯的提領規則,提領策略而不是死守SPA法則這種死板板的固定提領策略那動態提領它不是要你亂花它是會有一套自動的系統幫你在風險跟享受當下之間取得智慧的平衡好,那我們講解完右上角的GK動態提領我藉由這三年的假設情況讓各位深入理解有懂嗎?都懂的打加一沒懂的打個加零我看一下這個是我假設的,當然我們來看實際的例子你們懂這個邏輯其實也可以自己寫出那個程式嗎?GK懂嗎?GKR是所有動態提領裡面算難的有些動態提領其實你懂GK其他你必懂因為其他比GK簡單很多十幾套的動態提領當你懂GK的時候我跟你保證其他你都會懂所以我們從GK講起是有原因的你要用Excel寫其實也寫得出來帶那個迴圈嘛,你是寫得出來的有人說為什麼第三年提的比第一年的多因為第二年大漲嘛第二年大跌那還記得嗎?我們大漲多少大跌多少以這個例子來說第一年經過一年第二年年初是大漲四成的第二年遇到一股災嘛大跌三成想以前我大學研究所是當補習班高中數學老師在算題目我都會叫同學上來算我懶得自己算寫那個板書很累可是現在直播不太能叫人上來講上來算一下要我親自講可惡有理解嗎?這三年的case不懂的你們可以問隔壁的同學以前在上數學課不是不懂都會問隔壁的同學那你們也可以問隔壁的同學好我們用一個真實例子我找一下這個是我影片的回測嗎?大家還記得嗎?右上角這個就是你0050從03年6月一路動態體領20年到現在6月底你還剩下998萬跟你當初的1000萬比可是你你用固定體領策略很快就在2018年左右2018、2019你就破產了各位還記得影片這個例子嗎?好這個例子跟剛剛那個case不一樣剛剛case是我假設的case是設多少?初始體領率設5%那我在這個0050的回測是設到幾%?初始體領率我這個回測的初始體領率是設到10%這麼高的有點極端好那我們先來想初始體領率你設10%你的護欄會是幾%?10%乘以1.2就是12%嘛10%乘以0.8就是8%所以你的護欄是在8到12%當你的初始體領率設到10%的時候你的護欄就是下限8%上限12%然後我把這個回測的前面幾年拉出來給大家看一下我沒有每一年都拉我拉04年到2010年它的邏輯就跟剛剛我的那個三年的case一模一樣只是一個是我假設的那這個就是套用在0050過去20多年的真實歷史然後初始體領率設到10%這麼高每一年年初你該提的金額有沒有觸發保本繁榮有沒有通膨調整都在右邊這張圖跟右下角的標格一目了然所以這個是你實際操作的層面就會像這張\n\n如果你有办法回去04年到2010年去提的时候去动态GK动态提领的时候就会像这张图这张表一模一样这个我不仔细讲了它的逻辑就跟我那三年的一模一样那也是用0050的还原股价去计算的大家有懂吗因为GK动态提领是算所有动态提领策略里面算复杂算难的你只要搞懂那就没问题了其他如果之后你再看到其他版本的那都比GK简单有人说如果可以这样提世界没有人要上班了你也要先存到一千万什么不用上班这个一看也是个定人恶这个例子就是你一开始你慢慢靠市值型ETF累积到一千万你开始提领的规则什么说你不用上班这位聊天室的发言就是一看就是定人恶吗不知道在讲什么东西对09年照这个你的当前提领率是冲到15%那么高因为整个08年金融海啸大跌09年的初始你的当前提领率会拉到很高因为退休金跌到很低很低就算提一百万左右你一除下去你的当前提领率会冲高到15%远超过上限的12%这时候你就要动态调整所以从04年到2010年0050只有在09年的年初的时候触发保本规则其他年都没有触发保本跟繁荣所以你真的要触发保本或繁荣超过那个护栏的时候也不容易真的是市场发生大事情的时候才会触发正常年份大多时候就是照固定提领那样随着通膨去调而已所以它其实蛮简单的你退休之后就是每年年初你要提的时候算一下就好10秒钟的事情而已所以GK动态提领是人人都该学会的你一年年初算一次看有没有超过护栏动态去调就好你不用去什么高股息那样去月月配你一年年初提出来然后你要放定存也可以放台币定存然后你每个月领出来用自己帮自己月月配也OK然后我有回测你不一定要每年年初固定提领你每个月领也可以你只要算出来你的年初算一个金额长期差距是不大的几乎没有差别所以你用GK动态提领也可以达到月月配的效果而且整个退休金的寿命是延长的更久远的更有实证理论依据去提你要周周配也可以没有规定你要日日配也可以做到用GK你一年年初领出来放定存每天都提一点提一点除以365天每天都领对没人管你你要日日配也可以然后我回测还没算定存利息年初领出来一笔固定的金额根据GK算出来的微调之后的提领金额领出来你就先放银行定存每个月除以12每个月领出来用剩的是不是还有定存利率每小时你要每小时配应该也可以只是会有点烦你一个小时闹钟一到你就要打开APP领钱了随便你想要怎么样配周周配日日配每小时配秒秒配你每一秒都在领钱也可以那这就是GK动态提领的详细解说但这套方式不适合定人额你不适合定人我必须说明这套方式是定人额不适合用的因为太危险了这套方式对你来说太危险了你不能用这套方式你适合摆定存我是关心定人额可能会领到破产那后续我会再介绍另外一个稍微简单一点的动态提领它其实也蛮好用的它不像GK稍微复杂一点GK它是比较复杂可是它的原理是不难的稍微复杂而已如果你觉得GK有点复杂你要用简单一点的也可以我之后影片会介绍然后这一个它现在也很多人在用在美国这套动态提领叫做先锋动态提领准则它这套是由先锋集团自己的体系发明出来的他发表在2017年这篇非常著名的研究这篇研究论文已经绝版你在上网找不到这版还好我前几年有存下来这个论文已经绝版你download不到我后续影片会解说这套它也非常好用是属于简单又暴力的动态提领策略不到GK这么复杂可是效果非常显著经过很多的实证表明可以拉高初始提领率\n\n那这套策略就叫做先锋动态提领\n取名就是因为它是先锋集团发明出来的\n我会介绍几个主流的动态提领\n你们可以选择你要用哪一种\n刚刚观众有提到三桶水嘛\n那我们也会讲这个提领规则\n可是你用这套架构就是很简单\n我们人生有两大阶段\n资产累积期间跟退休提领期间嘛\n都是用市值型ETF达到整个财务规划跟投资目的\n没有什么那种坊间的谣言\n你资产累积期间年轻你就用市值型ETF\n退休你就买高股息没有这种屁话\n在国外是没有这种屁话的\n你不管是在资产累积期间还是退休提领期间都是用市值型ETF达到你的投资目的\n你可以想一个东西一个ETF它的总报酬越高的时候代表什么\n你在资产累积期间是更快达到目的地的\n在退休提领期间因为你的总报酬越高它可以让你的提领效率初始提领率达到更强更多的金额领的更爽花的更久\n所以没有那种坊间那老一辈那一套说你退休有现金流你买高股息ETF是没有这件事的\n先锋集团甚至有好几篇研究是在打脸这个的\n后续有时间也可以详细解析这些研究你退休后用高股息高收益的商品来达到现金流会有什么后果什么缺点什么样的机会成本\n所以这套规则就是说我们在资产累积期间就是用总报酬来达到我们的财务目标可能是你想提早退休想要买房想要存自己的教育金\n那在退休提领期间也是用总报酬提领法来达成你的退休规划的目标\n所以这套规则这套策略整个架构人生的体系是不适合定能额的\n设0050非常危险我在这边要讲你接受不了你觉得很怕很危险那还是定存吧\n欢迎截图这不是搞什么歧视你身为一个投资人当你定存能力很强的时候你也可以把你这套的定存的技巧交给你的儿子吧交给你的子孙你的晚辈\n你这套定存能力很强的技巧你这个能力你是可以延绵不绝传给你的子孙后代你的儿子们你的干儿子你的孙子们这个是一个吹捧的字他不是贬义他是褒义定能额三个字你们去google字典他是褒义的他是有称赞的意思的你的心是很定下来的有能力这样定存定存不佛抹可以一直定存个三四十年这是很考验心性能力是一种万中无一的能力心性跟技巧这个能力你是又可以把他再传给你的子孙后代是一种一种家族的象征\n他不是坏事你知道吗他从某个方面来说是好事是个优点所以当你骂人家定能额的时候你不是在骂你是在称赞他所以你不要吝啬去称赞别人好吗各位观众当之后有人说创新高要回档要小心的时候你就不要吝啬称赞他一下定能额称赞人他跟股市长期向上是一样的事情是那种正和游戏你多称赞人你是不会有损失的吧你让对方的心情也会有那种我被称赞了我开心了所以之后遇到我们不要吝啬去称赞别人定能额\n我今天直播一个小时多看到很多聊天室有所谓的定能额我是在称赞你050很危险不适合你\n所以今天直播又讲了两part第一part就是说当050创新高然后呢会发生什么事第二part就是我们深度拆解动态提领GK动态提领的三大规则的深度解析勇敢的象征对他是勇敢的象征当有人说你称赞有人是定能额的时候他背后的含义是那种引以为荣的你是值得骄傲的你称赞别人的同时是一种正和游戏你称赞人他也笑了他自己也身为定能额引以为荣了你看到他开心你会觉得说我称赞他好像对他是有帮助的之后再任何的财经影片财经节目下方你都可以毫不吝啬的用这三个字称赞别人\n\n",
      "model_used": "gemini-2.5-flash-preview-05-20",
      "processing_time": 531.2723088264465,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-07-29T09:19:37.252200",
    "updated_at": "2025-07-29T09:28:28.527237"
  },
  {
    "id": "tpvpdprQE36NgADRTdXNuw",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754177643.138413,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754177644.586066
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 1.4473321437835693
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:34:03.138416",
    "updated_at": "2025-08-03T07:34:04.586441"
  },
  {
    "id": "UAhpbHWceOKhj00o98rsKA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754177669.545918,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754177670.4271228
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 0.8813962936401367
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:34:29.545920",
    "updated_at": "2025-08-03T07:34:30.428042"
  },
  {
    "id": "zmnG4ZbFhXsddBSXHkpgzA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754177886.5029252,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754177887.43359
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 0.9281771183013916
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:38:06.502946",
    "updated_at": "2025-08-03T07:38:07.434018"
  },
  {
    "id": "N6qrLGvC2fgX0HhQroKBHA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754178094.936502,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754178095.748794
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 0.8120336532592773
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:41:34.936510",
    "updated_at": "2025-08-03T07:41:35.749283"
  },
  {
    "id": "Gp_zgnBS6aDqDnOGEwKLwQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754178164.380787,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754178165.242259
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 0.8592050075531006
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:42:44.380795",
    "updated_at": "2025-08-03T07:42:45.242687"
  },
  {
    "id": "fx0p4Blpw8BXlWaEnE8aWQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754178216.968351,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "timestamp": 1754178217.80564
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] LPcJ1Wr7oCY: Join this channel to get access to members-only content like this video, and other exclusive perks.",
      "processing_time": 0.835615873336792
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:43:36.968370",
    "updated_at": "2025-08-03T07:43:37.806052"
  },
  {
    "id": "MzP0ZzsGH2Hb-t3ihGbO-w",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=LPcJ1Wr7oCY&t=18s",
    "timestamp": 1754178485.3196402,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1754178695.242205
    },
    "result": {
      "title": "退休提領最重要的觀念：不對稱風險！固定 vs 動態策略",
      "summary": "好的，這是一份根據您提供的 YouTube 影片轉錄文本，製作的專業級深度分析筆記。筆記嚴格遵循您要求的結構、格式與深度分析標準。\n\n---\n\n## **主要觀點與核心價值**\n\n這份講座的核心價值在於**顛覆傳統退休提領的單向思維**，將一個被廣泛討論但常被誤解的概念——**報酬順序風險 (Sequence of Returns Risk)**——從單純的「破產風險」提升到一個**「不對稱的雙面刃」**的戰略高度。講者「清流君」精闢地指出，當前主流的退休規劃，特別是圍繞「4% 法則」的討論，過度聚焦於如何避免最壞情況（下行風險），卻系統性地忽略了另一種同樣重要的風險：**因過度保守而導致財富未能被充分享受的「遺憾風險」（上行潛力）**。\n\n講座的深刻之處體現在以下幾個層面：\n\n1.  **重新定義風險**：傳統觀點將風險定義為「錢不夠用」。講者將其擴展為一個雙向概念：**「錢不夠用的風險」**與**「錢多到沒花完的風險」**。他透過歷史數據證明，這兩種風險發生的機率可能相當，但後果的量級卻有天壤之別。壞的報酬順序可能導致資產提前耗盡，但好的報酬順序，在複利效應下，能讓資產膨脹到遠超預期的程度（例如，初始本金的 6-9 倍）。這種**不對稱性**是整個論述的基石。\n\n2.  **數據驅動的洞察**：講者並非空談哲學，而是引用了大量美國股市百年歷史數據進行佐證。其中最具顛覆性的觀點是：**退休後長達 30 年的「平均年化報酬率」與「可持續提領率」之間幾乎沒有相關性**。他透過 1966 年（高平均報酬、低提領率）與 1912 年（低平均報酬、較高提領率）等極端案例，強而有力地證明了**報酬「出現的順序」遠比「平均值」更為關鍵**。這個洞察直接挑戰了許多人「只要長期市場向上，就能提高提領率」的直覺。\n\n3.  **從靜態防守到動態應變的範式轉移**：基於對風險的重新定義，講者倡導從傳統的**「固定提領策略」（如 4% 法則）**轉向**「動態提領策略」**。他認為，4% 法則的本質是一個為了應對歷史上最差情境而設計的「安全地板」，而非一個普適的「天花板」。若將其作為唯一準則，絕大多數退休者將面臨財富極大化、生活品質卻未能相應提升的窘境。因此，他提出了如**「加碼機制」**和**「護欄機制 (Guardrails)」**等具體解決方案，旨在建立一個既能守住安全底線，又能在市場順風時享受紅利的彈性框架。\n\n總體而言，這份講座的價值不僅是提供退休理財的「術」，更是重塑了看待退休規劃的「道」。它促使聽眾思考一個根本性問題：退休理財的終極目標是確保財務數字上的絕對安全，還是在可控風險下，最大化人生晚年的幸福感與體驗？透過對**報酬順序風險不對稱性**的深度剖析，講者為我們提供了一套更完整、更人性化的決策框架，鼓勵退休者從被動的風險規避者，轉變為主動的財富管理者，靈活應對市場變化，真正做到「活在當下，錢盡其用」。\n\n---\n## **內容大綱**\n1.  **退休規劃的核心矛盾：報酬順序風險的雙面性**\n2.  **解構 4% 法則：為何它是安全地板而非天花板**\n3.  **顛覆直覺的發現：長期平均報酬與可持續提領率的低相關性**\n4.  **不對稱風險的量化分析：上行潛力的驚人規模**\n5.  **傳統保守策略的心理與現實困境**\n6.  **應對不對稱風險的實踐方案：動態提領策略**\n7.  **結論：建立靈活應變的退休提領新思維**\n\n---\n## **關鍵術語與概念**\n- **報酬順序風險 (Sequence of Returns Risk)**: 指投資報酬發生的時間順序對退休投資組合最終價值的巨大影響。在資產累積期，短期波動可被長期平均報酬撫平；但在資產**提領期**，退休初期的負報酬會與持續的提領形成雙重打擊，永久性地侵蝕本金，導致資產組合過早耗盡，即使後續市場表現優異也難以彌補。\n\n- **不對稱風險 (Asymmetric Risk)**: 在本講座中，特指報酬順序風險的影響是不對稱的。**下行風險**（壞順序）的極限是資產歸零；而**上行潛力**（好順序）在複利效應下，可能導致資產增長數倍，其增長幅度遠大於下行損失的幅度。傳統策略過於關注前者而忽略後者。\n\n- **4% 法則 (The 4% Rule) / 安全提領率 (Safe Withdrawal Rate, SWR)**: 一個經驗法則，指退休者在退休第一年可以從其投資組合中提取 4% 的資金，之後每年根據通貨膨脹率調整提領金額。此法則的設計初衷是確保在過去美國市場**最糟糕的 30 年情境**下，退休金也不會被耗盡。因此，它是一個極度保守的「最壞情況」基準。\n\n- **動態提領策略 (Dynamic Withdrawal Strategy)**: 與每年提取固定（經通膨調整後）金額的靜態策略相對。動態策略會根據投資組合的當前價值和市場表現來調整每年的提領金額。其核心思想是「市場好時多花點，市場差時少花點」，以實現更高效的資產利用。\n\n- **護欄機制 (Guardrails)**: 實現動態提領策略的一種具體方法。它會設定一個提領率的「安全通道」（例如 4% 到 6%）。當實際提領率因市場下跌而突破上護欄（如 6%）時，就削減開支；當提領率因市場上漲而跌破下護欄（如 4%）時，就增加開支。這套機制能自動化地實現風險控制與機會把握。\n\n---\n## **重要引述與案例**\n> \"報酬順序風險它不只是一個怕你破產的風險，它同時也是一個讓你留下巨額資產卻沒有享受到的風險...它是一個雙面刃。\"\n**分析**: 這句話是整場講座的核心論點。講者將「報酬順序風險」從一個單純的負面概念，提升為一個中性的、具有雙向影響的現象。傳統財務規劃將此風險視為洪水猛獸，所有策略都圍繞著「防禦」展開。而講者指出，這種風險同樣創造了巨大的「上行潛力」。將其定義為「雙面刃」，徹底改變了討論的框架，迫使我們不僅要思考如何「避免失敗」，更要思考如何「把握成功」，從而引出後續關於動態調整與享受財富的討論。\n\n> \"你退休後的提領你是不 care 你的市場報酬是多高...我們只要 care 一件事就好，就是報酬出現的順序。\"\n**分析**: 這是一個極具顛覆性的結論，直接挑戰了人們的普遍直覺。講者透過比較 1966 年（年化報酬 9.56%，SWR 僅約 4%）和 1912 年（年化報酬 5.5%，SWR 卻達 4.6%）等歷史數據，證明了長期平均報酬對退休成功率的指導意義非常有限。這個案例的震撼之處在於，它揭示了退休初期的幾年表現對整個退休週期的「路徑依賴性」。一旦初期遭遇虧損，本金被侵蝕，後續的高報酬也無力回天。反之，若初期順利，資產基礎得以鞏固，即使後續報酬平庸，也能支撐更高的提領水平。這為「為何需要動態調整」提供了最強大的數據支持。\n\n---\n## **詳細內容分析**\n### **第一部分：報酬順序風險的雙面性**\n傳統退休規劃的核心焦慮源於**報酬順序風險**的下行威脅：若在退休初期遭遇連續的市場下跌，持續的提領會加速本金的消耗，這種現象被稱為「美元成本劫掠 (Dollar-Cost Ravaging)」。即使長期平均報酬率看似健康（如 8%），但若壞年份集中在前期，資產也可能在好轉之前就被耗盡。\n\n然而，講者將此概念進行了關鍵性的擴展，提出了其**不對稱性**。他指出，報酬順序風險同樣存在巨大的**上行潛力**。如果退休初期遇到牛市，投資組合不僅能輕鬆覆蓋提領金額，本金還會因複利效應而迅速增長。由於複利的指數級特性，這種上行效應的幅度遠超下行損失的幅度。例如，最差情況是資產歸零（損失 100%），而最好情況下，資產可能增長至初始本金的 6 倍、9 倍甚至更多。\n\n這種不對稱性帶來了一個深刻的矛盾：為了防範機率相對較低的「破產風險」，退休者普遍採用極度保守的策略（如 4% 法則），結果卻大概率地陷入了另一種風險——**「遺憾風險」**，即在有生之年未能充分享受自己辛苦積累的財富，最終留下遠超預期的巨額遺產。這不僅是財務規劃問題，更是人生哲學問題。\n\n### **第二部分：解構 4% 法則：為何它是安全地板而非天花板**\n講者對廣為流傳的 **4% 法則**進行了正本清源的解讀。他強調，4% 這個數字並非基於市場的平均報酬率只有 4%，而是因為它是一個經過歷史數據壓力測試後得出的**「安全下限」**。\n\n*   **歷史背景**: 4% 的提領率之所以被稱為「安全」，是因為它能夠成功應對美國過去一百年來所有最嚴峻的 30 年退休期，包括從 1929 年經濟大蕭條或 1960 年代末高通膨時期開始退休的情境。\n*   **地板而非天花板**: 這意味著，4% 法則是為了確保在**最壞情況下**依然能夠存活的策略。然而，在歷史上絕大多數（約 90%）的情境中，採用 4% 法則不僅不會破產，反而會導致退休期末的資產遠高於初始本金。根據數據回測，期末資產的中位數約為初始本金的 3 倍。\n*   **核心謬誤**: 許多人誤將 4% 法則視為一個標準或目標，認為提領超過 4% 就是危險的。講者澄清，這是一種誤解。真正的問題不在於 4% 這個數字本身，而在於其**靜態、固定**的性質，它無法根據實際市場情況進行調整，從而導致了巨大的機會成本。\n\n### **第三部分：顛覆直覺的發現：長期平均報酬與可持續提領率的低相關性**\n這是講座中最具洞察力的部分。講者透過一個散佈圖和多個歷史案例，揭示了一個違反直覺的事實：**一個為期 30 年的投資週期的平均年化報酬率，與其能支撐的最高安全提領率（SWR）之間，相關性極低。**\n\n*   **案例分析**:\n    *   **高報酬，低 SWR**: 1966 年開始退休的群體，其後 30 年的 60/40 投資組合年化報酬率高達 9.56%，但其 SWR 僅略高於 4%。原因是他們退休初期遭遇了高通膨和市場停滯。\n    *   **中報酬，低 SWR**: 1937 年開始退休的群體，年化報酬率為 7.24%，其 SWR 同樣也只有約 4%。\n    *   **低報酬，更高 SWR**: 1912 年開始退休的群體，經歷了一戰和二戰，年化報酬率僅 5.5%，但其 SWR 反而能達到 4.6%。\n    *   **極端案例**: 1874 年開始退休的群體，年化報酬率僅 5.96%，SWR 卻能高達驚人的 9.2%。\n\n*   **根本原因**: 這些案例雄辯地證明，決定退休成敗的**關鍵變數是報酬的「順序」**。退休初期的 5-10 年是「脆弱期」，此時的市場表現對整個退休週期的資產軌跡有著決定性的影響。初期的虧損會永久性地削弱資產基礎，而初期的收益則為後續的提領提供了堅實的緩衝。\n\n### **第四部分：不對稱風險的量化分析：上行潛力的驚人規模**\n為了讓「遺憾風險」更加具體，講者提供了量化數據來展示報酬順序風險的**上行潛力**有多麼巨大。\n\n*   **4% 提領率的結果分佈**:\n    *   **下行**: 根據歷史回測，大約有 10% 的機率，30 年後剩餘資產會低於初始本金。真正耗盡資產的情況在歷史上僅發生過一次。\n    *   **上行**: 同樣，也有約 10% 的機率，30 年後剩餘資產會超過初始本金的 **6 倍**。\n    *   **極端對比**: 最差情況下資產歸零，而最好情況下資產可增長至超過 **9 倍**。\n\n*   **5% 提領率的風險權衡**:\n    *   當提領率提高到 5%，提前耗盡資產的機率上升至約 25%。這也是許多財務顧問警告客戶不要這樣做的原因。\n    *   然而，講者指出硬幣的另一面：同樣有約 25% 的機率，30 年後剩餘資產會是初始本金的近 **3 倍**——這還是在每年享受更高提領水平的前提下。\n\n這些數據清晰地表明，將退休規劃的全部重心放在避免 25% 的失敗機率上，卻完全忽略了另外 25%（甚至更多）獲得巨大成功並享受更高生活品質的可能性，是一種不完整的決策過程。\n\n### **第五部分：應對不對稱風險的實踐方案：動態提領策略**\n在揭示了問題的本質後，講者提出了兩種具體的、從靜態轉向動態的解決方案，旨在同時管理下行風險和把握上行潛力。\n\n1.  **加碼機制 (Ratchet Mechanism)**:\n    *   **概念**: 這是一種相對簡單的動態調整方法。退休者可以從一個較為保守的初始提領率開始（如 4%）。\n    *   **執行**: 設定一個檢視週期（如每三年）和一個觸發條件（如投資組合現值超過初始本金的 50%）。一旦條件被觸發，就將提領金額按固定比例上調（如增加 10%），並且這個新的、更高的提領金額將成為新的基準，未來不再下調。\n    *   **優點**: 易於理解和執行，能在市場表現良好時逐步提高生活水平，避免留下過多遺產。同時，由於初始提領率保守，在市場表現不佳時也能提供足夠的安全緩衝。\n\n2.  **護欄機制 (Guardrails Mechanism)**:\n    *   **概念**: 這是更為複雜和靈活的動態策略，也是講者個人較為推崇的方法（如其影片中提到的 GK 動態提領）。\n    *   **執行**: 該策略的核心是監控**當前提領金額佔當前資產的百分比**。設定一個提領率的「護欄區間」，例如上護欄為 6%，下護欄為 4%。\n        *   **觸及上護欄**: 如果市場下跌導致資產縮水，使得固定提領金額佔總資產的比例超過 6%，則觸發「削減開支」的規則（例如，將提領金額減少 10%）。\n        *   **觸及下護欄**: 如果市場上漲導致資產增長，使得提領金額佔比低於 4%，則觸發「增加開支」的規則（例如，將提領金額增加 10%）。\n    *   **優點**: 這種方法能更即時地反應市場變化，實現真正的隨行就市。它在壞年份自動收緊開支以「保命」，在好年份自動增加開支以「享受」，從而最大限度地優化了整個退休期間的財富效用。\n\n---\n## **實踐應用與建議**\n- **建議1：轉變思維模式，從「避免破產」到「優化人生」**\n    *   **說明**: 退休規劃的首要步驟是心態的轉變。不要將退休理財視為一個單純的數學問題，目標是讓資產在死後依然為正數。而應將其視為一個資源配置問題，目標是在確保基本安全的前提下，最大化人生晚年的生活品質和幸福感。承認「錢多到沒花完」也是一種需要管理的風險。\n    - **實施方法**: 在制定計劃時，問自己：「如果市場表現遠超預期，我希望我的生活是什麼樣子？」預先規劃好在順境中如何「加碼」享受人生，例如增加旅遊預算、支持子女或投身慈善事業。\n\n- **建議2：放棄靜態規則，擁抱動態策略**\n    *   **說明**: 認識到 4% 法則等靜態規則的內在缺陷——即為了防範極端小概率事件而犧牲了大概率情況下的生活品質。應選擇一種動態提領策略，讓你的支出能隨市場行情靈活調整。\n    *   **實施方法**:\n        *   **保守型投資者**: 可以選擇較為簡單的**「加碼機制」**。設定清晰的規則，例如「當我的投資組合比退休時增長 50% 時，我將年度提領額永久性提高 10%」。\n        *   **積極型投資者**: 可以研究並採納**「護欄機制」**。設定明確的提領率上下限（如 4% 和 6%），並制定好觸發後的調整方案（如增/減 10% 的支出）。這需要更頻繁的監控，但能帶來更高的資金效率。\n\n- **建議3：建立定期檢視與調整的紀律**\n    *   **說明**: 無論選擇哪種策略，成功的關鍵在於紀律性的執行。動態策略不是隨心所欲地改變支出，而是依據預先設定好的規則進行調整。\n    *   **實施方法**: 將檢視與調整制度化。設定一個固定的檢視日期，例如每年年底或每三年一次。在這一天，根據預設的規則評估投資組合的表現和提領率，並決定下一年度的提領金額。將這個過程寫下來，作為你的「退休提領政策聲明」，以避免在市場波動時做出情緒化的決定。\n\n---\n## **相關資源與延伸閱讀**\n- **資源1：講者「清流君」的頻道內容**\n    *   **說明與價值**: 講者在影片中提到了他製作的關於「GK 動態提領」的影片。對於希望深入了解「護欄機制」具體實施細節的觀眾，直接參考其相關內容會是最高效的方式。\n\n- **資源2：Michael Kitces 的研究與部落格 (Nerd's Eye View)**\n    *   **說明與價值**: Michael Kitces 是美國財務規劃領域的權威，尤其在退休提領策略方面有大量開創性的研究。他的部落格深入探討了安全提領率、護欄策略、可變提領策略等多種模型的細節、優劣和歷史回測數據。對於希望從學術和數據層面深入理解此主題的專業人士或深度愛好者，這是必讀的資源。\n\n- **資源3：《The Trinity Study》及其後續研究**\n    *   **說明與價值**: 這是 1998 年發表的一篇奠基性學術論文，它首次系統性地提出了 4% 法則。閱讀原文或其後續的更新研究，有助於理解 4% 法則的原始假設、研究方法和局限性，從而更好地理解為何需要對其進行動態優化。\n\n---\n## **總結與未來展望**\n本次講座提供了一個關於退休提領規劃的**革命性視角**。其核心貢獻在於系統性地闡述了**報酬順序風險的不對稱性**，並將傳統規劃中被忽視的**「遺憾風險」**（即財富未被充分享受的風險）提升到與「破產風險」同等重要的地位。透過強大的歷史數據分析，講者雄辯地證明了靜態提領策略（如 4% 法則）在大多數情況下的低效率，並倡導採用**動態提領策略**作為更優的解決方案。\n\n講者提出的「加碼機制」和「護欄機制」不僅是理論，更是具備高度可操作性的實踐指南。它們為退休者提供了一個框架，使其能夠在守住安全底線的同時，靈活地把握市場上行帶來的紅利，從而實現財務安全與生活品質的平衡。\n\n**未來展望**：\n隨著人類壽命的延長、全球市場預期報酬的可能下調，以及個人化需求的提升，退休提領策略的研究將朝著更加精細化和個人化的方向發展。未來的趨勢可能包括：\n\n1.  **更個人化的護欄**: 護欄的參數（如提領率上下限、調整幅度）將不再是通用數字，而是會根據個人的風險承受能力、健康狀況、非投資性收入（如退休金）等因素進行客製化。\n2.  **與行為金融學的結合**: 策略的設計將更多地考慮人的心理偏誤。如何設計一套既在數學上最優，又讓使用者在心理上最容易堅持的策略，將成為一個重要的研究方向。\n3.  **科技驅動的自動化**: 未來可能有更多金融科技 (FinTech) 工具，能夠自動監控投資組合並根據預設的動態規則向使用者發出調整建議，從而降低執行難度，確保紀律性。\n\n總之，從「靜態防守」到「動態應變」的轉變，將是未來退休規劃領域的主流趨勢。這不僅是對財務理論的深化，更是對如何利用財富創造更美好人生的哲學思考。",
      "transcript": "各位觀眾大家好,我是清流君,大家晚安,都吃飽了嗎?今天我要講的主題是關於退休這個規劃跟提領方面的大觀念,整個大方向的觀念。因為我不知道各位一百多個聽眾,各位年紀大概在哪個範圍,這邊不太確定,可是會來聽今天的講座應該你是對退休這一塊有一定的不確定性或是焦慮的。所以今天我希望我的內容可以幫大家減少這方面的擔憂或是焦慮,退休提領上,夠不夠用你的退休金,將來可能四五十年,你要提早一點退休,要領四十年到五十年到上天堂,那這段期間你的錢夠用嗎?該怎麼提我會給各位一個大方向。然後我們要知道我們在談所謂的退休理財的時候,第一個最重要的問題,我們應該問自己的是什麼?到底什麼才算是合理的支出?我們退休之後該領多少?從我們的投資組合領多少才是合理的水準?就算你可以通過某些方式,模擬啊,或是你自己去預估你的投資組合,就算你可以正確預測長期在退休之後的長期市場的報酬率,問題是萬一你在退休的初期就遇到了好幾年比較差的報酬,再加上你固定從投資組合退休金投資組合去提領,會發生什麼事?答案很簡單,你的資產可能在好報酬出現之前就被領光了,被提光了。所以為了防止這種所謂報酬順序風險,退休族通常會花的比所謂你的投資組合的平均報酬能負擔的金額還要更少。這是我看很多退休族比較保守的做法,或一些這個領域財務顧問給一些他的客戶的建議也是採這種做法,就是比較保守。即便你退休族的預估的報酬率比較高,那我還是建議你花少一點,可能3%4%每年,這個是目前比較主流的觀點。可是這邊有一個比較弔詭的點,就是壞的順序加上提領,當然會把退休金提早花光嘛,這蠻符合直覺的。可是如果你遇到好的市場順序呢?好的市場報酬順序呢?結果往往是你的退休金的資產快速滾大,你最後留的財富遺產可能會多的嚇人,還要繳給政府一筆龐大的遺產稅。所以為什麼你應該在長期報酬在向上的時候,它的負利我們要知道它是比你想像的更誇張的。我們簡單舉例來說,如果你採4%的初始提領率,你有同樣的機率大約10%,在退休的時候我們還保有完整的本金,或者根據歷史回測,你也有10%的機率乾脆會超過6倍的本金,就是你用所謂的4%法則的時候固定提領4%4%。那換句話來說,報酬順序風險它不只是一個怕你破產的風險,它同時也是一個讓你留下巨額資產卻沒有享受到的風險。所以我們在談退休支出規劃這一塊的時候,我們不只要考慮壞的報酬順序,我們同樣也要正視,一定必須要正視好的報酬順序帶來的另一種風險。什麼風險?就是你太保守了,結果退休後一路省吃儉用,最後才發現自己根本沒花完。所以為什麼會這樣?因為我們現在要知道一件事,報酬順序風險這個風險有所謂的四個字,不對稱性。壞的順序會讓你的資產花得更快,好的順序卻能讓你的資產滾到一個蠻誇張的程度。如果你只是打算保守的話,打算等遇到好的報酬順序好運的時候再慢慢調整,那很可能等你想加碼享受的時候,你的青春跟健康早就已經一去不復返,錢最後也是只能留給後人。重點在於報酬順序風險它是雙向的,它不只可以讓你在壞的順序提早破產睡公園,也可能讓你在好的順序下最後一路花不完你的錢,一路省吃儉用花不完。所以我們要記住退休風險不只是單一的錢不夠花這種,同時還包含了錢很多卻沒有花到的這個雙面刃。你可以想你辛苦存退休金,最好是能打算在什麼,別把錢留到死,活著的時候用光,之後留下一定的金額就好了,不需要太誇張。我們又不是說比誰上天堂,最後帳面的數字誰比較強誰就贏,沒人在過世的時候比這個嘛,很天方夜譚。那我們直接來看第一張圖表,第一張投影片的數據,對現在的這一張,如果你從長期的歷史報酬來看,一個股債平衡的投資組合套用在美股,退休後理論上應該可以讓你每年花掉起始的退休金資產的6%,還能每年跟著通膨去調整,持續30年一直領一直領不破產,為什麼?因為從美國股市從1920年代以來,你一個60%的美國大型股S&P500指數搭配四成的美國中期政府公債的投資組合64股再搭配,從1920年代以來年化報酬率平均8到9%,換句話來算即便你每年通膨調3%,還是有足夠的空間不讓本金被掏空,甚至在這種條件下,就算你的體領率拉到了所謂的6%,6%這麼高,30年後資產不只沒花光,本金還留下相當大的一部分在大多數的時間,當然我們也要誠實面對一個問題,就是說美股現在的估值是比過去百年高出那麼多的,你要美國股市複製過去百年的平均8到9%到將來其實不太容易,所以我們必須把一定的部位進行全球分散的根本原因也在這邊,好就算這樣我們來看下一張好了,下一張投影片講的就是說,我們來看歷史上美國股市最慘烈的情況,例如在1929年經濟大蕭條的時候開始退休的投資人,他在1929年退休,接下來30年的年化平均報酬率只有6.28%,非常低落,可是依然撐得住你接近5.4%的初始體領率,就即便接下來30年這麼差的股市報酬,你一開始設的體領的固定%數5.4%也幾乎在剛好第30年的期末才把錢花光,蠻誇張的,所以光看這張圖你會覺得說就算股市的報酬很差,那我體領率拉的高一點也沒關係,可是事情沒有那麼單純,這裡有一個關鍵的現象就是我們剛剛一開始提的報酬順序風險,他告訴我們就算長期的平均報酬看起來沒有什麼大問題,可是你過程中如果遇到比較大幅的波動,市場波動比較大,你的資產未必撐得住持續的這樣二三十年的一直體領,換句話說就是你數字上的平均好看不代表你體的穩體的久,就算照理來說6%的體領率在長期的平均下理論可行,長期平均報酬上是可行的,甚至在歷史最慘的案例5.4\n\n股市历史百年的期间你只要把初始提领率压到4%你可以撑过所有的百年美国股市所有百年最糟糕的情境所以4%它是一个地板它不是天花板所以4%也被称作为安全提领率它多冠两个字安全它为什么4%是安全提领率它根本的原因是在这边它可以让你撑过过去美国股市64股债搭配所有最惨的情况你只要提4%在接下来三十年你都不会破产那不是因为市场的长期报酬率只有4%这么低因为很多人会有一些矛盾的点他想不通你只提4%是不是过去市场报酬率就只有4%你才能提4%不是因为这样是因为有些报酬顺序太差了只有你压到这么低的时候它才能让你的退休金在历史上的任何一种烂情境里面都不会提前破产所以我们要懂4%法则是怎么来的我们这边先讲这一张这一张是说4%法则是在最糟糕的情境就是在1967年这个橘色圈圈各位我们看到他画出来的时候因为那个1967接下来三十年是美国股市最惨的三十年不只高通膨股市报酬也很差你一退休就遇到什么比较坏的报酬序列可是即便如此你设4%还是撑得住三十年这个是这张图代表的意涵那更特别的是有一个这边我要补充一个蛮重要的观点我们看下一张图这蛮颠覆很多人的想象这张图是所谓最经典的一张它也颠覆了很多人的想象因为很多人以为只要你退休后的三四十年的市场报酬长期的市场报酬越高照理来说你可以提领的比例就越高这蛮符合直觉的你退休之后市场走一个三四十年的大多头那我就爽爽提不对我们看这张图实际上你有没有发现市场的长期报酬跟你可提领的比率它们两者的散布图的相关性关联度是极低的我们举例来看好了我们把这张图的有个点抓出来就是你在1966年美国股市退休的人他们的64股债搭配的投资组合一样是六成的S&P500指数四成的美国中期公债接下来1966年往后三十年到1996年这个64股债搭配在这三十年的年化报酬高达了9.56%听起来很狂股市走一个大多头债券表现也不错所以1966到1996这三十年的年化报酬率64股债搭年化是9.56%可是可是没想到的是这三十年的安全提领率居然只有略高于4%你有发现吗很夸张那相反的如果是在1937年退休的人在美国股市退休的人接下来三十年1937到1967这三十年的年化报酬率只有7.24%比刚刚那个1966年退休的人少很多可是他们同样的安全提领率也是略高于4%的所以这个蛮违反我们的直觉一个9.56年化报酬一个7.24结果两个的安全提领率是一样的水准那更妙更妙的是你在1912年退休的投资人接下来股市再次的64股债搭配的投资组合接下来三十年1912到1942这三十年的年化报酬率只有很惨的5.5%因为经历了什么一战二战经济大萧条这三十年的报酬率年化只有5.5%可是结果这三十年的安全提领率是提高到了4.6%比刚刚我讲的那两个案例还要高所以我举这张图跟这三个案例我想表达什么重点退休后的提领你是不care你的市场报酬是多高高不高无所谓你很烂也没关系你很好也没关系他们的相关性是很差的低相关的所以重点是我们退休之后我们不关注市场报酬多牛市多空头多强多雄市我们完全不care我们只要care一件事就好就是报酬出现的顺序你可能你退休后的年均报酬看起来很高但是如果你的坏年份统统集中在一开始你的提领率一开始你的提领率初始提领率还是必须得压得很低相反的你报酬虽然你退休之后你很lucky报酬很高可是你一开始的坏年份就是也很惨你统统也集中在一起那你也很悲剧所以相反的那你可能会以为你很不幸你的退休后的30年报酬很差很差可是好运的是什么你一开始如果真的顺风顺水你的提领率拉高到六七%都没问题你反而可以花的非常多所以简单来说你退休金能不能撑得住关键不是你的退休金的投资组合的市场六四股债搭配股债平衡型的他在你退休之后的三四十年的平均报酬多少这是我们不care的我们只要care报酬出现的顺序那这张图的数据很惊人就算投资人的长期报酬率我们直接看一个总total你退休之后的长期报酬率借在5.5%到9.5%的年均报酬好了安全提领率最后都落在差不多4%左右甚至有一个非常极端的案例就是你在1874年退休的人你的退休金的64股债搭配的接下来30年的年化报酬率只有少那不行只有5.96%可是你的安全提领率却可以拉高到了9.2%这么夸张他是比一般标准的两倍还多所以这也再次证明你的退休之后的市场走的多好多烂平均报酬不是决定性的因素顺序序列才是最关键的生死决定的存亡所以接下来我们要谈一个很有趣的现象就是你报酬顺序风险的上行潜力刚刚我们说过因为你报酬的顺序可能很不利就算你股债搭配的长期平均接近8%年化平均报酬接近8%退休的时候你也不敢直接拿6%的提领率来花因为你很怕你就是那个很倒霉的倒霉鬼你遇到坏的年份统统集中在你退休一开始五六年那你就算年化的8%好了你也会提早破产所以这也是演化出安全提领率4%的由来他低到这4%低到足以应付历史上所有最糟糕的情境但问题来了当你提领率压爆之后4%的时候现实上我们看下一张我们看下一张图这个大家有看到吗密密麻麻很多颜色的线我们把所有历史上的美国股市百年的期间所有的30年都画成这个线所以问题就来了当你的提领率压爆之后4%的时候根据历史情境模拟你大部分的时候不是差点破产大部分的时候而是你压到4%的话你退休的时候还剩下一大堆的钱没有花完所以这个数据真的会让你吓一大跳你真的踩4%的初始提领率退休的时候你的资产不但没有花完到你过世的时候反而还平均留下三倍的本金这么多而且这还是在你每年都随3%的通膨调整的情况下的结果好那更夸张的时候只有大约10%的情境你的退休的资产根据这张图历史的情境模拟你退休时的资产会低于初始本金真正花光的情境历史上只有仅仅一次这张图它的初始是100万美金你要低于这100万美金大约只有10%的情境会低于一开始的100万美金那真正花光只有唯一的一次所以这也是为什么我们说4%是安全的因为它可以保证在这个五颜六色很像彩虹的所有的情境下这个4%可以让你撑过每一个情境撑过完整的退休期间那我们更惊人的是我们可以对比对比来看我们看下一张图我们可以直接看数字来对比会更明显那这边我是把整个刚刚是100万那我们这边简化到10万10万的初始退休金那结果是一样的刚刚是100万那这张是10万所以你可以把这个你要跟上一张图比的话就把这所有的数字多加一个0就可以了那我们来看你在4%的提领下虽然有10%的几率根据第10百分位你退休的时候资产比初始本金还少但同样你有10%的几率第90百分位它们是双面刃不对称的风险你有90%\n\n分位同样有10%的几率你最后的资产是比初始退休金高达6倍以上这么夸张那换句话来说我们套用在上一张图假设你一开始的退休账户有100万美金你用4%4%固定去提你30年后你的结局在少数的情况下剩不到100万但是你在同样的几率竟然会剩下超过600万以上他们是同样的10%的几率那在最极端的情况各位我们看到最上面那一栏是最极端的情况最差最差你的退休资产4%4%这样提100万美金最后竟然归零了那最好的情况呢竟然剩下超过了900万9倍以上那这两个来说它的风险发生的几率是一样的所以这也是为什么我会说报酬顺序风险它是具有不对称性的因为它的上行潜力非常非常夸张所以你看报酬顺序风险根本就是一个双面刃它不只是让破产的风险会去拉高同样更拉高的是你钱花到多不完的风险所以这边我要总结来说就是说所谓的报酬顺序风险它不仅仅可能在坏的顺序下让一个本来长期报酬合理的投资人提早破产税公园退休金花光陷入财务危机同时报酬顺序风险它也有很大的上行潜力如果你是遇到好的顺序你资产可能膨胀到超过远超过你的想象最后留下的财富比你一开始设想的会多的好几好几倍那我们应该怎么面对这种报酬顺序风险这边我会给一个最后我会给一些干货让各位去应对因为我们要先知道这个报酬顺序风险它不只会往下砍它可能会往上爆有趣的就是因为负利的力量你好的顺序一开始退休后一开始好的顺序它会带来的上行效应它往往比坏的顺序造成的下行损失还是更夸张好几倍的举例来说好了假设你有100根据历史情况假设你有100万的退休金的资产你采4%的固定提领率随3%的通膨调整你有差不多的相同的几率30年后会剩下原本的100万美金或是干脆剩下超过600万甚至你把初始提领率拉高到5%好了我们不提4%了我们提5%固定固定提随3%通膨调整那是不是很多人会建议你说5%有点激进了你应该保守一点3% 4%好了很多人会这样提醒你小心哦你提5%这样可能会有25%的几率你会提前把钱花光但你不要忘记了你同样也有25%的几率你最后的资产退休金的资产会剩将近本来的100万的三倍的本金超过300万而且这还是在你一路享受5%的固定提领率每年都跟着通膨调整的前提下所以有一部分的人他们会保守我也可以理解他们的做法因为他可能会是顾问或者是他会开课他会给他的观众或受众比较保守的做法我们要先稍微克加一点节制一点确保不会破产然后等真的遇到好的行情我们再考虑加码所以这个是普遍比较我看现在比较主流的做法因为这样的策略虽然不是把所有重心放在因为这样的策略我们可以这样想好了他是把所有的重心放在什么避免下行而不是享受上行说实在老实说他不算是坏的建议好了他不算坏的建议为什么我们可以这样想第一他可以降低一些理专财务顾问被告的风险如果你真的建议5%好了你真的遇到他是那个25%倒霉鬼你很可能被告你这样5%5%领领个10年20年破产你可能会被告那想象一下好了如果顾问一开始建议你一开始就花的多如果是你好了你现在套用你现在的情境如果真的遇到坏的报酬顺序在你一开始你提个10年你花光了那你是不是会很生气你是不是会告他那这时候给你建议的人麻烦就大了第二个为什么要比较提倡保守一点因为这也符合大多数的心理习惯因为对大部分的退休人士来说你要他在坏的行情里面比较省吃俭用削减支出的水准心理压力可能还勉强扛得住然后之后在好的行情里面加薪可能是10年20年后就算晚一点那也勉强可以接受起码你前面几年我稍微可能淡淡捏的比较紧稍微扛一下这个是比较符合大多数人的心理习惯可是关键就在这边因为我们为了避免坏的报酬顺序风险然后一开始把支出压得很低就像传统的4%提领策略虽然它可以避免你提早破产但现实的结果就是几乎你每一次很大几率会留下大量的遗产而且如果你遇到更顺风的好的顺序最后留下的多余的财富甚至会高到三倍六倍甚至过更多这么夸张所以这边也引出了一个蛮有趣的蛮有意思的问题会不会现在主流的做法包括顾问甚至是退休组自己你自己本身太过专注于避免资产归零却忽略了另外一面的风险另外同一种的风险就是我们刚刚讲的上行潜力的风险你资产翻了好几倍结果就却因为花的太保守在一开始到最后没有机会享受到换句话来说我们是不是花太多的心思在一开始的设定设定太安全的低提领率上面了反而太少去思考我们怎么应该在退休的过程更动态的去调整支出既能去守住所谓的安全的底线又能好好享受市场好行情带来的红利呢所以怎么解决这个问题我们刚刚讲了这么多十多分钟了讲了这个双面刃坏的下行的风险跟好的上行的潜力它们是不对称的那我们应该怎么去解决那一个比较简单比较实用的做法就是你用所谓的四个字加码机制这个就是比较主流的做法这个也不是坏建议就是如果你真的是比较保守的人你可以用所谓的加码机制概念很简单你一开始退休之后先设比较保守的初始提领率像是4%3.8%4.2%这种比较保守的数字4%左右你事先规划好如果真的市场表现得不错一开始设4%可能接下来市场真的表现不错了你每年每年领4%你发现你的退休金比初始的退休金的金额本金成长了5成以上50%以上本来可能1000万台币你4%4%的领五六年之后发现它变成1500万1600万好那你这时候就直接给自己加薪你不要领4%了你可能直接本来领4%的你把它乘1.1倍直接拉高10%而且这个拉高10%的这个动作检视你可以设定可能每年每三年做一次每两年做一次每五年做一次都可以那这样有什么好处你如果遇到好的报酬顺序你的支出可能会在早期就比较往上跟着调因为你是平均每三年审视一次你可以避免之后留下太多的钱花不完那如果你运气很差好了你遇到比较坏的报酬顺序在退休的初期因为你一开始比较保守你设4%那你每三年去检视一次好就算你一开始比较保守支出也比较低那最后你退休金也依然撑得住三四十年这个是第一个解决的方法叫做所谓的你每年每三年审视一次的加码机制那另外一个也是我比较提倡的就是我在频道有做影片的动态提领策略GK动态提领的那它背后应用的就是所谓的Guardrails护栏机制那GK的它的护栏机制我在我频道有分享那这个护栏机制它到现在2025年已经演变成好几十种了你要介绍其实是要很多时间才介绍的完的那我们只要知道它背后的原理就是护栏机制就好它的玩法是这样的你退休后不是每年固定提某个固定的金额而是持续监控提领金额占资产的比例一旦这个比例突破某个临界点你就做出调整这个就是护栏机制那我这边简单举例假设我们一开始用5%的提领率如果市场下跌了你的资产缩水导致提领率要升到6%了你就必须减少支出因为你的提领速度会超过过快快过你的资产退休金的成长速度这样下去会有\n\n风险 可能会有危险那相反的如果你退休之后市场一路大顺风你的提领率掉到了4%以下那你就可以加薪提高生活品质享受当下多出国玩几次这样的结果就是一个会随着市场表现动态调整的提领方式遇到坏的报酬顺序自动缩减保命遇到好的报酬顺序自动加薪多享受换句话来说这套的护栏机制可以让你不死守某个固定的数字而是随着整个市场的行情去走保持弹性你既能守住底线也不会错过整个市场的好行情带来的负利效应跟上行潜力的背后的红利所以不管你最后要选哪一种方式好了我们今天的直播你要有一个观念就是说市场的报酬顺序风险它是双面刃的因为目前大多人提倡的只是他只看单面他另外一面通通都不讲所以今天我讲座要带给大家的比较大的收获就是说你要不只能用保守的方式去防范最坏的情境结果可能另外一个就是在好行情的时候你也要去care到去关注到因为留下大笔的金额你钱是赚到了可是如果你真的没有花到你心里会留下一定的遗憾当然你钱多到花不完这件事老实说不算坏事但现实是大部分我们要想你退休之后假设你退休后60岁好了你70岁60到70岁你体力健康还够你能玩可是如果你真的太保守了万一在你70 80你才发现到你留太多钱了你要加薪了你70 80岁你怎么加薪你还能走吗你还能出国去玩吗你还有那个体力吗所以我这边要这个值得我们大家一起去思考如果你没有在事先规划好在好的报酬顺序逐步加薪那么等你意识到你自己走在一条顺风顺水的路上的时候你很可能没有那个时间跟健康跟精力去享受这些财富所以至少我们要准备一个策略就是让我们自己能守住底线的同时也能在顺境里面真正能把钱提早花得其所更简单的话来说就是说如果你用5%的初始提领率它一样有几率要么提前把钱花光要么也有一样的几率可以让你的退休金在退休期间翻到三倍以上那么你还会觉得这样太危险吗所以或许这个问题我们可以在这个直播之后我们一起思考一下这个问题它不在于比例本身而是在于你有没有在退休之前就事先规划好一个调整机制能随着行情走在遇到坏顺序的时候能保护自己在好的顺序的时候也能享受红利因为重点不是怕风险而是我们要懂得灵活调整动态应变好那我今天的主题就讲到这边\n\n",
      "model_used": "gemini-2.5-pro-preview-06-05",
      "processing_time": 209.9218099117279,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-08-03T07:48:05.319647",
    "updated_at": "2025-08-03T07:51:35.242477"
  },
  {
    "id": "v9tVfZVnwiyTGMdwAgV0Eg",
    "status": "complete",
    "url": "https://youtu.be/AVR3zeUbWkc?si=fnhcX2YKzZKg5a-y",
    "timestamp": 1766337268.119082,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "摘要",
      "percentage": 100,
      "message": "無法使用任何可用模型生成摘要",
      "timestamp": 1766337517.842433
    },
    "result": {
      "status": "error",
      "message": "無法使用任何可用模型生成摘要",
      "processing_time": 249.72196197509766,
      "summary": null,
      "model_used": null
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T01:14:28.119088",
    "updated_at": "2025-12-22T01:18:37.842609"
  },
  {
    "id": "migEyIVpoUdiF2EJbCmoGg",
    "status": "complete",
    "url": "https://youtu.be/AVR3zeUbWkc?si=fnhcX2YKzZKg5a-y",
    "timestamp": 1766338055.945468,
    "keep_audio": false,
    "model_type": "auto",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "完成",
      "percentage": 100,
      "message": "摘要生成完成！",
      "timestamp": 1766338289.952307
    },
    "result": {
      "title": "【查理芒格】為什麼日本加息會搞垮美股？深度解析日元套利交易的崩潰機制。 #查理芒格 #CharlieMunger #日本加息 #日元套利 #金融危機 #美股崩盤 #投資哲學 #價值投資 #巴菲特",
      "summary": "## **主要觀點與核心價值**\n影片深度解析了日本加息對全球金融市場，尤其是美股的潛在影響，揭示了日元套利交易崩潰的機制。核心觀點在於，全球資產價格的高位維持，並非單純依賴於美聯儲的利率決議或企業財報，而是建立在日元套利交易這一巨大而被忽視的系統之上。當日本央行結束長期的負利率政策並開始加息時，這將引發全球流動性的大幅收縮，導致資產價格暴跌和市場恐慌。影片強調，投資者應該認識到這一系統性風險，並採取逆向思維來預測未來的市場走向。講者指出，日元套利交易的終結將對全球金融市場產生毀滅性的影響，這不僅是因為資金流動的改變，更是因為全球金融系統的脆弱性和人性的貪婪與惰性。影片呼籲投資者在面對這種不確定性時，應該保持理性，審視自己的投資組合，並做好應對市場劇烈波動的準備。\n\n---\n\n## **內容大綱**\n1. 全球金融市場的隱藏引擎：日元套利交易\n2. 日本加息的必然性與影響\n3. 去杠杆化的風險與市場崩潰\n4. 投資者的心理陷阱與市場反應\n5. 危機中的投資策略與應對方法\n\n---\n\n## **關鍵術語與概念**\n- **日元套利交易**: 利用日本的低利率環境，借入日元並投資於高收益資產的交易策略。\n- **去杠杆化**: 減少使用借貸資金的過程，通常會導致資產價格下跌和市場流動性減少。\n- **流動性危機**: 當市場上現金短缺，導致資產難以出售或交易的情況。\n- **逆向思維**: 在投資中，採取與大多數人相反的策略，以預測市場的反向走勢。\n- **安全邊際**: 投資者在購買資產時，確保價格低於其內在價值，以降低風險的策略。\n\n---\n\n## **重要引述與案例**\n> \"日本這個沉默了三十年的經濟體，正在動手拆除全球金融體系最底層的那根神中之柱。\"\n\n**分析**: 此引述強調了日本經濟政策對全球金融市場的深遠影響，指出日元套利交易是全球資產價格高位的基礎，並警告其崩潰可能引發的系統性風險。\n\n> \"這是一場不對稱的賭局。你贏了，可能只是多賺幾個點的收益。你輸了，可能會損失掉一半甚至更多的本金。\"\n\n**分析**: 這段話揭示了當前市場的高風險性，提醒投資者在面對不確定性時，應該更加謹慎，避免高杠杆操作，並強調了風險管理的重要性。\n\n---\n\n## **詳細內容分析**\n\n### **全球金融市場的隱藏引擎：日元套利交易**\n日元套利交易是過去數十年全球資產價格維持高位的核心驅動力。投資者利用日本的低利率環境，借入日元並投資於高收益資產，如美股和歐洲債券。這種交易策略創造了大量的市場流動性，推動了資產價格的上漲。然而，這種套利交易的可持續性受到日本經濟政策變化的威脅，尤其是在日本央行決定結束負利率政策時，將導致資金流動的逆轉。\n\n### **日本加息的必然性與影響**\n日本央行面臨著結束長期寬鬆貨幣政策的壓力，這是由於日元貶值和國內通脹上升所致。加息將導致日元升值，迫使之前借入日元的投資者回補頭寸，進一步加劇市場的流動性緊縮。這一政策轉變不僅影響日本本國市場，還將對全球金融市場產生連鎖反應，特別是對依賴於廉價資金的美股市場。\n\n### **去杠杆化的風險與市場崩潰**\n去杠杆化過程通常伴隨著資產價格的劇烈波動和市場恐慌。當日本加息導致日元套利交易逆轉時，市場將面臨流動性枯竭的風險，投資者將被迫拋售資產以償還債務。這種情況下，市場的相關性會趨向於一，所有資產價格都可能同步下跌，形成自我強化的死亡螺旋。\n\n### **投資者的心理陷阱與市場反應**\n投資者常常陷入損失厭惡和過度自信的心理陷阱，導致在市場下跌時不願止損，甚至加碼補倉。這種行為在市場逆轉時會導致更大的損失。影片強調，投資者應該克服這些心理障礙，保持理性，並在必要時果斷離場，以保護資本。\n\n### **危機中的投資策略與應對方法**\n在面對市場不確定性和潛在的危機時，投資者應該審視自己的投資組合，降低杠杆，並保持足夠的現金流。影片建議投資者應該專注於擁有強大護城河和穩定現金流的優質資產，並在市場恐慌時利用機會進行資產升級。此外，保持心理穩定和理性的投資心態也是應對危機的關鍵。\n\n---\n\n## **實踐應用與建議**\n- **建議1**: 審視投資組合中的杠杆水平，降低高風險資產的配置，以應對市場波動。\n- **建議2**: 保持足夠的現金流，以便在市場恐慌時有能力購買被低估的優質資產。\n- **建議3**: 專注於理解和投資於自己能力圈內的資產，避免涉足不熟悉的市場和金融產品。\n\n---\n\n## **相關資源與延伸閱讀**\n- **資源1**: 《The Intelligent Investor》 by Benjamin Graham - 關於價值投資的經典著作，提供了安全邊際和長期投資的理念。\n- **資源2**: 《A Random Walk Down Wall Street》 by Burton Malkiel - 探討市場效率和投資策略的經典讀物。\n- **資源3**: 《Against the Gods: The Remarkable Story of Risk》 by Peter L. Bernstein - 關於風險管理和金融市場歷史的深入分析。\n\n---\n\n## **總結與未來展望**\n影片揭示了日本加息對全球金融市場的潛在威脅，強調日元套利交易的崩潰可能引發的系統性風險。投資者應該認識到這一風險，並採取適當的防範措施，如降低杠杆和保持現金流。在未來，全球金融市場可能面臨更大的不確定性和波動性，投資者需要保持理性，專注於長期價值投資，並做好應對市場劇烈變化的準備。隨著全球經濟環境的變化，新的投資機會和挑戰將不斷出現，投資者應該不斷學習和適應，以在這個充滿挑戰的時代中生存和發展。",
      "transcript": "多数人盯住纽约的股价看板,却没意识到,真正的海啸正从东京湾卷过来。这就是典型的人类认知缺陷,总是看住眼前热闹的地方,却忽略了那个正在角落里滴答作响的定时炸弹。如果你现在还觉得岁月静好,觉得你的资产组合固若金汤,那你最好坐稳了,把耳朵竖起来听清楚。日本这个沉默了三十年的经济体,正在动手拆除全球金融体系最底层的那根神中之柱。一旦这根柱子倒了,这东靠廉价资金堆砌起来的摩天大楼,不会只是晃两下那么简单,而是会发生毁灭性的坍塌。这不是危言耸听,这是我基于几十年市场经验,加上最基本的算术逻辑推演出来的必然结果。你们当中的绝大多数人根本不理解全球金融市场运转的真实引擎是什么。你们以为是美联储的利率决议,是英伟达的财报,还是美国总统的选举。错了,大错特错。过去二十年,甚至更长的时间里,全球资产价格,包括你们手里的股票,房子,债券,甚至加密货币之所以能维持高位,背后只有一个核心逻辑,那就是日元套利交易。这是一个巨大的,被所有人视为理所当然的免费午餐系统。简单说,就是全世界的投机者,对冲基金,银行,甚至是普通的家庭主妇,都在做同一件事,从日本借出几乎零利率的日元,然后把这些日元换成美元,欧元,去购买那些收益率更高的资产。这就像是你发现了一家银行,借钱不用还利息,或者利息低到可以忽略不计,你会怎么做?你会借爆它,你会借无数的钱去买任何能产生回报的东西。这就是过去三十年全球流动性的最大来源。日元,就是全球金融市场的血液。而日本央行,就是那个不断免费供血的血库。但是,如果你学过最基本的物理学,或者稍微懂一点普世智慧,你就知道这个世界上没有永动机,也没有真正的免费午餐。任何违背常识的系统,最终都会以一种惨烈的方式回归均值。现在,日本撑不住了,这颗核弹的引信已经被点燃,那就是日本必须结束负利率,必须开始加息。这听起来像是个无聊的宏观经济新闻,对吧?如果你这么想,那你就是那个在铁轨上捡硬币,却没听见火车汽笛声的傻瓜。为什么这件事如此致命?因为这是一个规模高达数十万亿美元的杠杆游戏。试想一下,当日本央行宣布加息,哪怕只是微不足道的一点点,那个曾经源源不断流出的廉价日元水龙头就被关上了。更可怕的是,之前借出的那些钱,那些被兑换成美元买了美国科技股,买了澳洲房产的日元,现在必须流回去。这就是去杠杆。在金融世界里,去杠杆从来都不会温和地进行,它总是伴随着资产价格的暴跌,流动性的枯竭,以及恐慌性的踩踏。这就像是一场拥挤的剧院里,突然有人喊了一声祝福了,而出口只有一个,所有人都在同一时间想要冲出大门,想要把手里的美元资产卖掉,换回日元去还债。结果是什么?结果就是门被堵死了,人被踩死了,而火还在烧。我一直在强调逆向思维。如果你想知道未来会发生什么,先去想想什么情况下会导致最坏的结果。如果日元大幅升值,那些借日元买美股的人,他们的债务成本会瞬间飙升。原本他们以为借钱是免费的,现在不仅要付利息,还要承担汇率损失。双重打击之下,他们唯一的选择就是不计成本的抛售资产。这就是为什么我说日本正在引爆一颗核弹。这颗核弹的冲击波会直接炸穿华尔街的资产负债表。很多人问我,为什么日本央行这么傻,非要现在加息?这不是他们傻,是他们没办法。这就是经济规律的惩罚。日本长时间维持极度宽松的货币政策,试图用印钞票来对抗通缩,这本身就是一种反自然的行为。现在,通胀的火焰终于烧到了他们自家后院,日元贬值到了让日本国民无法忍受的地步,进口成本飙升,生活质量下降,政治压力和经济现实逼得他们不得不动手。这就是路径依赖的代价。当你长时间依赖错误的方法来解决问题,你最终会发现你已经走进了一条死胡同,回头也是死,往前走也是死,只能选择一种死得没那么难堪的方式。我们要谈谈这里面的人性,为什么这个泡沫能吹这么大?因为贪婪加上思维的惰性,华尔街的那帮精英,穿着昂贵的西装,拿着长春藤的文凭,却潜入最愚蠢的事情。他们假设日元永远不会涨,假设利率永远是零,假设这种套利游戏可以玩到地老天荒。他们把这种极度危险的投机行为包装成低风险套利,然后卖给养老基金,卖给保险公司,卖给你们。这简直就是把老鼠药当成糖果在卖。我见过太多次这种事情了。1998年的长期资本管理公司崩盘,如果你们还记得的话,本质上也是在玩类似的杠杆游戏。只不过那时候的规模和现在比起来,简直就是小巫见大巫。现在涉及的资金量是那时候的一百倍,一千倍。而且,这次牵涉到的是全球第三大经济体的主权、货币和国债。日本国债市场曾经被称为寡妇制造机,因为任何试图做空它的人都死得很惨。但现在,日本央行自己成了那个最大的做空者。他们控制不住长端利率了。一旦日本国债收益率飙升,这意味着什么?意味着全球无风险资产的定价之帽松动了。所有的资产价格都是基于无风险利率定价的。当这个分母变大,分子的估值,也就是你们手里的股票价格,必然要缩水。这是简单的损血体,但大部分人选择视而不见。我总是说,如果你不知道随时牌座上的傻瓜,那你就是那个傻瓜。在这场全球流动性盛宴里,最后买单的人绝对不是那些最早即日元出来炒作的对冲基金经理。他们早就把利润装进口袋跑了。买单的会是那些在高位接盘的人,是那些相信这次不一样的人,是那些看住资产价格上涨就觉得自己变聪明了的人。你们需要明白一个概念,叫做合成谬误。对个体来说,借低息日元卖高息美债是理性的,聪明的决策。但当所有人都这么做,并且规模大到几万亿美元的时候,这个行为就变成了集体自杀。现在,我们正处于这个集体自杀仪式开始的前夜。这种情况下,分散投资还有用吗?传统的投资组合理论告诉你,要股债平衡,要全球配置。但在这种级别的流动性危机面前,所有的资产相关性会瞬间变成一。也就是说,股票会跌,债券会跌,黄金可能也会因为保证金需求而被抛售,所有的东西都会一起跌,因为大家缺的不是资产,缺的是现金,是流动性。当所有人都在卖东西换钱的时候,市场上就没有买家了。流动性黑洞一旦形成,连上帝都救不了你。我不想在这里给你们描绘世界末日的景象,我只是在描述一个正在发生的机械过程。这就像你看住一根橡皮筋被拉长,拉长,再拉长,你知道它迟早会断,或者会反弹伤人。现在,日本央行手里就拿住这根橡皮筋的一端,他们已经拉不住了,准备松手。这不仅仅是金融问题,这还涉及到地缘政治和国家竞争力\n\n意味着美国国债的最大买家之一要撤了。美国现在赤字这么高,发了这么多债,如果没人买怎么办?收益率只能继续飙升,这会进一步压垮美国的银行业和商业地产,这是一个连锁反应,是多米诺骨牌。第一块骨牌在日本倒下,最后砸死人的地方可能是在美国的写字楼市场或者欧洲的银行系统。你们要警惕那些所谓的专家现在的言论,他们会告诉你,市场已经消化了这个预期,或者日本央行会很谨慎,不会乱来。这些话听听就好,千万别当真。历史告诉我们,在重大转折点上,共识通常都是错的。市场从来没有真正消化过黑天鹅,因为如果消化了,它就不叫黑天鹅了。而且,这也不是黑天鹅,这是灰犀牛,它就站在那里,体型巨大,喘着粗气,正对着你冲过来,而大多数人还在讨论这只犀牛的皮毛亮不亮。在这个阶段,比赚钱更重要的是生存。我一辈子都在避免做愚蠢的事情,而不是追求做决定聪明的事情。现在,把资产暴露在日元套利反转的风险之下,就是最愚蠢的事情。你们需要审视自己的负债,审视自己的杠杆。如果你用了杠杆,现在就去把它降下来。如果你持有那些估值高到离谱,完全依赖流动性支撑的估值股,现在就是清醒过来的时候了。我不喜欢预测短期市场波动,那是算命先生干的事。但我看重的是概率。当下这个局势,下行风险远远大于上行收益。这是一场不对称的赌局。你赢了,可能只是多赚几个点的收益。你输了,可能会损失掉一半甚至更多的本金。在这种赔率下,聪明人会选择离场观望,或者持有最坚硬的资产。日本这颗核弹,其威力在于它的隐蔽性和广泛性。它渗透到了全球金融系统的每一个毛细血管。你买的保险理财,底层资产可能挂钩了日元套利交易。你投资的新兴市场基金,资金来源可能就是热钱,甚至你所在公司的融资成本都间接被这个体系影响。没有人能完全置身事外。这就是现代金融体系的脆弱性。万物互联,也就意味着万物痛悔。很多人以为我在贩卖焦虑,其实我是在贩卖常识。常识告诉我们,借钱是要还的,利息是不能永远为零的,货币是不能无限操罚的。这些常识在过去几十年被遗忘了,现在市场要用最残酷的方式给所有人上一课。我要你们思考的是,如果明天早上醒来,日元对美元升值了20%,全球股市暴跌30%,你的生活会受到什么影响?如果你没想过这个问题,那你就是在裸奔,别指望政府会救你。这一次,政府自己都泥菩萨过江,各国央行手里的工具箱已经快空了,利率已经在高位,债务已经在天花板,他们能做的非常有限。这将是一场硬碰硬的逐鹿。请记住,金融市场的记忆只有7秒,但经济周期的规律跨越百年。我们现在正站在一个长周期的尾部,旧的秩序正在瓦解,新的秩序还没建立。这是最混乱,最危险,但也最考验人性的时刻。很多人把金融市场看作一个线性系统,以为A导致B,B导致C。这是一种极度幼稚的单线路思维。现实世界是复杂的,是福音性系统。我们现在面临的是我常说的Laulala Pelusa效应,也就是多种因素叠加产生的超级核反应。日本央行的动作只是一个触发器,它引爆的是累积了十几年的巨大失衡。这场灾难的破坏力之所以会超出所有人的想象,是因为当今市场结构本身就存在致命的缺陷。你们要理解现代金融市场的一个核心变化,那就是被动投资和算法交易的统治地位。过去,市场里还有像沃和沃伦这样的人在做价值发现,在股价过低时买入,在过高时卖出,这提供了一种稳定的力量。但现在呢,绝大多数资金都涌向了ETF,涌向了指数基金,这些基金是没有脑子的,它们不关心公司的基本面,它们只知道机械的买入。当日元套利交易反转导致第一批对冲基金抛售资产时,市场下跌,这时候指数基金的机器人会怎么做?它们会因为市值的收缩而被迫卖出。这种卖出会引发更深幅度的下跌,进而触发量化基金的止损线,引发更大规模的抛售,这是一个自我强化的死亡螺旋。这就像一群驴鼠排队跳崖,前面的跳了,后面的不得不跟着跳,因为它们被绑在同一根绳子上。那些你们引以为傲的科技巨头,所谓的七姐妹,现在就是这个死亡螺旋的风暴眼。我承认这些公司很优秀,有的甚至可以说是伟大的公司,但在每股几百美元的价格上,它们不再是伟大的投资,而是昂贵的现金。这些公司的估值是建立在什么基础上的?是建立在利率长期维持低位以及全球流动性无限这两个假设之上的。现在,日本把流动性的插头拔了,这两个假设同时崩塌。你们要知道,股价是未来现金流的折现。当折现率因为全球无风险利率的上升而提高时,未来的钱就不值钱了。这是一个简单的数学问题,但在贪婪面前,没人愿意做这道数学题。大家都在赌博,赌会有一个更大的傻瓜,以更高的价格从自己手里接过这块烫手山芋。特别是关于人工智能的狂热,我看过太多次类似的剧情了。互联网泡沫,铁路泡沫,运河泡沫,历史总是压住相同的运角,技术的进步是真的,但华尔街围绕技术吹起的泡沫是假的。所有的资本都在疯狂涌入这个领域,这本身就是一个危险的信号。当资金成本是零的时候,你可以随便烧钱去训练模型,去买显卡,没人在乎汇报率,但是当资金成本变成5%,6%甚至更高时,那些只有故事没有利润的公司会死得非常难看。而日本加息恰恰就是推高全球资金成本的关键一步。一旦这些科技股开始崩盘,它们在指数中的权重那么大会直接把整个大盘拖入深渊。这时候,你手里的标普500指数基金就不再是避风港,而是绞肉机。还有一个更隐蔽的炸弹,是美国的银行业和商业地产。这两者是绑在一起的。这几年,商业地产因为远程办公和利率上升已经摇摇欲坠。是谁在支撑它们?是那些中小银行。而这些银行又是靠什么豁出去?靠的是存款和债券投资。现在,如果日本投资者,他们是美国商业地产债务证券和美国国债的大买家,开始撤退,谁来接这个盘?没人接。这意味着抵押品价值会暴跌,银行的资产端会出现巨大的窟窿。去年西谷银行的倒闭只是一个预演,真正的海啸还在后面。当流动性枯竭时,银行会首先收缩信贷,这会直接扼杀实体经济的喉咙。这不是简单的股价下跌,这是信贷周期的暴力终结。我还要谈谈那个被我称之为老鼠咬的东西,加密货币。在日元套利交易盛行的时候,大量的投机资金流向了这种毫无内在价值的东西。人们买它不是因为它能产生现金流,而是因为它能涨。这是一种纯粹的博彩游戏。当潮水退去,当日元这个廉价资金的来源切断后,这些投机资产会第一个被抛弃,因为它们没有底层资产支撑,没有厂房,没有利润,什么都没有,只有空气和信心。当信心崩溃,价格归零的\n\n精神科医生，你们必须明白,风险和危险是两码事。股市波动是风险,但本金永久性损失是危险。现在市场面临的不是波动,而是毁灭性的危险。日本的核弹引爆后,会导致全球资产的重新定价。过去三十年,我们习惯了资产价格只涨不跌,习惯了央行总是会在气候托底。这种习惯养成了极度的自满,投资者忘记了什么叫安全边际。格雷厄姆教导我们,买股票要在价格远低于价值时买入,以此来构建安全边际。但现在,看看市场上的资产,哪还有安全边际可言。不仅没有边际,甚至是透支了未来十年的增长。这就像是一个体重三百斤的人在走钢丝,稍微一点风吹草动,比如日本加息,就能让他摔得粉身碎骨。很多人在这种时候会犯一个致命的心理错误,叫做损失厌恶。当市场开始下跌,你的账户出现亏损时,你的本能反应不是止损,而是死扛,甚至补仓,试图贪低成本。你告诉自己,只要我不卖,就不是浮亏,这是自欺欺人。市场不会因为你持仓成本高就通行你。在趋势发生根本性逆转的时候,死扛的结果只有一个,那就是被深埋。你需要克服这种蜥蜴大闹带来的本能,用理性的前额叶去思考,承认错误,果断离场,保留现金,这才是生存之道。但很遗憾,99%的人做不到这一点,他们会眼睁睁看住资产缩水,直到最后精神崩溃在底部割肉。这种全球性的流动性收缩还会引发新兴市场的灾难。很多新兴国家的经济本质上也是依赖美元和日元的流动性输入。当资金回流发达国家救火时,这些新兴市场的汇率会崩溃,债务会违约。这是一个连锁反应,没有哪个经济体是孤岛。你以为,你买的是某个新兴市场的互联网龙头,觉得它增长潜力无限。但在全球宏观大势面前,个股的基本面微不足道,覆巢之下焉有完卵。我这辈子见过很多聪明人失败,不是因为他们不够聪明,而是因为他们太自信,太想要赚进最后一个铜板。他们不懂得敬畏周期,日本这一次的转向标志着一个长达30年的廉价资金时代的终结。这是一个时代的落幕,在这种宏观环境的剧烈切换器,原有的经验往往是失效的,甚至是害人的。你过去赚钱的方法可能是因为你站在风口上,现在风停了,甚至开始刮反向的飓风,你如果还坚持原来的废法,摔死是必然的。我们再来谈谈所谓的多元化配置,很多理财顾问告诉你,要把鸡蛋放在不同的篮子里,这在平时是有道理的,但在流动性危机爆发的时刻,所有的篮子都会掉在地板上,相关性会趋向于一。日股跌,美股也会跌,欧美股也会跌,甚至商品也会跌,因为所有的资产价格都含有杠杆这个成分,而去杠杆是无差别的攻击。这时候,唯一负相关的资产可能只有极少数的避险工具和现金。所以,不要以为你买了全球股票就能分散风险,你只是把风险分散到了不同的地理位置,但本质上你还是在做多流动性。一旦流动性枯竭,你的全球配置就是全球亏损。而且,你们要警惕那些复杂的金融衍生品。在过去几年,为了在低利率环境下寻找收益,华尔街发明了各种结构化产品,什么雪球结构,什么挂钩指数的票据。这些产品的说明书厚得像砖头,里面藏满了你看不懂的条款。这些产品通常都隐含了卖出波动率的策略。当市场平稳时,它们能给你带来不错的票息。但当市场剧烈波动,就像现在日本搞出的动静一样,这些产品会瞬间爆仓,让你血本无归。我一向反对投资任何我看不懂的东西。如果你不能用一句话向你12岁的孩子解释清楚你是怎么赚钱的,那你就不要碰它。现在,这些复杂的衍生品就是埋在金融系统里的地雷阵,随时可能被引爆。还有一个被忽视的因素是企业的回购。过去十年,美股上涨的一大动力是公司发债回购自己的股票。这是一种人为制造美股收益增长的财务魔术。但现在利率高企,发债成本太高了,回购的游戏玩不下去了。没了回购这个最大的买家,谁来支撑股价?这就像是发动机熄火了,飞机还能滑翔一会儿,但最终是要掉下来的。日本的加息相当于给这个已经熄火的发动机又泼了一盆冷水。你们可能会觉得我太悲观,太刻薄,但我告诉你们,盲目的乐观才是最大的毒药。真正的乐观是看清了生活的真相之后依然热爱生活。而投资领域的乐观往往是无知的代名词。我现在看到的是满大街的无知,人们在庆祝股价的新高,却看不见脚下的深渊。日本央行行长可能就是那个指出皇帝没穿衣服的小孩,只不过他用的不是声音而是加息这个动作。这场危机最可怕的地方在于,他可能不会像2020年3月那样微型反转,那时候央行可以无限印钞救市。但这一次,通胀这只老虎已经出笼了,央行不敢随便印钞了。他们陷入了两难,救市,通胀失控,不救,资产崩盘,这就是所谓的智商险警。在这种环境下,资产价格的调整将是漫长而痛苦的,可能持续数年,这是一个钝刀子割肉的过程,会消磨掉你所有的耐心和信心。我想让你们反思一下自己的资产负债表,你有多少债务?你的现金流能覆盖利息吗?如果你的股票资产缩水50%,你的生活质量会下降吗?如果答案是肯定的,那你现在就是在赌博,在这个充满不确定性的世界里,唯一的确定性就是不确定性本身。而日本这颗核弹把这种不确定性放大到了机制,它破坏了全球金融系统的平衡态,让系统进入了混沌状态。在混沌中,任何预测模型都是失效的,唯一有效的只有防御。投资的第一条准则永远是不要亏损,第二条准则是记住第一条。但在过去的狂热市场中,人们把这条准则改成了不要错过机会,这就是贪婪战胜了理智。现在,理智回归的时候到了,而且是带着惩罚回归的。市场先生是一个狂躁抑郁症患者,前段时间他极度亢奋,现在他即将进入深度的抑郁期,你不能陪着他一起疯,你要站在岸上看着他在水里挣扎,不要指望有人会提前通知你逃顶。当真正的崩溃开始时,你是迈不出去的。流动性就像出租车,下雨天你永远打不到。现在虽然天空已经乌云密布,但还没下暴雨,这也许是你最后的调整窗口。我不是让你去恐慌性抛售,而是让你去进行压力测试。假设最坏的情况发生,你能活下来吗?如果不能,那就赶紧行动。不要等到洪水淹到了脖子才想起来去造船。日本的举动实际上是在告诉全球,便宜钱的派对结束了,音乐停了,服务员要来结账了。看看你周围,多少人还醉在酒桌上不肯走,多少人还在透支信用卡点香槟,这些人就是即将被清算的对象。这是一场财富转移的游戏,财富从那些盲目乐观、高杠杆、投机取巧的人手里转移到那些谨慎、理性、持有现金的人手里\n\n也明白了这场海啸不可避免。那么现在摆在桌面上最重要的问题就是,你该怎么办?大多数人在危机来临时的反应是像无头苍蝇一样乱撞,试图抓住任何一根救命稻草。这通常只会加速他们的灭亡。我要给你们的建议,听起来可能非常反直觉,甚至让你们觉得枯燥。但这是我九十多年人生经验总结出来的真理。首先,你要学会拥抱无聊。在金融风暴肆虐的时候,最伟大的操作往往是不操作。你们总是觉得如果不做点什么,资产就会缩水。这种焦虑是被华尔街灌输的伪概念。经纪人想让你频繁交易,因为那是他们赚钱的方式,不是你赚钱的方式。当日元套利交易的反转导致市场剧烈波动时,每一次盲目的卖卖都可能是在接飞刀或者割肉。最聪明的猎人是那些能够在狂风暴雨中趴在草丛里一动不动的人。你需要有一种屁股坐得住的定力。这一点非常难,因为人类的基因决定了我们在危险面前倾向于战斗或逃跑,而不是静止。但你必须克服这种基因缺陷。如果你的投资组合是基于长期价值构建的优质资产,那就关掉电脑,去读书,去陪家人。别去看那个让你血压升高的红色数字。其次,重新审视现金的价值。在通胀时期,大家说现金是垃圾,但在通货紧缩或者流动性危机时期,现金就是氧气,就是上帝。当日本把全球流动性抽钱,所有资产都在打折出售时,持有现金就意味着你持有对未来所有资产的看涨期权。这是一种巨大的优势。这时候的现金不是让你去卖面包的,而是让你去捡黄金的。想象一下,如果明天伯克希尔哈萨维的股价跌了一半,或者苹果公司的市盈率跌到了个位数,你有钱买吗?大多数人那时候都在忙着追加保证金,或者在哭爹喊娘。如果你手里有现金,你就是这个市场的王者。所以,不要急着把手里的钱全部换成资产,保留足够的弹药,等待那个大箱出现的时刻。你需要一把补枪枪,而现金就是你的子弹。这就引出了我的第三个建议,利用危机进行资产升级。日本引发的这场动荡会把所有的资产价格打下来,无论是好资产还是坏资产,市场在恐慌时是不分青红皂白的。这就是你的机会。你要做的是把手里的垃圾扔掉,去捡别人丢弃的钻石。什么是钻石?就是那些拥有强大护城河,定价权高,现金流充沛,不需要巨额资本开支就能维持增长的伟大公司。平时这些公司贵得离谱,你也许根本买不起。但在流动性危机中,它们也会跌,甚至跌得很惨。这时候,你要敢于下重注,别去搞什么分散投资,那是对无知者的保护。如果你知道自己在做什么,如果你看到了一个千载难逢的机会,那就全力出击。这就像你在好市多看到你最喜欢的洗发水打了三折,你会只买一瓶吗?你会把货架搬空?但这里有一个前提,就是你要严守你的能力圈。这场危机很复杂,涉及外汇、债券、宏观经济。如果你不懂宏观,不懂日元汇率机制,那就别去赌外汇,别去碰那些你看不懂的衍生品。我知道很多人会觉得自己看懂了,觉得自己能预测日元什么时候坚定。算了吧,连日本央行行长都预测不准,你凭什么觉得你能行?待在你懂的领域里,如果你只懂消费品,那就盯住消费品公司。如果你只懂能源,那就盯住石油公司。如果你的能力圈很小,没关系,那就在边界内活动。跨出能力圈去赚钱,即使赚到了也是运气,迟早会凭实力输回去。在危机中,越界就是招死。我们要谈谈心态。这场危机本质上是一场对人性的压力测试。你会看到身边的人破产,会听到各种末日言论,会感受到前所未有的恐慌。这种时候,保持理性是极度困难的。你需要一种斯多噶学派的精神,要把市场的波动看作是天气变化,下雨了就打伞,刮风了就穿衣。不要对着天气生气,也不要试图改变天气。你要控制你能控制的,接受你不能控制的。你不能控制日本什么时候加息,不能控制美联储什么时候降息,但你能控制你的负债率,控制你的情绪,控制你的预期。降低预期,这是通往幸福,也是通往投资成功的秘诀。过去几十年,投资者被宠坏了,习惯了每年15%,20%的汇报率。这种好日子可能一去不复返了。在全球去杠杆的大背景下,未来的资产回报率会回归均值,甚至更低。如果你还抱住一夜暴富的心态,那你就会在市场中反复被收割。你要接受一个现实,赚钱会变得很难,变得很慢。但慢不代表不好,负利的力量在于持久,而不在于爆发。只要你不犯致命错误,时间就是你的朋友。日本这场危机可能会持续很久,也许是一年,也许是十年。看看日本自己失去了多少年,你要做好打持久战的准备,还要警惕一种心理,叫羡慕。在泡沫破裂的前夕,总会有人赚得比你多,总会有人在投机中大发横财。哪怕是在危机初期,也会有人通过做空或者高频交易赚取暴利。不要去羡慕他们,羡慕是七宗罪里最愚蠢的一项,因为它不能给你带来任何乐趣,只会带来痛苦。专注于你自己的计分板,如果别人在玩火,而你在搬砖,别觉得自己傻,最后烧死的一定是万火的。坚持走正道,坚持做正确的事情,哪怕这条路现在看起来很拥挤,或者很孤独。我想强调一点,不要试图去预测敌在哪里。没人知道敌在哪里,当日本撤资,美股下跌时,你会听到无数专家说到底了,抄底,别信。在下跌趋势形成后,地下面还有底,地下室下面还有地狱。你不需要埋在最低点,你只需要埋在便宜的区间。如果一间公司的内在价值是100块,现在跌到了50块,你就买。如果它跌到了30块,你就再买。别想着非要卖在20块的最低点,那是上帝做的事。模糊的正确原生于精确的错误,只要价格低于价值并且留有足够的安全边际,你就出手。这就是价值投资的全部秘密,简单但不容易。关于杠杆,我在这篇文章里反复强调,现在我要做最后的警告,在接下来的日子里,如果你还想睡个安稳觉,那就把你的杠杆清零,不要借钱炒股,不要借钱买房,不要借钱消费。日本这颗核弹的冲击波专门定向爆破高杠杆的资产负债表。如果你没有债务,你就拥有无限的等待时间。市场再怎么跌,只要你不卖,就不会死。但如果你有杠杆,时间就是你的敌人,每一秒钟都在燃烧你的生命。我见过太多聪明人,智商150,就因为用了杠杆,最后在黎明前倒下。别做那个倒霉蛋。你们还要思考一个更深层的问题,关于财富的意义。如果你在这次危机中幸存下来,甚至因为抓住了机会而变得更富有,你要用这些钱干什么?如果只是为了买更大的游艇,更多的房子,那你还是个穷人,精神上的穷人。真正的财富是自由,是独立,是不受他人意志左右的能力。积累财富是为了让你在面对生活的不确定性时,有说不的权\n\n是一次社会阶层的重组那些拥有普世智慧拥有理性拥有耐心的人会从那些浮躁贪婪盲目的人手中接管财富这符合自然规律不要指望政府会为你的错误买单虽然政府会救市但他们救的是系统不是你个人在宏观的车轮下个体是渺小的你要做自己的救世主多读书多思考历史如果你读过1929年的大萧条读过1973年的石油危机读过1990年的日本泡沫破裂你就知道现在发生的一切都不是新鲜事相关底下没有新鲜事人类的愚蠢是周期性的市场的崩溃也是周期性的每一次危机都是财富的重新分配对于有准备的人来说这是最好的时代对于没准备的人来说这是最坏的时代日本正在引爆的这颗核弹或许会让今晚的夜色变得格外慎重但也许正是这声巨响能唤醒那些审睡在虚假繁荣中的人不要恐慌恐慌解决不了问题去检查你的资产去削减你的开支去积累你的现金去磨练你的心智当洪水退去的时候我希望依然能看到你站在岸上穿着整齐的衣服而不是像其他人一样在裸泳投资是一场修行是对人性的挑战你不需要比别人聪明你只需要比别人更守纪律更不情绪化在这场全球资产大洗牌的倒计时中愿理性和常识与你同在记住活下来就是胜利只要你活着且手里有筹码明天太阳升起的时候世界就是你的好了我说的够多了现在去做你该做的事吧或者更重要的事别去做你不该做的事\n\n",
      "model_used": "gpt-4o",
      "processing_time": 234.0058581829071,
      "status": "success"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T01:27:35.945470",
    "updated_at": "2025-12-22T01:31:29.952385"
  },
  {
    "id": "swc3-AHun4BLkeXlwiJnJQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766339680.280389,
    "keep_audio": false,
    "model_type": "auto",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "timestamp": 1766339684.034643
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "processing_time": 3.7509758472442627
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T01:54:40.280395",
    "updated_at": "2025-12-22T01:54:44.034764"
  },
  {
    "id": "lcwVJ4isr3D697h9KluBIQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766339696.648748,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "timestamp": 1766339697.663885
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "processing_time": 1.0138771533966064
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T01:54:56.648750",
    "updated_at": "2025-12-22T01:54:57.664000"
  },
  {
    "id": "yhC-bLTNW2iYitGxAjPo1g",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766342083.068898,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.004701375961303711,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T02:34:43.068908",
    "updated_at": "2025-12-22T02:34:43.074273"
  },
  {
    "id": "G9oFmUaKp-Oj5O4eyidfpg",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766342090.105645,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.0005412101745605469,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T02:34:50.105647",
    "updated_at": "2025-12-22T02:34:50.106660"
  },
  {
    "id": "K7D_KVtYe4PoyxhC5S1q5w",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766342147.1096268,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.003453969955444336,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T02:35:47.109684",
    "updated_at": "2025-12-22T02:35:47.119937"
  },
  {
    "id": "HydgnpKSFrjrz_AujzmIPA",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766342161.1517382,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.0011188983917236328,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T02:36:01.151745",
    "updated_at": "2025-12-22T02:36:01.154077"
  },
  {
    "id": "R_6AtPIFHif_kZJNRe3bbw",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766345311.668187,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 4.842942953109741,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T03:28:31.668195",
    "updated_at": "2025-12-22T03:28:36.513048"
  },
  {
    "id": "47_0-c8v9Fu42Ia4-F6LQQ",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8",
    "timestamp": 1766345328.9340181,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.003301858901977539,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-22T03:28:48.934022",
    "updated_at": "2025-12-22T03:28:48.938170"
  },
  {
    "id": "yrds0utQU0Yx5qwneUDP0g",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8&t=1138s",
    "timestamp": 1766753611.291757,
    "keep_audio": false,
    "model_type": "gemini",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {},
    "result": {
      "status": "error",
      "message": "處理過程中發生未預期錯誤: Client.__init__() got an unexpected keyword argument 'proxies'",
      "processing_time": 0.0029730796813964844,
      "title": "未知",
      "summary": null,
      "model_used": "N/A"
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-26T20:53:31.291764",
    "updated_at": "2025-12-26T20:53:31.295400"
  },
  {
    "id": "wcBoJ_55OOGXcTVCjGwkKg",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8&t=1138s",
    "timestamp": 1766754052.942445,
    "keep_audio": false,
    "model_type": "auto",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "timestamp": 1766754106.743936
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "processing_time": 53.80116415023804
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-26T21:00:52.942448",
    "updated_at": "2025-12-26T21:01:46.744185"
  },
  {
    "id": "YjolVwPRjw8UshWaXCYq7A",
    "status": "complete",
    "url": "https://www.youtube.com/watch?v=FR75BgFhaD8&t=1138s",
    "timestamp": 1766754669.5582342,
    "keep_audio": false,
    "model_type": "auto",
    "gemini_model": "gemini-3-flash-preview",
    "openai_model": "gpt-4o",
    "whisper_model": "gpt-4o-transcribe",
    "progress": {
      "stage": "下載",
      "percentage": 100,
      "message": "下載失敗: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "timestamp": 1766754672.4784188
    },
    "result": {
      "status": "error",
      "message": "下載影片時發生錯誤: \u001b[0;31mERROR:\u001b[0m [youtube] FR75BgFhaD8: Requested format is not available. Use --list-formats for a list of available formats",
      "processing_time": 2.9198379516601562
    },
    "error": null,
    "is_cancelled": false,
    "created_at": "2025-12-26T21:11:09.558236",
    "updated_at": "2025-12-26T21:11:12.478600"
  }
]